{
    "https://insideevs.com/news/712806/ford-bluecruise-ntsb-probe-crash/": {
        "pubdate": "Mon, 18 Mar 2024 18:00:53 +0000",
        "title": "Feds Probe Ford BlueCruise Following Fatal Crash",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/AkQml2/s3/ntsb-mustang-mach-e-crash.jpg",
        "content": " The National Transportation Safety Board has launched an investigation into a fatal crash involving a Ford Mustang Mach-E equipped with Ford's Level 2 driver assistance system, BlueCruise. The crash took place on I-10 near San Antonio, Texas late last month. According to reports, the Mustang Mach-E collided with a Honda CR-V stopped in the center lane of an interstate at around 10 PM. The stationary CR-V reportedly had no lights on, which may have resulted in the Mach-E's cameras being unable to pick up the object and engage Automatic Emergency Braking.  Get Fully Charged  NTSB's Requires Certain Driver-Assistance-Related Crashes to be Reported  The NTSB is no stranger to probing crashes involving Level 2 driver assistance features. In fact, the agency requires that any crashes be reported if they involve a Level 2 driver-assistance feature if the accident resulted in a fatality, a vehicle tow-away, an airbag deployment, or if any individual is transported to a hospital for medical treatment.    At the center of the investigation is Ford's Level 2 driver assistance system: BlueCruise. Ford markets the $75-per-month tech as a \"hands-free highway driving feature\" when driving on prequalified sections of divided highways. Ford says it has mapped out more than 130,000 miles of roads in North America to be compatible with its hands-free feature, which includes a large section of highway I-10 outside of San Antonio. However, given that the system is defined as a Level 2 driver-assistance feature, the person behind the steering wheel is considered to be responsible for the car's operation at all times.   It's not clear whether Ford BlueCruise was engaged at the time of the crash, however, the NTSB mandates that fatal accidents involving Level 2 driver-assistance systems engaged 30 seconds prior to a collision are reported to the agency. InsideEVs has reached out to the San Antonio Police Department for clarification but has not received further information at the time of writing.   Get the InsideEvs Newsletter Sign Up Today   Ford has, however, made BlueCruise hardware standard on most compatible Ford vehicles starting late last year. Reports indicate that the Mach-E involved in the crash was equipped with BlueCruise, likely prompting the investigation to determine if the feature was engaged and what exactly may have happened in the moments leading up to the crash. At this point, the probe is preliminary and meant to gather more information about the crash. NTSB issued the following statement on the purpose of its investigation:  NTSB is investigating this fatal crash due to its continued interest in advanced driver assistance systems and how vehicle operators interact with these technologies. A team of investigators from the NTSB’s Special Investigations Branch of the Office of Highway Safety will travel to San Antonio to examine the wreckage and collect information about the accident site and sequence of events leading to the collision.  If BlueCruise was enabled, the inability to detect the stationary vehicle late at night isn't exactly surprising. Most driver assistance systems, including adaptive cruise control systems with AEB, ignore stationary objects. This is because most systems are tuned to utilize long-range radar to gauge the distance of moving objects, not stationary ones. If the car's vision-based camera system is unable to detect the vehicle and its radar system is tuned to ignore stationary objects, a non-moving vehicle parked late at night without lights on may have been undetectable until the collision. A preliminary report outlining the NTSB's findings is expected to be issued in about a month.  More News           Fisker Ocean Braking Issue That Prompted NHTSA Probe Was Fixed With An OTA Update           More Headaches For GM's Cruise As NHTSA Probes Pedestrian Risks    "
    },
    "https://insideevs.com/news/712859/audi-q6-etron-tech-impressions/": {
        "pubdate": "Mon, 18 Mar 2024 18:00:00 +0000",
        "title": "The 2025 Audi Q6 E-Tron In-Car Tech: PlugShare, Video Games, OTA Updates And More",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/AkQBM6/s3/audi-a6-e-tron-2024.jpg",
        "content": " Audi invited me to take the new 2025 Q6 and SQ6 E-Tron for a couple of spins at its test track near Munich. You honestly can’t learn all that much from such a brief drive in a controlled environment, but my first impressions are positive.  The SUV’s interior feels just as sturdy and high-quality as you’d expect from an Audi. Both models handled confidently enough through corners, particularly in “Dynamic” mode, which stiffened up the suspension. The Q6’s regenerative braking blended smoothly into regular, mechanical braking. A handy graphic on the SUV’s central screen indicated when that transition was happening and which axle was responsible for regenerative braking at any given moment, which was neat.              I got a lot more time to poke around a stationary Q6’s infotainment system, which is a standout feature.  (Full Disclosure: To make sure InsideEVs got a preview of the Q6 E-tron, Audi flew me out to Germany, put me up in a hotel and fed me schnitzel in large quantities.)  Get Fully Charged  The VW Group has had many software delays  Software is a consistent challenge for automakers who envision a future powered by wireless updates, new downloadable features, bug fixes and, of course, revenue. The software in the new Audi Q6 E-Tron suffered from numerous delays, but the Volkswagen Group says it's ready for deployment now. It's key to the conglomerate's future EV programs, so it had better work right.     Inside The New Audi Q6 E-Tron The Q6 gets a sprawling 14.5-inch central touchscreen and an 11.9-inch digital gauge cluster, which are both housed behind the same curved piece of glass that’s canted toward the driver. The idea was to envelop the driver without overwhelming him or her, Audi says. And I think it pulled that off. The Q6 E-Tron is also Audi’s first vehicle to offer a third display for the front passenger.              What’s perhaps more important is the software powering those many screens. The Q6’s new, Android Automotive-based infotainment system—a first for Audi—was remarkably satisfying to use and responsive to taps, swipes and scrolls. All in all, playing around with the Q6’s dual touchscreens felt more like using a silky-smooth tech product than a typical automotive infotainment system.              Audi chose Android because it’s a familiar platform to app developers, spokesperson Stefan Grillneder said. At launch, the Audi app store will have 40 apps to choose from—like Zoom, YouTube, a web browser and a racing game called Beach Buggy Racer—but the company expects to offer a wider selection over time. It envisions that games and other entertainment apps could help owners pass the time while charging.  The Q6 I poked around was loaded with PlugShare, the famously helpful charging station locator. Video games might get old after a while, but that sort of integration strikes me as a total no-brainer. Audi is also introducing a more advanced voice assistant that I found impressively responsive. While the Audi Assistant doesn't integrate ChatGPT like Volkswagen's latest voice control offering, it does use AI to understand more prompts than previous systems. The feature can respond to more than 800 commands, Audi says, and suggest things based on a driver's past actions. For example, it might recommend the butt warmer if it notices that a driver tends to switch it on in certain weather.  I asked the Audi Assistant to switch drive modes, route me to the nearest fast-charging station and open all the windows a crack, and it obliged without hesitation.  A New Electronics and Software Architecture As such, the Q6 E-Tron represents a leap forward in the Volkswagen Group’s digital transformation. The company, like most automakers, envisions cars that are deeply computerized, filled with powerful software and endlessly updatable. The Q6 E-Tron debuts E3 1.2, VW’s latest electronics and software architecture developed by Cariad, its software division.  “What you have to keep in mind is that this is the most ambitious and the most performant electronics architecture that the VW Group has ever developed,” Cariad spokesperson Maj-Britt Peters told InsideEVs.              In the new Audi, five computers control all major vehicle functions—from the infotainment screens to driver assistance systems to battery management. Traditionally, each individual component or sensor in a car—from the seat controls to the radar system—had its own discrete computer module and software. Those dozens of control units couldn’t communicate with each other or receive software updates. That’s what automakers like VW are moving away from, following Tesla’s lead toward vehicles that function more like tech products. E3 1.2 introduces a vastly more capable and centralized computing system than VW previously had, Cariad representatives said. Previous architectures allowed for limited software updates to things like the navigation system or other application data, they said. Thanks to E3 1.2, Audi can dig deep into a vehicle to improve things, fix bugs or offer new paid features.              Importantly, the Q6 E-Tron is Audi’s first vehicle that will receive over-the-air software updates. (Before, Audi offered “functions on demand,” features owners could pay for, but not a stream of regular software updates, which Tesla pioneered.) Updatability is a big benefit of E3 1.2. The new setup should also help the Q6 function better, Audi says. For one, more processing power allowed Audi to enhance the size and resolution of its infotainment screens. A Cariad spokesperson said that having all the driving dynamics handled by a single computer—a VW first—should boost performance.              Cariad has suffered delays and executive shakeups in getting its software into production, so all eyes will be on E3 1.2 as the Q6 rolls out to customers. We’re looking forward to getting our hands on a Q6 E-Tron as soon as we can and rendering a more complete review. Contact the author: tim.levin@insideevs.com  More Audi EV News           Volkswagen Group Reaffirms Internal Combustion Will Be 'Phased Out' Eventually           The Audi Q4 E-Tron Just Got More Power And Range           Audi's Global All-Electric Car Sales Increased By 51% In 2023           2024 Audi SQ8 E-Tron Has More EPA Range But Is Still An Electron Guzzler               2025 Audi Q6 E-Tron Interior Revealed With Front Passenger Display           2025 Audi Q6 E-Tron Prototype First Drive Review: Applied Learnings    "
    },
    "https://insideevs.com/news/712853/2025-audi-q6-etron-debut/": {
        "pubdate": "Mon, 18 Mar 2024 18:00:00 +0000",
        "title": "2025 Audi Q6 E-Tron: Audi’s High-Tech Flagship Has Arrived",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/koEYNx/s3/audi-q6-e-tron-2024.jpg",
        "content": " Audi isn’t letting an itty-bitty slowdown in the growth of EV sales derail its pivot to becoming an electric-only automaker. On Monday, the German luxury brand unveiled the latest and perhaps most crucial step yet in its electric efforts: the 2025 Q6 E-Tron.  Arriving in the extremely popular form factor of a midsize SUV, the Q6 E-Tron aims straight at the heart of American car-buying. It uses an all-new battery-and-motor platform that will undergird a host of future Audis and Porsches. It's a mechanical sibling to the new Porsche Macan, which is already making waves and isn't even out yet.  And it debuts the parent company Volkswagen Group’s next-generation electrical and software architecture, showcasing the fruits of an effort that’s been notoriously fraught and slow-going.   Get Fully Charged  Audi's technological spearhead  Audi, a subsidiary of the enormous Volkswagen Group, has been selling EVs since the 2019 launch of the E-Tron SUV (now called the Q8 E-Tron). The Q6 E-Tron uses all-new technology and aims at the extremely popular midsize SUV segment.     No pressure, right? Audi isn’t shunning gasoline just yet. But the Q6 is a key part of Audi’s strategy to offer an EV in all “core” vehicle segments by 2027. And once its next generation of combustion-powered live out their days—around 2033—the brand will be all-electric. If there’s one model that can bring buyers to electric Audis en masse and help usher in that future, it’s the Q6 E-Tron.              InsideEVs went to Germany last week to get the lowdown on the Q6 E-Tron from Audi’s engineers and drive the new SUV, albeit very briefly. So let’s dive in.  (Full Disclosure: To make sure InsideEVs got a preview of the Q6 E-tron, Audi flew me out to Germany, put me up in a hotel and fed me schnitzel in large quantities.) Specs That Matter The Q6 E-Tron arrives in the U.S. in late 2024 with two variants to start: the Q6 E-Tron Quattro and the sportier SQ6 E-Tron. It slots in between the compact Q4 E-Tron SUV and the Q8 E-Tron, a full-size family-hauler. The E-Tron GT, a sports sedan that’s a fraternal twin to the Porsche Taycan, rounds out Audi’s electric portfolio. Unlike any of those models, the Q6 E-Tron rides on Audi’s new Performance Platform Electric (PPE) platform, which can be configured to fit a range of different sedans and SUVs from both Audi and Porsche. That new tech allows for excellent range, charging speeds and performance, Audi says. On paper at least, that seems to be the case.    Gallery: Audi Q6 e-tron (2025)              61 Photos                                                                                                       Both the Q6 Quattro and SQ6 come equipped with dual motors in front and rear and all-wheel drive. The Quattro claims a peak of 456 horsepower and hits 60 mph in roughly five seconds, Audi says. The SQ6 churns out 510 horses and rips to 60 in 4.2 seconds. Unlike the upcoming PPE-equipped Porsche Macan Electric, the Q6 E-Tron has an asynchronous motor up front and a permanent magnet motor in the rear. That allows the Audi to disengage its front motor to slash energy consumption when needed.  A 100-kilowatt-hour battery pack nestled in the Q6 E-Tron’s floor will deliver more than 300 miles of EPA range in the Quattro, according to Audi’s internal estimates. That’s more than any Audi EV before it.  Pricing is still a question mark, but that range figure should make the Q6 E-Tron competitive, in at least one crucial metric, with the vehicles Audi has identified as its biggest rivals. Those rivals include the Mercedes-Benz EQB, Ford Mustang Mach-E, Nio EC6 and EL6 (from a Chinese startup) and, of course, the Tesla Model Y, the world’s best-selling EV.  It's worth noting that the new all-electric Macan, of which the Q6 E-Tron is a close relative, jumped nearly $20,000 in price over the old gas-powered Macan. Porsche is arguing it's worth it for the performance increase here, but it's unclear how Audi will round this out.              A rear-wheel-drive version coming down the pike (with the same 100 kWh battery but one motor instead of two) should offer quite a bit more mileage and will be the choice for Audi buyers who want absolute maximum range. A high-performance RS variant as well as a  Sportback version, Audi's name for a fastback, are in the works too. Timing on those is TBA. The brand is touting some impressively quick charging speeds, too. Thanks to an 800-volt architecture (like Audi already uses in the E-Tron GT), the Q6 will be able to accept a veritable firehose of electrons: 270 kilowatts of charging power to be exact. There aren’t too many EVs on the market that can match that. Along with the new Porsche Taycan, it should be a charging-speed monster.   Get the InsideEvs Newsletter Sign Up Today   When plugged into a sufficiently powerful plug (rated at 270 kW or higher), the Q6 E-Tron can recharge from 10-80% state of charge in 21 minutes, Audi says. Assuming a total range of 300 miles, that maths out to a solid 210 miles of potential driving.  Interestingly, when using a charger that doesn’t operate at 800 volts, the Q6 E-Tron flips a switch that divides its pack into two 400-volt sections. Those then charge simultaneously at 135 kW, slashing charging times at less powerful stations. Under those circumstances, 10-80% should happen in 30 minutes, Audi says.              The question on everybody’s mind: Does it get a NACS plug?  Although Audi plans to move over to Tesla’s North American Charging Standard eventually, the Q6 E-Tron will come with the conventional Combined Charging System (CCS) port at launch. Audi isn’t ready to announce when its new cars will get NACS from the factory or how it will roll out adapters for Tesla’s charging stations, Audi spokesperson Mark Dahncke said, explaining that there’s still testing to be done to make Audis work with Tesla’s infrastructure.  (Some background, in case you need it: Most automakers have announced plans to shift from CSS, the old charging-plug standard, to NACS, which historically was only equipped on Tesla’s cars and at its Supercharger stations. Now, car companies have struck deals to use Tesla’s plug design and, therefore, much of its charging network.) Audi hasn’t announced pricing for U.S.-bound models yet, but the base MSRPs of the Q4 E-Tron ($55,200) and Q8 E-Tron ($74,400) offer some clues. The Q6 E-Tron is expected to fall somewhere right in the middle, perhaps in the mid-$60,000 realm.  The PPE Platform The Q6 is just one possibility derived from the PPE platform. In broad strokes, the idea was to develop a platform that could deliver high performance, lots of range, fast charging and excellent efficiency—all while being simple to produce at scale.  It bridges the gap between the Volkswagen Group’s MEB platform, which is for lower-end vehicles and doesn’t offer particularly high performance, and the J1 platform, which is used by the high-end E-Tron GT and Porsche Taycan.              Part of achieving all that involved developing more lightweight and efficient motors. The PPE platform supports three different motors for the front axle and two for the rear, all of which can be manufactured on the same production line. Compared to Audi’s first-generation rear drive unit, the PPE’s rear motor is 62% more power-dense and 50% more energy-efficient, Audi says.              The PPE’s battery pack uses a new chemistry for Audi and large prismatic cells co-developed with the Chinese battery maker CATL. Bigger cells mean this Audi can pack more active material into a given area, boosting energy density. Individual cells are stacked into modules, allowing for different battery capacities. For example, the 83 kWh Q6, which will be sold outside the U.S., has essentially the same pack as the 100 kWh version, just with two modules poked out of its center. Audi says the new, simpler layout allows it to assemble batteries faster and with more automation than before. To put things into perspective, the Q8 E-Tron’s battery pack comprises 36 modules and 432 cells. The Q6’s battery is made up of 12 modules with 180 total cells.              Audi also did a lot of work on thermal management, building improved systems that heat or cool the PPE battery to the optimal temperature for charging and driving. New to the Q6 is what Audi calls “continuous” thermal management. In extreme temperatures, the Q6 will automatically regulate its internal temperature to preserve battery longevity, even when it’s parked.              But the hardware specs are only part of the mission here. The new Audi Q6 E-Tron is a huge deal on the software and UX side too, which we'll cover in a separate story. In the meantime, do you think this Audi is shaping up to be as promising a contender in the EV crossover space as the Macan is? Let us know in the comments.  Contact the author: tim.levin@insideevs.com  More Audi EV News           Rivian R3 Design Was Inspired By Some Of The Greatest Names In Rallying           Volkswagen Group Reaffirms Internal Combustion Will Be 'Phased Out' Eventually           The Audi Q4 E-Tron Just Got More Power And Range           Audi's Global All-Electric Car Sales Increased By 51% In 2023           Volkswagen, Audi, And Porsche Finally Commit To Using Tesla’s NACS Plug           2024 Audi SQ8 E-Tron Has More EPA Range But Is Still An Electron Guzzler    "
    },
    "https://insideevs.com/news/712685/us-ev-registrations-january2024/": {
        "pubdate": "Mon, 18 Mar 2024 17:00:07 +0000",
        "title": "U.S. EV Registrations Accounted For 7.8% Of The Car Market In January 2024",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/2NEp4g/s3/from-left-2024-tesla-model-3-aka-highland-and-tesla-model-y.jpg",
        "content": " January brought a 4.7% year-over-year increase in new light-vehicle registrations in the United States. 1.1 million vehicles were registered. All-electric vehicle (EV) registrations slightly outpaced the general market, but the growth rate is significantly slower than in 2023. According to S&P Global Mobility's data (via Automotive News), battery-electric cars noted 89,042 new registrations (up 15% year-over-year). The growth is positive, however, the average in 2022 and 2023 was above 50%. (Note that registration data lags behind sales and deliveries by at least a few weeks, but it can be used as a proxy of sales, especially since not all sales numbers are publicly available on a monthly basis.)  Get Fully Charged  Will the market grow in 2024?  The all-electric car market in the United States is growing, but the expansion gradually slowed down in recent months. It might change, but for now, it seems that achieving significant growth in 2024 will be challenging (compared to about 57% in 2022 and about 52% in 2023).    In January, new EV registrations accounted for 7.8% of the market, compared to 7.1% a year ago, the report says. For the last couple of months, the share was usually between 7 and 8 %, occasionally exceeding 8%. According to the article, Tesla was responsible for 48,757 new registrations, up 15% year-over-year. That's about 54.8% of all EV registrations. Two-thirds of the volume falls on the Model Y (32,248 registrations), which alone accounts for 36% of the entire all-electric car segment. It also means that the non-Tesla EV registrations amounted to 40,285, growing at a similar rate. S&P Global Mobility's data shows that Ford was number two with 5,429 EV registrations, but that's a 17% year-over-year decline. Chevrolet maintained third position among brands, but the decline is massive at 42% year-over-year, without the Chevrolet Bolt EV/Bolt EUV duo (production discontinued). One of the most interesting things is the strong position of Hyundai (4,144 and 79% increase) and Rivian (3,818 and 46% increase). Kia is also growing fast, which enabled the wider Hyundai Motor Group (Hyundai, Kia, and Genesis) to remain the second largest automotive group in the EV segment behind Tesla (8,262 total). BEV registrations (select brands) in January 2024 (YOY change):  Tesla: 48,757 (up 15%) and 54.8% market share Ford: 5,429 (down 17%) and 6.1% market share Chevrolet: 4,353 (down 42%) Hyundai: 4,144 (up 79%) Rivian: 3,818 (up 46%) Kia: 3,717 (more than doubled) BMW: 3,564 Mercedes-Benz: 3,341 Cadillac: 2,145 Volkswagen: 1,836 (down 47%) Audi: 1,620 Nissan: 1,393 Fisker: 640 Toyota: 631 Lexus: 527 Subaru: 520 Volvo: 431 Porsche: 406 Genesis: 401 Polestar: 364 Lucid: 357 Mini: 280 VinFast: 117 Jaguar: 100 Rolls-Royce: 51 Fiat: 29 GM's Cruise: 23 Mazda: 22 GMC: 16 BrightDrop: 9 Ram: 1  In terms of models, the Tesla Model Y remains the most popular all-electric car in the U.S. with the Tesla Model 3 in second position. The discontinued Chevrolet Bolt EV/Bolt EUV duo in third position is a bit of a surprise, and another one is the Tesla Model X ahead of the Ford F-150 Lightning and a few crossover/SUV models. BEV registrations (select models) - January 2024:  Tesla Model Y - 32,248 (up 35%) Tesla Model 3 - 11,739 (down 23%) Chevrolet Bolt EV/Bolt EUV: 4,119 (down 45%) Tesla Model X: 3,267 (up 32%) Ford F-150 Lightning: 2,956 (up 4.5%) Hyundai Ioniq 5: 2,436 (up 47%) Cadillac Lyriq: 2,145 Ford Mustang Mach-E: 1,977 (down 38%) Volkswagen ID.4: 1,836 (down 47%) Tesla Model S: 1,431 (up 68%) Kia EV9: 1,361 (up 32%) Kia EV6: 1,338 (up 32%) Mercedes-Benz EQE SUV: 1,091 Hyundai Ioniq 6: 1,063 Kia Niro EV: 1,018 (up 36%) Rivian R1T: 762 (down 44%) Chevrolet Blazer EV and Chevrolet Silverado EV (combined): 234 Tesla Cybertruck: 72  * only models and brands, for which data are available   Get the InsideEvs Newsletter Sign Up Today    More sales reports           Ford U.S. EV Sales Surged 81% In February 2024           Kia U.S. EV Sales Increased 65% Through February 2024    "
    },
    "https://insideevs.com/news/712831/tough-new-epa-rules-to-boost-ev-sales/": {
        "pubdate": "Mon, 18 Mar 2024 15:42:22 +0000",
        "title": "The EPA May Finalize Tough New Rules To Boost EV Sales This Week",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/02Kv2/s3/bill-ford-and-joe-biden-with-the-2022-ford-f-150-lightning.jpg",
        "content": " A major regulatory order this week would decide the near-term fate of the electric vehicle movement in the U.S., impacting not only millions of Americans but also how the world’s second-biggest polluting country tackles climate change. This week, the U.S. Environmental Protection Agency (EPA) is poised to finalize emissions rules that will effectively require a certain percentage—as much as two-thirds by 2032—of new cars to be all-electric, Politico and other outlets have reported in recent days. The ruling could be announced as soon as this Wednesday. These standards could first loosen the tough EV requirements between 2027 and 2030, but then mandate an aggressive ramping up of EV sales from 2031. In other words, these revised rules would give car companies a bit of a pass on EVs in the short term, while still pushing for a mostly-electric future starting in the next decade.  Get Fully Charged  Pushback against gas cars is about to get serious on a federal level.  The transportation sector accounts for the largest chunk of greenhouse gas emissions annually. Exhaust fumes from gas cars and trucks are directly linked to health hazards. EVs have substantially lower life cycle emissions, which is why a new ruling mandating broader EV adoption in the U.S. is imminent.     The EPA originally proposed stringent federal emissions standards last April. The initial proposal required two-thirds of new light-duty vehicle sales to be electric by 2032, up from about 8% in 2023. It also focused on systemically eliminating criteria pollutants, including particulate matter, carbon monoxide, carbon dioxide, and nitrogen oxides from vehicle emissions—all linked to direct health hazards among the masses. But the agency received a strong rebuttal from dealer groups, car manufacturers, and petroleum companies for its proposal. Many said the U.S. was not \"ready\" for such an aggressive EV push, as prices remained higher than internal combustion cars on average and the nation's charging infrastructure is rather lacking.  On the other hand, environmental and public health advocacy groups overwhelmingly supported the initial ruling.   Get the InsideEvs Newsletter Sign Up Today   However, The New York Times reported last month that the Biden administration was considering relaxing the EPA rules after pressure from carmakers. According to one estimate, the alternative ruling that’s likely to pass would require EV penetration rates to reach 32% by 2027, and then increase every year after that, finally reaching 54% by 2030 and 68% by 2032. As of 2021, the transportation sector was the largest contributor to planet-warming greenhouse gas emissions in the U.S., accounting for 29% of total emissions. From Politico's story:  Those changes track with an alternative regulatory option that EPA explored in last year’s draft that ratchets down emissions limits evenly rather than front-loading them in early years. Environmentalists at the time mostly shrugged at the prospect of EPA preparing to finalize a rule that would give car companies more time to go electric — potentially creating room for more gas- and diesel-powered cars to be sold through the late 2020s. Manish Bapna, president of the Natural Resources Defense Council Action Fund, told reporters at a briefing Thursday morning that the anticipated final rule would still deliver 95 percent of the draft’s greenhouse gas emission cuts. “So let’s be clear that it’s a very, very modest change in carbon pollution,” he said.   Regardless of which alternative the EPA finalizes, the new rules would require EV sales to increase substantially from what they accounted for in 2023—just over 8%. That means carmakers would need to offer a broad range of cost-competitive EVs while the charging infrastructure would also need a major boost. The new standards would also help the U.S. get closer to its commitment of reducing its emissions by 50% by 2030 under the Paris Climate Accords. Nonetheless, Biden's approach to EVs is already becoming a hot-button issue as he faces a difficult and bitter election rematch against his Republican opponent, former President Donald Trump. Trump has been beating the drum against EVs on the campaign trail in recent weeks, and at a speech in Ohio this weekend, he said there would be a \"bloodbath\" for the auto industry if he was not reelected. Contact the author: suvrat.kothari@insideevs.com  More EV News           Biden Administration May Relax EPA Rules Driving Electric Vehicles: Report           Biden Announces $623 Million In Funding For 7,500 Charging Plugs           China Pushes Back On Biden's New EV Tax Credit Rules           US Added Over 188K EV-Related Jobs In Recent Years, Led By Tesla    "
    },
    "https://insideevs.com/news/712812/rivian-r1x-trademark/": {
        "pubdate": "Mon, 18 Mar 2024 14:00:35 +0000",
        "title": "Rivian R1X Name Trademarked, Hinting At Possible High-Performance EV",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/0eK7y2/s3/rivian-r1x-trademark.jpg",
        "content": " Rivian has trademarked the “R1X” name, leading some to believe that a flagship performance EV is in the works, much like the R3X that debuted earlier this month will be a souped-up version of the upcoming R3 crossover. A user of the Rivian Owners forum stumbled upon the trademark filing with the United States Patent and Trademark Office (USPTO), but a closer look at the document reveals that the R1X name isn’t something that came out of the blue.  Get Fully Charged  What's with the R1X?  Rivian applied for a trademark on the \"R1X\" name back in 2021, and in October of last year, it received a Notice of Allowance. This means that the company's sights were set on the moniker long before the surprise appearance of the R3X earlier this month.    The trademark request was filed in November 2021 by a company called Rivian IP Holdings, which is a subsidiary of Rivian Automotive, according to the U.S. Securities and Exchange Commission (SEC). Then, in October of 2023, the trademark was awarded to the company that filed the request.  More Rivian Stories           Rivian R1S And R1T Owners Can Now Charge At Tesla Superchargers           The Rivian R2 Will Come With A Heat Pump And Optional Tow Hitch           Rivian R3 Design Was Inspired By Some Of The Greatest Names In Rallying           Here's Why The Rivian R2 And R3 Have The Charge Door On The 'Wrong' Side    In other words, Rivian had the R1X name in mind for the last three years. However, even with the recent debut of the R3X high-riding crossover that will probably go into production in 2027, there’s no guarantee that the R1X will see the light of day as a real vehicle. It wouldn’t be the first or the last time a manufacturer secured a trademark or patent that got stuck in the back corner of the archives, never to become anything more than a document collecting dust. In any case, would an even more powerful R1S or R1T make sense? Currently, the quad-motor version of these EVs makes 835 horsepower and 908 pound-feet of torque, enabling a 0-60 miles per hour time of 3 seconds in a vehicle that weighs roughly 7,000 pounds.            7 Photos                                                                                                By comparison, the most powerful version of the Tesla Cybertruck, the Cyberbeast, makes 845 hp and can accelerate to 60 mph in 2.6 seconds, while the 1,000 hp tri-motor GMC Hummer EV can get to 60 in about 3 seconds. There’s also the unconfirmed possibility that the R1X might just be a more off-road-focused version of either the R1T or R1S, but would anyone buy it? Rivian’s R1 vehicles are not exactly cheap, to begin with–starting at around $70,000 and topping out at roughly $90,000–so an even more expensive model would do little to widen the appeal of the brand to an audience that is seeking more affordable offerings like the upcoming R2 and R3 models. But what’s your take on this? Let us know in the comments below.   Get the InsideEvs Newsletter Sign Up Today   "
    },
    "https://insideevs.com/news/712804/volkswagen-investors-tesla-dealers/": {
        "pubdate": "Mon, 18 Mar 2024 13:40:02 +0000",
        "title": "For Car Companies, It's 'Damned If You, Damned If You Don't' With Investors",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/jlE9mk/s3/vw-id.2all-cm-top.jpg",
        "content": " For the past few decades, especially in America but increasingly everywhere, the prevailing culture in business has been the emphasis on short-term results: quarterly returns in particular, agnostic of things like long-term planning and the need for intense research and development investments to get ready for the future. There are exceptions to this, of course, especially in the tech world (though that's been less true as of late.) But the established car industry is facing a hell of a time convincing investors they can get ready for an electric tomorrow, all while delivering those quarterly and annual financial results investors demand right now. And Volkswagen is emerging as a good case study in that trend, whether it's fair or not. That kicks off Monday's Critical Materials tech and transportation news roundup. Also on tap today: car dealers bristle even more at selling EVs, and Tesla settles an infamous racial discrimination case.  30%: Volkswagen's Outlook Problem, Explained             I'll start this off by sharing a Wall Street Journal article published after Volkswagen's annual conference in Berlin last week, which I also attended. Here's how it starts out:   Volkswagen is the archetypal legacy automaker: flabby, slow-moving and valued as if it is going out of business.  First of all, damn. That's how you write a lede, folks. It's a little too scathing and represents a conclusion I don't agree with—which we'll get to—but it speaks to how investors view things at VW right now. Most investors don't think very highly of so-called \"legacy\" automakers, which have low profit margins, intense overhead costs and had their viability tested during the Great Recession. Hence the headline on this story, \"Why Volkswagen Is Priced For Failure.\" Ouch, right? This, even as VW reported a $19.6 billion net profit for 2023, up 13% from 2022, alongside double-digit sales increases in Europe and North America. A bigger problem is the slowing market in China, which is why VW issued a much more cautious outlook for 2024. But the VW Group's valuation remains quite low, even with highly profitable brands like Porsche, Bentley and Audi in its portfolio. Example:  There are more conventional signs of undervaluation, too. VW stock trades at less than four times forward earnings. Toyota, its only peer in scale and global reach, is at 10 times. Chrysler-owner Stellantis, which long traded at a discount even to VW, is now at five times after a stellar 2023. VW’s results offered plenty of reminders why many investors stay clear of the company. Most simply, it made a net profit of €17.9 billion in 2023, equivalent to $19.6 billion. While that is roughly twice what General Motors earned, it could be much better. In rough terms, Toyota expects to make 50% more net profit for its financial year through March, even though it sold only 20% more vehicles than VW in 2023.  Here's where the \"damned if you do, damned if you do\" part comes in.   The company is throwing money at the problem, both at new EV partners such as XPeng and at its own Chinese operations. This has long been VW’s knee-jerk response to challenges, which doesn’t help investors gain confidence that the company will earn acceptable returns. Its research and development and capital expenditures combined will amount to a gargantuan 14% of revenue this year at the midpoint of guidance, which it insists will be the peak. By comparison, Toyota expects to spend half as much in its current financial year.  That is because VW is a company that's committing to an all-electric future and openly saying its current internal combustion engines will be its last—something it's said for almost a decade now. It hasn't gotten the EV transition exactly right (no \"legacy\" company has, yet) but it's listening to consumer critiques, growing its EV market share and getting ready to face a raft of electric competitors everywhere, including from China. That's where the \"gargantuan\" research and development and capital expenditures come from. Again, VW isn't alone here. Ford has the same problem, especially since it breaks out the financial results for its EV division separately and that operation is burning cash as it ramps up operations. Pivoting to be a battery- and software-powered business is a massively costly and complex effort, but if these car companies don't, they're dead in time. So what do investors want here? Returns right now, or a future? The answer, more and more, seems to be \"both,\" which may not be rooted in reality.  But there's also this:  Investors gravitate to “specific stories” in the embattled auto sector, such as Toyota’s hybrid leadership or the best-in-class cost discipline of Stellantis, says Federated Hermes portfolio manager Dariusz Czoch. Viewed through this lens, VW doesn’t offer much apart from a slow and complex turnaround story, variations of which investors also heard from previous CEOs.  Maybe that's part of VW's problem here—the \"story\" it's telling. What makes it different from every other car company out there that's working on batteries, software and better and cheaper EVs?  Toyota's hybrid story is a good one, for now, but it too is said to be scrambling to ramp up EV investments behind the scenes. In the end, the EV race is going to be a long-haul fight, and maybe investors would do well to get used to that idea.  60%: Car Dealers Are Extra Down On EVs             When you look at the narratives around the so-called \"EV slowdown,\" a lot of that comes from the longer amounts of time the cars spend on dealership lots. But I have often wondered if this is a sign of demand, or of car dealers just being bad at their jobs. Many (but certainly not all) dealers have spent years resisting the EV transition, bristling at the costs involved with charging and not wanting to miss out on revenue from ICE repairs. But in 2024, they're especially down on EVs, according to a Cox Automotive survey reported by Automotive News:    Dealers' sentiment around EV sales is worsening from a year ago and sinking to record lows, according to Cox Automotive's first-quarter Dealer Sentiment Index, which surveyed 546 franchised and 472 independent retailers from Jan. 30 to Feb. 13. The survey results show that the EV \"thrill is gone,\" said Jonathan Smoke, chief economist for Cox Automotive. \"You have to hunt to find the dealer that's optimistic about the EV market growing.\" To calculate the score, Cox asked: \"Compared to last year, how would you describe your EV sales?\" Sentiment for franchised dealers sunk to 43 from 58 a year earlier on a 100-point scale, the lowest score since the question was added in the second quarter of 2021. The score fell 7 points from the fourth-quarter score of 50. A score of 50 is neutral. Scores above that signify strength or growth, while scores below indicate weakness or decline.  Also, this:   A Honda dealer in the Midwest also pointed to dwindling demand. \"The early-adopter audience is exhausted, and it's a tough sell to the general car buyer in many of our markets,\" the dealer said. \"Prices are too high for the inconveniences presented by switching to EV.\"   I find this funny coming from a Honda dealer, which sells one (1) EV that is made by General Motors and is also not on sale yet. Sure, man! But admit it: there is some truth to this. The EV market is moving past the first- and second-wave adopters. Now it needs to break into the mainstream, and that means more affordable and more normal cars everywhere, not just $60,000 SUVs. At some point, the dealers are going to have to get over themselves too, though. 90%: Tesla Settles Racial Discrimination Lawsuit             For all its many efforts to advance the EV space, Tesla has never been known as a great place to work, especially if you're a woman and/or a person of color. The Fremont factory in particular has been dogged with countless lawsuits and complaints over working conditions, racial and sexual harassment and abusive managers. (I'd point you to an episode of Vox's Land of the Giants podcast I wrote last year about this very topic, if you want to hear from those inside.)  Now, Tesla has settled one of its most infamous cases, with Black worker Owen Diaz. Here's The Guardian:  Tesla has settled with a former employee in a long-running discrimination case that drew attention to the electric vehicle maker’s treatment of people of color. The case, which dates back to 2017, centers on allegations that Tesla didn’t take action to stop a racist culture at the factory located about 40 miles (65km) south-east of San Francisco. Diaz, a Black man, alleged he was called the N-word more than 30 times, shown racist cartoons and told to “go back to Africa” during his roughly nine-month tenure at Tesla that ended in 2016. The same Tesla plant is in the crosshairs of a racial discrimination case brought by California regulators. Tesla has adamantly denied the allegations made in state court and lashed back by accusing regulators of abusing their authority. The US Equal Employment Opportunity Commission filed a similar complaint against Tesla in September.  Remember, two years ago, CEO Elon Musk said Tesla will \"never surrender/settle an unjust case against us, even if we will probably lose.” I also bring this up here because a rising United Auto Workers union is pondering its next targets after huge wins with the Big 2.5 in Detroit. Will the UAW use this longstanding, well-documented history of worker mistreatment as fodder for another union drive? There's no bigger target when you think about it.  100%: How Do 'Legacy' Automakers Convince Investors They Hold The Keys To The Future? If you're a company like Volkswagen, and you think you're trying to do the right things even if they don't always succeed at first, what story do you tell?  Contact the author: patrick.george@insideevs.com  More EV News           Here’s Your Chance To Own The First GMC Hummer EV Pickup EarthCruiser Camper           Rivian R1S And R1T Owners Can Now Charge At Tesla Superchargers           All Tesla Model Y Trims Will Cost $1,000 More On April 1, 2024           Hyundai Motor Global EV Wholesale Sales Hit The Brakes In February 2024           Electric Volkswagen GTI For The U.S.: 'I Think The Car Would Sell,' CEO Says           Tesla’s Official India Entry Almost Confirmed Under New EV Policy    "
    },
    "https://insideevs.com/news/712799/gmc-hummer-ev-pickup-earthcruiser-camper-auction/": {
        "pubdate": "Mon, 18 Mar 2024 13:00:17 +0000",
        "title": "Here’s Your Chance To Own The First GMC Hummer EV Pickup EarthCruiser Camper",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/pbY7Mv/s3/2022-gmc-hummer-ev-pickup-edition-1-earthcruiser-camper.jpg",
        "content": " The GMC Hummer EV pickup made a name for itself by being one of the biggest, heaviest, most powerful, and over-the-top electric vehicles in the world. At the same time, Oregon-based EarthCruiser is known for making some of the toughest overlanders in the industry. So getting EarthCruiser to do a GMC Hummer EV overland build was somewhat of a no-brainer, which is exactly what happened last year when General Motors reached out to the outfitter to make its battery-powered behemoth a go-anywhere, sleep-anywhere machine. And now’s your chance to own that machine because it’s up for auction right now on Bring a Trailer.  Get Fully Charged  Got cash?  The GMC Hummer EV pickup Edition 1 had a base price of about $108,000 when it went on sale two years ago. Now, what is very likely the only GMC Hummer EV with an EarthCruiser camper on top of it is for sale on Bring a Trailer. It's the same car that made appearances at the 2023 Overland Expo and the 2024 Chicago Auto Show, so how much money would you be willing to spend on this rather special EV?    This exact car was displayed at the 2023 Overland Expo Mountain West and the 2024 Chicago Auto Show, and features a carbon fiber camper with a 605-kilowatt solar array on top, as well as a 6-kilowatt-hour auxiliary battery.   Gallery: 2022 GMC Hummer EV Pickup Edition 1 EarthCruiser Camper on Bring A Trailer              8 Photos                                                                                                It has a sleeping zone that can accommodate two people, a kitchenette with a refrigerator, a freezer, a sink, and a 1,400-watt induction stovetop. The rig also comes with a 13.5-gallon fresh water tank, a 7-gallon gray water system, plus interior and exterior showers. To control all the features of the camper, EarthCruiser fitted a 7-inch CZone touchscreen control system in the camper, while the standard wheels were swapped for a set of 18-inch beadlock-capable wheels dressed in BFGoodrich Mud-Terrain tires. As for the car itself, it’s a 2022 GMC Hummer EV Pickup Edition 1 that was repainted gray by EarthCruiser. It has 8,000 miles on the odometer, so it’s pretty much brand new. It’s also fitted with just about every imaginable extra, considering it’s the Edition 1 top-of-the-line model: three electric motors, four-wheel steering, underbody cameras, virtual locking differentials, heated and cooled front and rear seats trimmed in leather, a Bose sound system, and more. Currently, the highest bid is $100,000 out of the seven submitted, and the bidding closes on Friday. There’s no mention of a reserve, but seeing how a standard GMC Hummer EV Pickup Edition 1 retailed for over $100,000 on its own, this rig could be closer to a value of around $200,000. We’ll see if it actually gets there.  More Stories Like This           Cool Volkswagen ID. Buzz Mini Camper Package Includes Bed, Kitchen               The Living Vehicle Is An Off-Grid Camper With A Folding Patio Deck           Grounded RV Unveils Electric Camper Van That's Actually Affordable           Tesla’s $3,000 Cybertruck Rooftop Tent Reminds Us Of The Pontiac Aztek      Get the InsideEvs Newsletter Sign Up Today   "
    },
    "https://insideevs.com/news/712748/rivian-r1s-r1t-tesla-supercharger-access-open/": {
        "pubdate": "Mon, 18 Mar 2024 08:36:43 +0000",
        "title": "Rivian R1S And R1T Owners Can Now Charge At Tesla Superchargers (Updated)",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/JOB8lK/s3/rivian-r1s-and-r1t-and-tesla-supercharger.jpg",
        "content": " Update: Rivian officially announced that owners of the R1T and R1S EVs can now use the roughly 15,000 Tesla Superchargers in the United States and Canada. Each owner will also get a free adapter starting in April. The original story follows. The Rivian R1T pickup and R1S all-electric SUV can now be recharged at Tesla Superchargers using an adapter that’s sold separately, reports on social media show. Much like Ford EV owners, drivers of Rivian’s passenger vehicles can pull up to a Tesla Supercharger that’s only equipped with a NACS plug, attach a certified NACS to CCS1 adapter, and plug the cable in the car to initiate the session.  Get Fully Charged  Tesla Supercharger network opens for Rivian EVs in North America  Rivian owners can now recharger their R1T or R1S EVs at Tesla's Supercharger network of DC fast chargers, according to several reports on social media. The Tesla Supercharger network is regarded as the biggest and one of the most reliable EV fast-charging networks in the United States and Canada.    According to the @ryanhuber’s X video embedded below, the vehicle communicates with the charger and the session begins automatically as long as there’s a payment method set up in the Rivian mobile app. This means that Rivian owners don’t need to install the Tesla smartphone app to get access to Superchargers.   The same thing happens with Ford-made EVs like the F-150 Lightning and Mustang Mach-E, which gained access to Tesla’s DC fast charging network at the beginning of March. Ford’s CEO Jim Farley said that owners of blue oval-branded EVs will get a free adapter to make use of the deal with Tesla. However, Rivian hasn’t announced something similar yet, so R1S and R1T owners will have to source their NACS to CCS1 adapters on their own. Furthermore, Rivian hasn’t officially announced that owners of its vehicles can use Tesla Superchargers, although the latest version of the company’s mobile app now shows Tesla Superchargers on the charging map.     The R1S and R1T are equipped with a CCS1 inlet from the factory, just like Ford’s F-150 Lightning, Mustang Mach-E, and E-Transit. Tesla, on the other hand, uses the so-called North American Charging Standard (NACS) connector on the EVs it sells in North America, which is why non-Tesla EV owners need an adapter to top up at Superchargers. The upcoming R2, R3, and R3X will come with a NACS inlet from the factory. The latest version of the Tesla Supercharger stalls, V4, has an adapter built-in, but there are currently very few locations in the United States and Canada that have V4 stalls operational. The vast majority of Tesla DC fast chargers are of the V3 variety, which doesn’t have an adapter built-in, except for stalls that have the so-called Magic Dock feature. The latter can be used on any brand of EVs, not just those made by companies that have a deal with Tesla to use all the Superchargers in North America.  More Stories Like This               Two Ford F-150 Lightnings Race 1,000 Miles: Tesla Supercharger Vs Electrify America           Tesla Is Working On A NACS-To-NACS Extension Cable           Tesla Superchargers Cost More For Other EVs, Unless You Buy A Membership           See Which Tesla Superchargers Are Open To Other EV Owners Now      Get the InsideEvs Newsletter Sign Up Today   "
    },
    "https://insideevs.com/news/712684/tesla-modely-price-increase-april1-2024/": {
        "pubdate": "Sun, 17 Mar 2024 14:00:27 +0000",
        "title": "All Tesla Model Y Trims Will Cost $1,000 More On April 1, 2024",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/7ZvNRA/s3/tesla-model-y.jpg",
        "content": " Within two weeks (on April 1, 2024), all trims of the Tesla Model Y in the United States will become more expensive by $1,000. The company announced the upcoming price increase on the model's ordering page.  Prices will increase by $1,000 for all Model Y trims on April 1.  This appears to be Tesla's latest move to encourage potential buyers to order now.  Get Fully Charged  Tesla's price dance  Tesla is known for active and relatively frequent changes in its pricing, especially when there is an imbalance between supply and demand. One of the reasons behind that is the lack of a middleman (dealers), which usually would apply rebates (or increases) to the MSRP/    Additionally, all new Model Y orders (cash or finance purchases) that are delivered by March 31 will come with 5,000 free Supercharging miles. Those who trade in a vehicle can receive an additional 5,000 miles for a total of up to 10,000 miles.      These two elements indicate that Tesla intends to boost sales results in the first quarter of 2024. Showing some growth is always important for a publicly traded company. In the past, Tesla CEO Elon Musk also said that prices change to keep the factories busy and efficient (at a stable production rate). Let's recall that Tesla currently offers three versions of the Model Y in the U.S.:  RWD: $43,990 Long Range AWD: $48,490 Performance: $52,490   Prices of the RWD and Long Range AWD versions were temporarily lowered by $1,000 in February. If the price increases by $1,000, the change will be worth 2.2% for the entry-level RWD version and 1.9% for the top-of-the-line Performance version. Current Prices     Model Base Price Dest. Charge Tax Credit Effective Price   2024 Tesla Model Y RWD 19-in $43,990 +$1,640 $7,500 $38,130   2024 Tesla Model Y RWD 20-in $45,990 +$1,640 $7,500 $40,130   2024 Tesla Model Y Long Range AWD 19-in $48,990 +$1,640 $7,500 $43,130   2024 Tesla Model Y Long Range AWD 20-in $50,990 +$1,640 $7,500 $45,130   2024 Tesla Model Y Perf. LR AWD 21-in $52,490 +$1,640 $7,500 $46,630     * Tesla adds a Destination fee (DST) of $1,390 and an Order Fee of $250 to all its models ($1,640 total). The U.S. is not an exception. Tesla price changes are also coming to other markets. In Canada, prices of RWD and Long Range versions are already $1,000 CAD higher than before, according to Drive Tesla Canada. On March 22, prices of the Model Y will also increase in Europe. The change will be even bigger—about €2,000, which is about $2,180.     Get the InsideEvs Newsletter Sign Up Today    See also           Polestar 3 Price Reduced By $10,500, Range Increased By Up to 15 Miles           The Most Affordable 2024 EVs With At Least 300 Miles Of EPA Range       "
    },
    "https://insideevs.com/news/712520/hyundai-motor-global-ev-sales-february2024/": {
        "pubdate": "Sat, 16 Mar 2024 14:00:55 +0000",
        "title": "Hyundai Motor Global EV Wholesale Sales Hit The Brakes In February 2024",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/AkmoQy/s3/2024-hyundai-ioniq-5.jpg",
        "content": " Hyundai Motor Company's (Hyundai and Genesis brands) global vehicle sales in February 2024 amounted to 314,909, down 4.1% year-over-year. This affected the year-to-date result, which at 632,765 is 0.9% lower than a year ago. The slight decrease in global sales volume is nothing compared to the significant drop in the company's plug-in electric car sales in February, which were down by almost 46% year-over-year.  Get Fully Charged  Hyundai EV sales hit new record in 2023  In 2023, Hyundai Motor's global plug-in car sales exceeded 300,000 (up 29% compared to 2022). This includes over 260,000 all-electric Hyundai and Genesis cars. The year 2024 might be much more challenging.    Last month, the combined wholesale shipments (which are closely related to production) of Hyundai and Genesis plug-in cars amounted to *16,482 (down 46% year-over-year). That's the fourth consecutive decrease, but this time, the drop is the most significant we ever recorded. The volume itself also was the lowest since March 2022. We estimate that it is around 5.2% of the automaker's total sales volume (compared to 9.4% a year ago). *Retail sales in South Korea plus overseas sales (based on wholesales; at the manufacturer level), unaudited and on a preliminary basis. All-electric car volume decreased by 45% year-over-year to 13,880, including 12,859 Hyundai (down 45% year-over-year) and 1,021 Genesis (down 42% year-over-year). Meanwhile, plug-in hybrid car volume amounted to 2,602 (up 50% year-over-year). The hydrogen fuel cell sales (Nexo model) completed the weak month with a 64% decrease to 332 units. Wholesale plug-in car sales last month (YOY change):  BEVs: 13,880 (down 45%) and 4.4% shareHyundai BEVs: 12,859 (down 45%)Genesis BEVs: 1,021 (down 42%) PHEVs (Hyundai): 2,602 (down 50%) and 0.8% share Total plug-ins: 16,482 (down 46%) and 5.2% share FCVs (Hyundai): 332 (down 64%) and 0.1% share  Hyundai And Genesis Plug-in Car Sales – February 2024      So far this year, the plug-in electric car wholesale shipments exceeded 35,000, down 31% year-over-year. The start of the year indicates that Hyundai Motor has experienced some challenges in regard to electrification. Wholesale plug-in car sales year-to-date (YOY change):  BEVs: 29,425 (down 32%) and 4.7% shareHyundai BEVs: 27,728 (down 31%)Genesis BEVs: 1,697 (down 44%) PHEVs (Hyundai): 5,715 (down 27%) and 0.9% share Total plug-ins: 35,140 (down 31%) and 5.6% share FCVs (Hyundai): 338 (down 75%) and 0.1% share  For reference, in 2023, plug-in electric car wholesale shipments exceeded 309,000 (up 29% year-over-year), which was about 7.4% of the total volume. All-electric car sales almost reached 260,000 (up 33% year-over-year), accounting for 6.2% of the total volume. Interestingly, in the United States Hyundai's all-electric car sales are growing fast. Hyundai brand      Model results In February, wholesale shipments of the E-GMP-based models (Hyundai Ioniq 5, performance-oriented Hyundai Ioniq 5 N, Hyundai Ioniq 6, and Genesis GV60) decreased by 50% year-over-year to 8,839. It's the lowest level since August 2022. The top two all-electric models in the lineup are the Ioniq 5 and Kona Electric.  The Ioniq 6 volume decreased by a stunning 90% year-over-year to 683 units. Top models (wholesale shipments) last month and YTD (YOY change):  E-GMP BEVs: 8,839 (down 50%) and 19,056 YTD (down 36%) Hyundai Ioniq 5: 6,705 (down 33%) and 15,197 YTD (down 12%) Hyundai Kona Electric: 4,588 (down 33%) and 9,493 YTD (down 24%) Hyundai Ioniq 5 N: 883 (new) and 1,868 YTD (new) Hyundai Ioniq 6: 683 (down 90%) and 1,170 YTD (down 89%)       The hydrogen fuel cell model—Hyundai Nexo—noted 332 units last month (down 64% year-over-year). Genesis brand Electrification of the Genesis brand has been going in the wrong direction recently, as the wholesale shipments amounted to 1,021 units (down 42% year-over-year). Basically, all three Genesis models—Genesis Electrified G80, Genesis GV60, and Genesis Electrified GV70—are down.        Get the InsideEvs Newsletter Sign Up Today    See also           A Rugged, XRT-Trimmed Hyundai Ioniq 5 Is Coming Soon           The Hyundai Ioniq 5 N Costs $67,475    "
    },
    "https://insideevs.com/reviews/712120/mazda-mx-30-range-extender/": {
        "pubdate": "Fri, 15 Mar 2024 20:30:47 +0000",
        "title": "The Mazda MX-30 Is Better With Its Rotary Range Extender, But Still Compromised",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/JOB9WJ/s3/mazda-mx-30-r-ev-review.jpg",
        "content": " True extended-range electric vehicles with combustion engines that never directly power the wheels are rare. Before you scroll past this entire article straight to the comments section, no, the Chevrolet Volt isn’t one because its engine is occasionally hooked up to drive the wheels. The recently unveiled 2025 Ram 1500 Ramcharger is an EREV, though, and its V6 engine and smaller battery make it interesting to a much broader audience than the pure-electric Ram 1500 REV. It makes a lot of sense for towing too. Mazda makes a real extended-range EV in the form of the MX-30 R-EV, which I got to drive for a few days. I developed strong opinions about it. If you’ve been following this website for a few years, you may remember that I tested the original all-electric Mazda MX-30 back in 2021. I also did a 70-mph winter range test, which ended after just 84 miles. I had to crawl along at no more than 50 mph for the last few miles with the amber turtle lighting up in the gauge cluster.    While I liked the MX-30 for the way it looked, its unusual interior with cork details, and its driving manners, its range wasn't enough. The pure BEV version of the model had a 35-kWh battery pack with a usable capacity of 30.5 kWh, giving it an EPA range of 92 miles. The 124-mile WLTP estimate always seemed very optimistic, virtually impossible to achieve outside laboratory tests. That’s why I was quite excited to get behind the wheel of the MX-30 R-EV, which has half the battery capacity of the pure-electric model (17.8 kWh gross, about 15 kWh usable), as well as a 13.2-gallon tank to fuel its rotary range extender. Since there is no plan to sell the extended-range version in the US, it doesn’t have an EPA-estimated range, but in Europe, it should cover up to 423 miles on a full battery and tank on the WLTP cycle (I never saw more than 280 miles of predicted range). The Engine Never Drives The Wheels             Just like the BMW i3 REx or the Ramcharger, the MX-30 RE-V has no way for its combustion engine to power the wheels directly. It is an 830cc single-rotor Wankel unit located under the MX-30’s quite long hood. You hear it start up regularly as you drive the car, although this also depends on the selected driving mode, of which there are three. It has a Normal mode, which lets the vehicle decide when to charge the battery. In this mode, you won’t hear the engine start up unless you floor it, but it will start once the state of charge dips below 45 percent. It’s worth noting that the MX-30 R-EV’s claimed WLTP electric-only range is 53 miles, but during my time with the vehicle (with temperatures hovering a few degrees above freezing point), it never displayed a range of more than 30 miles. The EV mode forces the vehicle to use up more of the available electrons, and it will keep the engine off until you hit about 20 percent state of charge, when it will start behaving much like it does in Normal mode. There is also a Charge mode, which allows you to set a desired state of charge, and the vehicle will keep the engine on for longer to keep topping up the battery.             During my time with the car, I toggled between Normal and Charge modes quite regularly, although even with the latter selected for long stretches of driving, I never saw the state of charge go above 90 percent. Hearing the small Wankel spin into life is unusual because it doesn’t sound like your typical engine. From the outside, it almost sounds like a quieter, well-muffled version of a two-stroke chainsaw engine that doesn’t rev very high and sits at a constant rpm. You hear when it starts, but it’s never rough-sounding, and I didn’t feel any noticeable vibrations make their way into the cabin even under hard acceleration. The electric powertrain still makes a futuristic whoosh as you accelerate. It's more audible in EV mode, but you can still hear it with the engine on. The Range Extender Makes The MX-30 Better, But Also Worse             Even though Mazda’s European blurbs brand the MX-30 R-EV as a plug-in hybrid, I suspect that’s simply because the average buyer wouldn’t know what an extended-range EV is, and PHEVs are more common and better understood. On the move, it feels like an EV, not a PHEV, and the driving experience is almost identical to that of the BEV variant. It’s still a single-motor, front-wheel-drive car, but Mazda has upped its power from 143 horsepower to 168 horsepower, which, despite the R-EV’s extra weight, shaves six-tenths off the sprint time from 0 to 62 mph; it drops to 9.1 seconds. Torque is the same for both variants: 192 lb-ft.    Get the InsideEvs Newsletter Sign Up Today   The R-EV feels a bit quicker than the BEV, but the difference is minimal. Both variants top out at 87 mph, which is pretty low, especially if you plan on buying this vehicle in Germany with its de-restricted autobahns. Show the MX-30 R-EV a twisty road, and it will reward you with its sharp and well-judged steering, its minimal body roll, and the pleasant surge of torque from its electric motor. The motor does a good job pulling this almost 4,000-pound vehicle out of corners; it almost feels nimble. I did notice that the electric motor’s response is not as immediate as in some other EVs, so when you put your foot down, the power delivery feels more gradual and similar to what you would experience in an ICE vehicle.             Much of what I experienced during my time with the MX-30 was almost identical to what I remember from my original drive almost three years ago. This is a pleasant vehicle to be aboard and drive. It has a relatively cramped back seat with slightly awkward access and not a lot of cargo room, but it's charming. The big change for me was that the battery meter was no longer scary in the R-EV. In the fully electric model, I was always glancing down at the range prediction. As much as I liked the MX-30 during my initial drive, it was marred by the range anxiety that I felt while I had the car. With the onboard generator, though, this is not something you think about anymore. I just drove this like a normal car and only charged it once to see how close it came to reaching its maximum charging rate of 36 kW. It’s quite slow for an EV, but perfectly acceptable for a PHEV. It pulled about 26 kW from a 50 kW station with about 35 percent state of charge, but I had not prepared the battery for charging and, at that point, temperatures had dipped below freezing.   Gallery: Mazda MX-30 R-EV              21 Photos                                                                                                While my experience with the R-EV was a lot more pleasant than with the BEV, I can’t help but think that many people who buy it will never plug it in. This is a problem with all plug-in hybrids and EREVs. Used like this, the R-EV won’t come anywhere near achieving its claimed 235 mpg (1 l/100km) efficiency, although it should still average a respectable 32 mpg with a flat battery. When BMW increased the size of the i3’s battery pack, it also decided to ditch the range extender option, so perhaps Mazda should have done the same with the MX-30 and simply not bothered with the tiny Wankel generator. The pure electric MX-30’s battery was quite small, and no matter how much Mazda insisted it was enough, buyers shunned the model to the point where you hardly ever see one on the road here in Europe. Maybe what it really needed was a bigger battery and more range, not an EREV variant, as cool as it is with its unique rotary engine. The R-EV variant should sell better, especially since it costs the same as the BEV, which is still sold on the Old Continent. It makes sense for people looking to buy a plug-in hybrid, but the BEV variant will remain just as unattractive for pure EV buyers. In fact, the R-EV makes the standard MX-30 look even less appealing.  More On This           Mazda Wants To Launch 7-8 New EVs This Decade. But Don’t Expect Powerful Sports Cars           Mazda Wants You To Know It Will Also Use Tesla's NACS Plug In North America    "
    },
    "https://insideevs.com/features/712619/ev-ideal-maintenance-schedule/": {
        "pubdate": "Fri, 15 Mar 2024 19:59:50 +0000",
        "title": "What's The Ideal EV Maintenance Schedule?",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/BXeQVZ/s3/ev-maintenance-101.jpg",
        "content": " The maintenance required for an electric vehicle is in some ways very similar to maintaining an internal combustion vehicle, but in some ways, it’s also quite different. Some things wear out quicker, while others need to be replaced a lot less often, and some items that are regularly serviced in an ICE car don’t even exist in EVs, so you never have to worry about them. Given the nature of electric motors, which have a lot fewer moving parts than combustion engines and don’t require regular fluid changes or the replacement of mechanical components that wear out, EVs generally require less maintenance. This also means EV maintenance should be cheaper overall, although some models aren’t renowned for their reliability, and you might end up visiting a garage more often than you would think. Thankfully, the biggest components in your EV, the battery pack and motors, need very little maintenance if you follow the manufacturer’s recommendations. Automakers recommend longer servicing intervals for EVs than they do for comparable ICE vehicles, though, so if no unexpected problems creep up, owning an EV should be a more hassle-free experience. Let’s examine each of the major items of EV maintenance and their specific requirements. Battery Pack             An electric vehicle’s battery pack should retain a significant part of its original usable capacity even after a decade of use. However, that only applies to EVs whose lithium-ion batteries are equipped with a thermal management system—batteries in EVs that don’t have one last a lot less—and it’s best to keep your EV in a garage during the coldest winter months as well as during the height of summer when temperatures are highest. It’s also best to leave an EV plugged in if it’s not in use for a long time, as this will prevent the battery from being completely drained by providing power for the thermal management system that works even when the vehicle is turned off. You can even get a special charger with a timer to only provide power at certain times, and you can also set charging limits. Frequently DC fast charging also accelerates battery degradation and capacity loss, especially if you regularly charge it from a very low state of charge or past 80–90 percent. This is less of a problem for lithium iron phosphate (LFP) batteries, which are much less prone to being damaged by being fully charged. Regarding the actual maintenance that you need to do for the battery pack specifically, there’s nothing you can do other than make sure the coolant hasn’t seeped out or evaporated and is at the correct level. You can expect your EV’s battery to last up to 15 years if you live in an area with a mild climate and you keep it in a temperature-controlled garage, or it could drop to under 10 years if you live somewhere with harsh winters and very warm summers and you leave the vehicle parked on the street and not plugged in when not in use. Motors             Just like the battery pack, the motors in an EV require little to no regular maintenance, depending on their type. There is a lot less to go wrong, given that the only moving part is the rotor, which spins while inside a magnetic field, it creates along with the stator. There are no gears, belts, or chains, and there are no parts that wear out over time. Some motors may require disassembly and cleaning, but that depends on their type, and there’s no reason why an electric motor can’t last for hundreds of thousands of miles. That’s comparable to a combustion engine, which needs a lot more maintenance, care, and consumables to last as long as an electric traction motor. The transmission in electric vehicles, with very few exceptions, is a simple single-speed reduction gear mechanism that should also last a long time under normal use. Since there are no gears to shift and all the transmission is doing is stepping down the rpm from the motor’s output shaft to increase torque and move the vehicle, there’s a lot less that can go wrong compared to a traditional multi-speed or continuously variable transmission. Fluids             One area where EVs and ICE cars are similar is in the fact that they both need lubrication and cooling, and this is done via fluids. Motor and transmission lubrication is achieved through the use of oils that also help with cooling. However, you don’t need to change this oil since it doesn’t lose its lubrication properties over time as it does in an ICE vehicle, where it goes through thousands of thermal cycles. You only need to top up this oil if some of it has leaked out and is below the recommended level. Just like many ICE vehicles (as well as some heating and ventilation systems for buildings and other applications), most EVs require a glycol-based coolant. Since this type of coolant doesn’t contain water, it doesn’t conduct electricity, and so it is safer to use with lithium-ion battery cells. You usually don’t have to change the coolant because it will last longer in an EV compared to an ICE vehicle. One reason coolant lasts longer in an EV has to do with the fact that it will never get as hot as in a combustion vehicle, where it’s recommended that you replace it every two years. You still have to change it in an EV, but it can last up to 5 years if nothing goes wrong with the vehicle. Some EVs inform you about the coolant level and how often it needs to be changed. Ask your dealer or refer to the manual to see what applies to your specific vehicle. Tires             EVs are heavier than ICE vehicles because they have to carry around a hefty battery pack, and this extra weight will accelerate tire wear. You still have to get your tires rotated as you would in any car every 5,000 to 8,000 miles, but you will find that they need to be replaced more frequently than in a gas car. Regarding wear, it could be between 20 and 50 percent faster than in a gas car, but you should keep in mind that this is directly correlated with the vehicle’s weight—the heavier the EV, the sooner it will need new tires. If you own a smaller and lighter EV, like a Chevrolet Bolt, which weighs around 3,560 pounds, its tires will last longer than the tires on a much heavier Tesla Model S. Powered wheels always wear out faster, so if your EV is all-wheel drive, you can expect quicker tire wear at all four corners. The instant torque delivery of electric motors is another factor that accelerates tire wear in an EV. The more powerful the vehicle and the more brutal the power delivery, the quicker the tires will wear out. Quicker performance-oriented all-wheel drive EVs like the Porsche Taycan Turbo will chew through their tires quicker than the base rear-wheel drive Taycan. Some major tire manufacturers have developed EV-specific tires, which are designed to cope with EVs’ extra weight as well as provide less rolling resistance and improve range. EV tires feature beefed-up sidewalls designed to cope with an electric car’s extra mass and improve control and safety. Brakes             EVs rely heavily on their electric motors for braking. Some even allow you to one-pedal drive and come to a complete stop without even coming near the brake pedal. You therefore rely on the friction brakes less than you do in a combustion car, even despite the extra weight that EVs have to carry around, which you would think also puts additional strain on the brakes. Volkswagen equips all its MEB-based EVs, even the performance models, with drum brakes on the rear, specifically because it found during testing that vehicles still had plenty of stopping power just by using the front disks and regen. Automotive parts manufacturer Continental has even proposed a concept for lighter-duty EV-specific disk brakes with considerably thinner disks (of the sort you would see on a motorcycle), arguing that powerful friction brakes will not be needed in EVs whose regenerative braking is becoming even stronger. How quickly the brakes wear out in your EV is ultimately dependent on how much you use the regen function. If you like to wind that all the way down and just coast and rely on the friction brakes to stop, then you will probably need new pads sooner than you would have in a similar ICE vehicle (because the EV’s extra weight puts additional stress on the friction brakes if it’s not helped by regen). If, however, you drive your EV in one-pedal driving mode and you hardly ever touch the brake pedal, then there’s no limit to how long the pads can last. Other Consumables             The intervals for replacing wiper blades and cabin air filters should be similar to those for a gas-powered car. You will also have to replace your EV’s 12-volt battery every five to seven years. It is used to power the screens, the vehicle’s onboard computers, the diagnostic systems, and pretty much all peripheral systems. Even in a Tesla, the 12-volt battery is used to power everything but the drive motors. If your EV’s 12-volt battery dies, you will need to recharge it to start the vehicle—it could leave you stranded even if there is current in the big traction battery. With EVs' extra weight, more stress is also put on suspension components including shock absorbers and bushings. These may also wear out quicker than in a comparable combustion car, although manufacturers have addressed this by making the suspension components slightly heavier-duty to cope with the extra mass. Another component that may wear out more quickly in an EV is each wheel's hub assembly (specifically the bearing inside), which is put under more stress in a heavier vehicle.  More EV 101 Articles           What Are The Different Types of EV Chargers?           How Efficient Is Each Type Of EV Charger?    "
    },
    "https://insideevs.com/news/712634/volkswagen-id2-gti-usa-sales/": {
        "pubdate": "Fri, 15 Mar 2024 19:30:09 +0000",
        "title": "Electric Volkswagen GTI For The U.S.: 'I Think The Car Would Sell,' CEO Says",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/y2GP6K/s3/id.-gti-usa-top.jpg",
        "content": " When the Volkswagen ID.GTI Concept debuted last year, it gave fans all over the world some hope that the legendary hot hatchback would survive to be part of the automaker's all-electric future. But that also depends on whether the actual EV, slated to go on sale later this decade as the ID.GTI, will make it to one of the countries that loves the GTI the most: the United States.  The good news is that Volkswagen Group of America CEO Pablo Di Si is as enthusiastic as anyone about that proposition. \"I loved it,\" he told InsideEVs in an interview this week. \"It's a beautiful car. I think it would sell in America. I think it has potential. It's a 'love vehicle' in the U.S.\"  The bad news is bringing it stateside may be easier said than done. Whether the ID.GTI can be priced correctly for the U.S. is an open question.   Get Fully Charged  Volkswagen tweaks its all-electric future  Volkswagen has committed to going all-electric in the coming years, while adding more hybrids to its portfolio in the meantime. The ID.GTI concept made a huge splash when it was unveiled last year, but whether it's sized and priced right for the American market is an open question—as is what will happen to the legendary GTI itself in the EV future.    The production version of the ID.GTI Concept has been greenlit for arrival in 2026. The car it is based on, the Volkswagen ID.2, may not make it to our shores. Last year, a VW spokesperson said it wouldn't, and Di Si himself told Car and Driver that it's probably not the right size for U.S. buyers.     Gallery: Volkswagen ID. GTI Concept              51 Photos                                                                                                Despite its decidedly Golf-like looks, the ID.2 is quite a bit smaller than the current Golf. It's a little closer in size to the subcompact Polo. And American buyers have certainly not been in the habit of buying Golfs in volume like the rest of the world. With the discontinuation of the U.S.-market Golf in 2021, the only variants now sold here are the GTI and the more powerful Golf R.  You can thank those cars' rabid fanbase for that decision. Even as Volkswagen has pivoted heavily to crossovers and SUVs to meet market demand in the U.S.—they make up the bulk of VW's current American portfolio, including the lone EV for now—the GTI and Golf R have a dedicated enthusiast car culture surrounding themselves. The GTI is credited as being the original hot hatchback, and whether it's slammed to the ground or just a bone-stock daily driver, their mix of speed and practicality has made it an iconic gearhead staple on par with the Mazda Miata, Ford Mustang and BMW M3.  And while the ID.GTI's specs haven't been released yet, the ID.2all concept was said to put down 223 horsepower to the front wheels. The ID.GTI will certainly pack a bigger punch, making it more powerful and likely faster than any gas-powered GTI.             So while Di Si wouldn't confirm the ID.GTI for the U.S., he's thinking about what levers could be pulled. \"It would make sense if we hit the price points,\" he said. The company wants a volume-player EV priced around $25,000, Di Si said. If it goes too high, he said it's too much of a \"niche vehicle.\" (The current gas-powered GTI starts at around $32,000.) \"Do we have a plan? Not yet, but it is on our radar,\" Di Si said. \"The majority of the cost comes from the batteries.\" Electric performance cars are clearly on Volkswagen's radar in general. This week, the automaker also unveiled the ID.3 GTX, a 321-horsepower variant of its Golf-like electric ID.3, as well as the ID.7 GTX Tourer, a go-fast wagon with 335 hp.             Yet while the ID.3 GTX seems like a shoo-in to take up the GTI's mantle, the ID.3 isn't sold in the U.S. at all. And then there's the question of what's going to happen with the future Golf itself, which is also slated to go electric-only on a new platform.  But that's further down the line. The ID.GTI should be on sale before then, and it would be a shame if American fans had to wait so long for some new electric Golf GTI to appear. Clearly, the ID.GTI is a hype machine already, and with more and more Americans asking for affordable EVs—and even smaller ones—it feels like not bringing this EV hot hatch stateside would be a real misfire. Let's put it this way: If Dodge can bring somehow the Charger into the electric era, surely Volkswagen can figure this one out. Contact the author: patrick.george@insideevs.com  More Volkswagen News           Volkswagen Is Expanding Its EV Lineup, But Not The EV Price War           New Volkswagen ID.3 GTX And ID.7 GTX Tourer Come With More Power, Sporty Looks           Volkswagen ID.3 Production Won't Expand Due To 'Low Demand': Report           VW Benchmarking ID. GTI EV Prototype Against Fifth-Gen Golf GTI: Report           Volkswagen ID. GTI Concept Revealed, Previews Future Electric Hot Hatch               VW ID.4 GTX Review: The Most Fun-To-Drive ID.4 Of Them All    "
    },
    "https://insideevs.com/news/712599/india-approves-new-ev-policy-clears-way-for-tesla/": {
        "pubdate": "Fri, 15 Mar 2024 19:00:20 +0000",
        "title": "Tesla’s Official India Entry Almost Confirmed Under New EV Policy",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/40KmAZ/s3/india-clears-way-for-tesla.jpg",
        "content": " A major regulatory roadblock has been cleared for Tesla as it plans to expand its presence in South Asia. India, the world’s third-largest passenger vehicle market behind China and the U.S., has agreed to lower its punitive tariffs on certain imported electric vehicles, its commerce ministry announced today. India imposes up to a 100% import duty on cars manufactured overseas. That means the standard range Tesla Model 3, which starts at $38,990 in the U.S. would cost over $77,000 in India under the current regulations.   Get Fully Charged  Tesla always wanted to go global.  Tesla CEO Elon Musk has expressed his desire to expand the automaker's presence globally several times. At one point Musk also wanted to enter Russia, but later called off that operation due to the war in Ukraine. Outside the U.S., Tesla has plants in Berlin and Shanghai. A Mexico gigafactory is under construction and now India just cleared a big regulatory hurdle for the automaker to enter.    These rules have now been relaxed for electric cars as long as automakers invest at least $500 million in local manufacturing. This threshold is much lower than what Tesla was earlier ready to commit, about $2 billion if import taxes were lowered for the first few years. Asia’s third-largest country will lower import tariffs to 15% if certain conditions are met. They include setting up a local manufacturing facility in three years and reaching 50% “domestic value addition” in five years—to promote localization at an increasing rate in that timeframe.      Only 8,000 EVs would qualify for the lower 15% import tariff annually, and automakers will have to back up their investment with a bank guarantee, the commerce ministry said. Local players like Tata Motors and Mahindra & Mahindra have been lobbying against this move, fearing hurting their own businesses. But the commerce ministry said that the new rules would “strengthen the EV ecosystem by promoting healthy competition among EV players leading to high volume of production, economies of scale, lower cost of production, reduce imports of crude oil, lower trade deficit, reduce air pollution, particularly in cities, and will have a positive impact on health and environment.\" \"It's quite likely that there will be a significant investment relationship with India in the future. Tesla will be in India as soon as humanly possible,\" CEO Elon Musk said last year in New York City where Indian Prime Minister Narendra Modi arrived for an official state visit. The two also met on the sidelines and courted each other to build a partnership.   Get the InsideEvs Newsletter Sign Up Today   According to IQAir data, six of the world’s 10 most polluted cities are Indian. Just like the U.S., India’s transportation sector emits a big chunk of its total carbon emissions. However, India says this policy isn’t targeted at any one particular company. \"We invite global companies to come to India. I'm confident India will become a global hub for EV manufacturing and this will create jobs and improve trade,\" Commerce Minister Piyush Goyal told reporters at a press briefing, Reuters reported. Tesla already has an office in India in the city of Pune (which also happens to be yours truly’s hometown), but now it would need a strong management team on the ground to clear the local regulatory steps and accelerate its manufacturing goals. It's unclear which models Tesla will initially import to India and later manufacture. But the smallest and the cheapest would make the most sense, like the Model 3 and the Model Y, and also the upcoming \"Redwood\" project, which is rumored to be called the Model 2.             Three years to build a plant may seem adequate, as Tesla got Giga Shanghai up and running in just ten months—that plant is Tesla’s largest globally by manufacturing capacity. Beyond the U.S. and China, Tesla also has a factory in Berlin, and another one is under construction in Mexico. However, Elon Musk’s company has a limited presence in the BRICS nations, apart from China of course. India, the world’s most populated country with over 1.4 billion people, has a burgeoning middle class, and a booming tech industry. If its India plant ever materializes, it could become an export hub as several global tech giants look for a \"China plus-one\" strategy in Asia. Correction: A previous version of this article misstated the Tesla Model 3's U.S. price. The Model 3 starts at $38,990 as of March 15, 2024. $33,990 is after probable tax credits.  More Tesla News           Tesla Model Y Shines In 2023 U.S. Vehicle Registrations, But Gas Trucks Still Dominate           Analysts Warn That Tesla's Next Growth Phase, Boosted By Model 2, Is Years Away           Tesla Paid Executives More Than it Paid Taxes for Years: Report           Tesla Cybertruck Gets Creamed By Rivian R1T, Every ICE Off-Road Truck In This Test    "
    },
    "https://insideevs.com/news/712631/mercedes-eqxx-breaks-its-own-efficiency-records/": {
        "pubdate": "Fri, 15 Mar 2024 18:30:33 +0000",
        "title": "Mercedes-EQXX Covers 627 Miles On Single Charge With AC On",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/wlZ4LV/s3/mercedes-benz-vision-eqxx-in-saudi-arabia.jpg",
        "content": " This news might sound like deja vu. Mercedes-Benz Vision EQXX, the brand’s globe-trotting technology demonstrator doing all the hard work so that future road-going Mercedes EVs can be as efficient as possible, just covered 627 miles on a single charge. Yes, again. But this time its energy efficiency was even better. Mercedes engineers drove the Vision EQXX longtail across the Arabian desert. The EV traveled from Riyadh, Saudi Arabia, to Dubai, UAE. It clocked an efficiency of 8.4 miles per kilowatt-hour, as its aerodynamic form factor cut through the air, battled desert heat, and covered hundreds of miles on battery power across empty highways.  Get Fully Charged  Mercedes-Benz has taken a step back from EVs, but R&D continues.  Mercedes-Benz had committed to an all-electric portfolio by 2030. But with the recent EV sales slowdown worldwide, and an impending presidential election in the U.S. which could shape the EV industry going forward, the German automaker has taken a step back. But that doesn't mean it's sitting idle. A new EV based on the one-size-fits-all MMA platform will debut later this year, and development for future EVs is underway as well.    In its first outing from Sindelfingen, Germany to Cassis, France, the EQXX covered an equally impressive 626 miles but the efficiency was comparatively lower at 7.1 miles/kWh. That was in 2022. Again later the same year, the EQXX road tripped from Stuggart to Silverstone, covering 747 miles on a single charge, averaging 7.5 miles/kWh. A 2023 Tesla Model 3 Long Range AWD has an efficiency of about 3.8 miles/kWh, according to the EPA. Even though the Tesla is aerodynamic in its own right, it doesn’t have any of the additional aero chops of the EQXX. The Mercedes is extremely slippery, with a drag coefficient of 0.17, better than any production sedan.             It also gets a streamlined rear section with an additional aero blade under the rear bumper stretching out and away from the body to make the air exit from the undercarriage as smoothly as possible. It’s also made from materials you normally don’t see in affordable mass-market production cars, like weight-saving carbon fiber reinforced plastic. So it’s unclear how much of this efficiency we’ll ever see in the real world. That said, it averaged 42.7 miles per hour, delivering 282 MPGe. The air conditioning was on along the way, and a “multi-source heat pump” minimized energy losses, Mercedes said. The EQXX has a 100 kWh battery capacity based on a 900-volt system architecture.   Get the InsideEvs Newsletter Sign Up Today   “The EQXX continues to provide valuable data for developing advanced electric efficiency technologies. All systems performed perfectly in the desert, handling challenges such as road surface finish, temperatures, and dust, with ease,\" Markus Schäfer, the chief technology officer at Mercedes-Benz AG, said. \"It's proof that electric drive is ready for global markets.” Mercedes-Benz also said the EQXX is a close-to-production concept, previewing the model family based on its next-generation MMA platform. Some of its heat pump tech is carried over to the Concept CLA that Mercedes showcased in 2023. The MMA will spawn into the next generation CLA, in addition to two crossovers and a station wagon.  More Mercedes News           Mercedes-Benz Delays Its EV Plans, Will Keep Making Combustion Engines           Mercedes-Benz MBUX Hyperscreen Review: Gimmick Or Game-Changer?           Tesla-Rivaling 'Ionna' Charging Network From Seven Automakers Starts Taking Shape           2024 Mercedes-Benz eSprinter First Drive Review: Electric Vans Are The Future    "
    },
    "https://insideevs.com/features/712516/chinese-evs-in-europe-models-price-range/": {
        "pubdate": "Fri, 15 Mar 2024 17:00:16 +0000",
        "title": "These Are The Chinese EVs Trying To Take Over Europe. Is The U.S. Next? (Updated)",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/1ZK46p/s3/chinese-evs-in-europe.jpg",
        "content": " Chinese EVs. They’re the fuel to the fire that prompted the European Union to investigate whether or not slapping tariffs on them will make the world a better place. Tesla CEO and social media owner extraordinaire Elon Musk also went on record saying that Chinese automakers would “demolish” American car manufacturers if it weren’t for trade barriers, more of which are apparently in the works. China-based EV builders are trying to get ahead of the curve by planning to build factories either in Mexico or countries of the EU. Still, until that happens, the fact of the matter is that Europe has its fair share of Chinese-made battery-powered cars available. The abundance of models and their relatively low prices managed to scare big names like Volkswagen, Stellantis, and Renault into rethinking their EV strategies. But is the threat of Chinese EVs actually that big? And more importantly, what are the names of these cars that made high-ranking officials take a stand? Well, you came to the right place because this article will tell you exactly what you’re looking for. We’ll start by laying out some numbers. China is the world’s latest market for electric vehicles, thanks in no small part to massive state subsidies and big tax breaks for domestic manufacturers. This led to a boom in EV-specific technology development and a rise in the number of companies that would otherwise be unable to bring a complete, working car to the market. According to customs data quoted by NPR, Chinese EV shipments to Europe increased by 361% since 2021. That said, made-in-China battery-powered cars accounted for just 10% of the 1.1 million BEVs sold in Europe in 2022, according to KPMG.  More Stories Like This           Chinese Cars Would Get 125% Price Increase Under New Senate Bill           A Guide To BYD, The Chinese Automaker That Just Surpassed Tesla           Nio And Geely Join Forces On Battery Swapping Tech           Here’s How Stellantis Wants To Bring Cheap EVs To The Masses           EPA Vs. WLTP EV Range Ratings: Here’s Why They’re Different           What Are The Different Types of EV Chargers?    But that number is rising thanks to the almost irresistible attraction to prices that are sometimes 30% lower than European-made EVs. So let’s take a look at what cars Chinese carmakers are trying to push on the Old Continent so that we can get an idea of what to expect if they’ll ever make their way stateside. The prices include VAT but don’t include any state or local incentive. The range is the maximum figure for the combined cycle in the WLTP testing procedure.   Gallery: 2023 BYD Dolphin in European specification              112 Photos                                                                                                       BYD Dolphin  Price: from €33,990 ($37,065) in France Range: 427 km (265 miles) WLTP Battery: 60.4 kWh  BYD, which is an acronym for Build Your Dreams, is the world’s largest manufacturer of so-called new-energy vehicles, or NEVs–that’s hybrids, plug-in hybrids, and all-electric cars. The Dolphin is one of the most affordable EVs made by BYD, and it won accolades almost everywhere it’s been made available, thanks in part to the automaker’s strategy to tweak the model for each specific market. In Japan, where the Dolphin won the “2023 EV of the Year Award,” the hatchback was made slightly shorter so that it could fit in the automated parking garages that are common in the country. In Europe, the Dolphin is longer than the version sold in China because BYD wanted to make sure it got high marks in Euro NCAP’s crash testing procedures. And high marks it got, scoring five out of five stars during last year’s testing.   Gallery: 2023 BYD Seal in European specification              104 Photos                                                                                                BYD Seal  Price: from €46,990 ($51,250) in France Range: 570 km (354 miles) WLTP Battery: 82.5 kWh  The Seal is seen by many as being the biggest rival to the popular Tesla Model 3, Chinese-made or otherwise, and it’s easy to see why. In France, the BYD Seal slots right between the two versions of the Model 3, both in terms of price and claimed range. Tesla’s electric sedan starts at €42,990 ($46,900) and offers a WLTP-rated range of 513 km (318 miles) in the entry-level rear-wheel drive version, while the Dual-Motor All-Wheel Drive Model 3 starts at €50,990 ($55,600) and has a claimed range of 629 km (390 miles).  Meanwhile, the rear-wheel drive version of the BYD Seal starts at €46,990 ($51,290) and offers 570 km (354 miles) of range, and the dual-motor version goes from €49,990 ($54,500) and has a claimed range of 520 km (323 miles).   Gallery: BYD Atto 3              10 Photos                                                                                                BYD Atto 3  Price: from €37,990 ($41,450) in Germany Range: 420 km (260 miles) WLTP Battery: 60.4 kWh  Moving up on the price range in BYD’s lineup, the Atto 3 is an all-electric crossover that’s smaller than the Tesla Model Y but roughly the same size as the Volkswagen ID.4. However, the Atto 3 has a starting price that’s about €2,000 ($2,200) lower than the ID.4 all while offering a driving range that’s 56 km (34 miles) longer than the German electric crossover, thanks to the Atto 3’s larger battery.   Gallery: BYD Seal U              8 Photos                                                                                                BYD Seal U (also known as the Song Plus EV)  Price: from €42,740 ($46,650) in Belgium Range: up to 500 km (310 miles) WLTP Battery: 71.8 kWh or 87 kWh  The Seal U is much closer to the Model Y in terms of size than the Atto 3, but it’s also more expensive than its smaller brother. However, its starting price is still roughly €1,000 ($1,100) lower than the Model Y in Belgium. This time around, though, Tesla’s Model Y wins the range game, seeing how the entry-level BYD Seal U has a claimed WLTP figure of 420 km (260 miles), while the cheapest Model Y has 455 km (282 miles).   Gallery: BYD Han              37 Photos                                                                                                       BYD Han  Price: from €70,800 ($77,300) in France Range: 521 km (323 miles) WLTP Battery: 85.4 kWh  The story goes on with the Han, which is BYD’s flagship electric sedan, much like the Model S is Tesla’s flagship sedan. The two battery-powered cars have similar dimensions, but again, it’s the price where BYD wins. In France, the Han starts at €70,800 ($77,300), which gets you a fairly well-appointed all-wheel drive EV with up to 323 miles of WLTP range. At the same time, the base Tesla Model S, which is also all-wheel drive, starts at €94,990 ($103,700) in the Hexagon. Granted, the Tesla Model S Dual-Motor has a WLTP-rated range of 634 km (393 miles), has a higher top speed, and can accelerate from zero to 62 mph (0-100 kph) quicker than the BYD Han, but to budget-minded customers, the lower price will always trump the specs sheet.   Get the InsideEvs Newsletter Sign Up Today     Gallery: 2021 BYD Tang              27 Photos                                                                                                BYD Tang  Price: from €70,800 ($77,300) in France Range: 400 km (248 miles) WLTP Battery: 86.4 kWh  The Tang is BYD’s flagship electric crossover in Europe. It’s not quite as big as the Tesla Model X (it’s roughly 6 inches shorter), but just like the company’s other offerings, it’s rather well priced on the Old Continent, starting at under €71,000 in France. By comparison, the Model X–which, again, is slightly larger and offers 176 km (109 miles) of extra range on the WLTP cycle–starts at €101,990 in the Hexagon. However, the Audi Q8 e-tron, which is almost identical size-wise to the Tang, is also more expensive than its Chinese rival. In France, the Q8 starts at €89,100, which is a lot of money over the Tang, but it also comes with more range–532 km (330 miles) versus the Tang’s 400 km.            7 Photos                                                                                                       Aiways U5  Price: from €33,250 ($36,400) in Germany Range: up to 400 km (248 miles) WLTP Battery: 63 kWh  Aiways is a rather obscure name, even in its home country, but even so, it managed to establish a presence on the Old Continent. The company was founded in 2017 in Shanghai and then it bought a stake in the Chinese automaker Jiangling Holdings, which allowed it to start vehicle production sooner than an up-and-coming startup would otherwise have. However, things are far from rosy for the once-promising automaker, with its fate somewhat of an unknown. Last year it suspended one of its factories, ended the lease on its Shanghai headquarters, and was struggling to pay its staff. Its first model, the U5, debuted in 2018. It features a sandwich-style battery pack with cells provided by CATL, but the pack and its electronics were designed in-house by Aiways. The U5 is roughly the same size as the Volkswagen ID.4 but the starting price is €7,000 ($7,700) lower than the ID.4.   Gallery: Aiways U6 EU Version              11 Photos                                                                                                Aiways U6  Price: from €48,178 ($52,700) in Germany Range: 405 km (251 miles) WLTP Battery: 63 kWh  The U6 from Aiways uses the same 63 kWh battery as the U5 but its body is larger, putting it in the same category as the wildly popular Tesla Model Y. With a fastback shape, the U6 has a single, front-mounted electric motor that makes 150 kW (201 hp). That’s not a lot of power for an all-electric crossover, and the price is also not that attractive, considering the entry-level Tesla Model Y starts at €44,990 in Germany and offers more range for the money.   Gallery: 2023 Xpeng P7 Refresh              25 Photos                                                                                                Xpeng P7  Price: from 472,903 Norwegian kroner ($45,150) in Norway Range: up to 576 km (357 miles) WLTP Battery: 86.2 kWh  Xpeng, which stands for Xiaopeng, which is one of the names of its founders, is somewhat of a darling of the technology community, at least in China. The company was founded just 10 years ago but attracted high-ranking names from giants like Alibaba, Xiaomi, and GAC Group.  Xpeng’s second model, the P7 four-door electric sedan, was launched in 2019 and exports to Norway began in 2021. It slots between the Tesla Model 3 and Model S in terms of size and features Xpeng’s Xpilot 3.0 driving assistance system that includes 12 ultrasonic sensors, 14 cameras, 5 high-precision millimeter-wave radars, and 31 other sensors.   Gallery: 2023 Xpeng G9              16 Photos                                                                                                Xpeng G9  Price: from 537,430 Norwegian kroner ($51,300) in Norway Range: up to 570 km (354 miles) WLTP Battery: 78.2 kWh or 98 kWh  The G9 is slightly larger than the Tesla Model Y and it’s also more expensive than the American electric crossover. It features Xpeng’s next-generation driving assistance system known as Xpilot 4.0 which ups the ante with Level 4-capable automated driving hardware. It’s also based on an 800-volt architecture and has two Nvidia Drive Orin system-on-a-chip.   Gallery: NIO ET5              15 Photos                                                                                                NIO ET5  Price: from 408,000 Danish kronen ($59,850) in Denmark Range: up to 560 km (347 miles) WLTP Battery: 75 kWh or 100 kWh  Nio made a name for itself after it charged ahead with its battery-swapping stations in China and later in Europe. The company is so confident in the technology that the base prices you see here don’t include the price of the battery, making them quite attractive at first glance. Customers can buy the packs, though, or they can pay a monthly subscription which takes the hassle out of having to deal with a dead battery sometime down the line. Nio also offers subscriptions for the whole car. The ET5 fastback is Nio’s Model 3 rival. Unlike the American-designed EV, however, the ET5 features a digital cockpit with augmented reality and virtual reality built-in, as well as a myriad of sensors that feed information to the advanced driving assistant systems. The ET5 is more expensive than the entry-level Model 3 and offers less range when comparing the top-spec versions.   Gallery: 2023 NIO ES6              8 Photos                                                                                                Nio EL6 (also known as the ES6 in its home market)  Price: from 454,000 Danish kronen ($66,600) in Denmark Range: up to 529 km (328 miles) WLTP Battery: 75 kWh or 100 kWh  The ES6, which is known as the EL6 in Europe because Audi won a court case arguing ES6 sounds too much like E S6, is an all-electric crossover that comes with massaging seats, up to 529 km (328 miles) of WLTP-rated range, and ADAS with about 50 sensors. It’s slightly larger than the Tesla Model Y and it’s also more expensive, being positioned as a premium model. Also, don’t forget that the price of the battery isn’t included in the MSRP.   Gallery: NIO ET7              48 Photos                                                                                                NIO ET7  Price: from 684,000 Danish kronen ($100,350) in Denmark Range: up to 580 km (360 miles) WLTP Battery: 75 kWh or 100 kWh  The ET7 is the company’s flagship sedan, much like the Model S is Tesla’s flagship four-door sedan. It has a similar advanced driving assistance system as the other models in the automaker’s lineup and ups the poshness with soft-close, frameless window doors, a large panoramic roof, and a 23-speaker Dolby Atmos-certified sound system.   Gallery: Nio ES7              15 Photos                                                                                                NIO EL7 (also known as the ES7 in its home market)  Price: from 724,000 Danish kronen ($106,250) in Denmark Range: up to 509 km (316 miles) WLTP Battery: 75 kWh or 100 kWh  The EL7 (or ES7 in China) is the largest crossover Nio sells in Europe. It’s positioned as a luxury EV that comes as standard with a lot of leather, power-adjustable backrest at the rear, and vehicle-to-load (V2L) functionality.   Gallery: Ora Funky Cat First Edition in UK specification              14 Photos                                                                                                GWM Ora 03 (also known as the Ora Funky Cat)  Price: from €26,990 in Germany Range: up to 420 km (260 miles) WLTP Battery: 48 kWh or 63 kWh  The Ora 03 is made by Great Wall Motor (GWM) and is marketed as a retro-futuristic compact hatchback. It’s available with two battery sizes and its starting price is among the lowest in Europe.   Gallery: Maxus eDeliver 3              10 Photos                                                                                                       Maxus eDeliver 3 (also known as the Maxus LDV EV30)  Price: from €45,208 ($49,500) in Germany Range: up to 238 (147 miles) WLTP Battery: 50 kWh  Maxus is owned and operated by SAIC Motor, which is China’s largest state-owned carmaker. The same company also owns the formerly British marque MG and during the 1980s it played a key role in Volkswagen’s entrance into the Chinese market by forming a joint venture with the German brand. The eDeliver 3 is an all-electric two-seat commercial van that can carry up to 860 kilograms (1,895 pounds). It’s aimed at people and companies who need to haul stuff inside large cities. It’s powered by a front-mounted 118-kW (158 hp) electric motor and its 50-kWh battery pack can be recharged from 5 to 80% in 45 minutes when hooked up to a DC fast charger.   Gallery: Maxus eDeliver 9              16 Photos                                                                                                Maxus eDeliver 9  Price: from €76,743 ($83,900) in Germany Range: up to 328 km (203 miles) WLTP Battery: 72 kWh or 89 kWh  The larger eDeliver 9 is a competitor for the Ford E-Transit and can haul up to 1,275 kg (2,810 lbs) in the rear cargo area. It seats three, it has Apple CarPlay and Android Auto connectivity, and its front electric motor makes 150 kW (201 hp).   Gallery: Maxus T90 EV              3 Photos                                            Maxus T90 EV  Price: from €65,438 ($71,500) in Germany Range: 330 km (205 miles) WLTP Battery: 89 kWh  The T90 EV is the only mid-size electric pickup on the European market today. The Ford F-150 Lightning, which is larger, is available only in Norway, while the smaller Ford Ranger, Isuzu D-Max, Mitsubishi L200, and Toyota Hilux don’t offer an electric powertrain on the Old Continent. The Maxus T90 EV is powered by a single, rear-mounted 130-kW (174-hp) electric motor, meaning that it’s not four-wheel drive like its combustion-powered competitors. It’s also quite expensive.   Gallery: Maxus Euniq 6              4 Photos                                                         Maxus Euniq 6  Price: from €53,490 ($58,500) in Germany Range: 354 km (219 miles) WLTP Battery: 70 kWh  Maxus also makes more refined passenger vehicles like the Euniq 6 midsize crossover, which is powered by the same 130-kW motor as the T90 EV pickup, only this time it’s powering the front wheels. The Euniq comes with adaptive cruise control, a 12.3-inch digital instrument cluster, and a 10.4-inch touchscreen for the infotainment system.   Gallery: Maxus Mifa 9              3 Photos                                            Maxus Mifa 9  Price: from €68,990 ($75,450) in Germany Range: 440 km (273 miles) WLTP Battery: 90 kWh  The Mifa 9 is touted as being the world’s first luxury large minivan, going into production in 2021. We don’t know if that’s true, but we know that the Mifa 9 comes with a 90-kWh ternary lithium-ion battery pack that enables a WLTP-rated range of 440 km (273 miles) on a full charge. The front-mounted electric motor is good for 180 kW (241 hp), and there’s a CCS port that enables the electric minivan to recharge from 30 to 80% in 30 minutes.   Gallery: Zeekr 001              19 Photos                                                                                                Zeekr 001  Price: from €59,490 ($64,950) in the Netherlands Range: up to 620 km (385 miles) WLTP Battery: 100 kWh  Zeekr, which is owned by Geely, the same company that also owns Volvo and Polestar, sells its cars in several markets around the world, including Europe. The Zeekr 001 is the company’s first model. It’s a shooting brake packing a 100-kWh battery pack that enables a WLTP-rated range of 620 km (385 miles), while the 0-62 mph (0-100 kph) time is rated at 3.8 seconds.   Gallery: Zeekr X              10 Photos                                                                                                Zeekr X  Price: from €42,490 ($46,400) in the Netherlands Range: up to 445 km (276 miles) WLTP Battery: 69 kWh  The X is the smallest model in Zeekr’s lineup, and you can think of it as a reskinned Volvo EX30 (we’ll get to Volvo later). However, the X is roughly $10,000 more expensive than the EX30, which is hard to digest for a brand name that was nonexistent five years ago.   Gallery: Voyah Free EV              4 Photos                                                             Dongfeng Voyah Free  Price: from CHF 69,990 ($79,500) in Switzerland Range: 500 km (310 miles) WLTP Battery: 106.7 kWh  Dongfeng is another Chinese state-owned company and Voyah is its luxury brand. The Free is a mid-size crossover that was designed by Italdesign Giugiaro and packs a dual-motor powertrain that has an output of 360 kW (482 hp).   Gallery: Hongqi E-HS9              8 Photos                                                                                                       Hongqi E-HS9  Price: from 699,900 Norwegian kronen ($66,600) in Norway Range: up to 515 km (320) WLTP Battery: 99 kWh or 120 kWh  Hongqi, which means Red Flag, is China’s oldest automobile manufacturer. It’s owned by FAW Group, one of the country’s state-owned entities, and it’s known for producing high-end vehicles used to ferry around high-ranking officials. The E-HS9 is the brand’s first all-electric SUV. Released in 2020, it’s available with a dual-motor, all-wheel drive setup that makes up to 405 kW (543 hp), while the interior can be specced in either six- or seven-seat configurations.   Gallery: Human Horizons HiPhi X              18 Photos                                                                                                      HiPhi X  Price: from €109,000 ($119,000) in Germany Range: 460 km (285 miles) WLTP Battery: 97 kWh  Since its creation in 2019, Human Horizons’ premium EV brand managed to outsell names like Mercedes-Benz, Porsche, and Audi. Most of the heavy lifting was done by HiPhi’s first model the X, which is a futuristic-looking full-size crossover with 285 miles of WLTP range. It should be noted that as of this writing, Human Horizons is in a bit of trouble, having suspended operations amid financial struggles. It may revive at some point with new investment or a takeover from another Chinese automaker.    Gallery: Human Horizons HiPhi Z              10 Photos                                                                                                HiPhi Z  Price: from €105,000 ($114,600) in Germany Range: up to 555 km (344 miles) WLTP Battery: 120 kWh  The Z came after the X in HiPhi’s lineup as a four-door electric sedan with Nissan GT-R looks and suicide doors at the rear. It also has more range than its crossover sibling thanks to a larger, 120-kWh battery pack. That said, all this futurism comes at a pretty hefty price of over $110,000.   Gallery: Seres 3              9 Photos                                                                                                Seres 3  Price: from €37,995 ($41,400) in the Netherlands Range: 329 km (204 miles) WLTP Battery: 53 kWh  Seres is owned by Seres Group, a Chinese company established in the late 1980s. The Seres 3 subcompact crossover is one of its first products and it's sold on the Old Continent with a front-mounted 120-kW (160-hp) electric motor that draws juice from a 53-kWh ternary lithium-ion battery. It can fast charge at up to 120 kW.   Gallery: Seres 5 Test Drive              79 Photos                                                                                                Seres 5  Price: from €46,850 ($51,100) in Spain Range: up to 500 km (310 miles) WLTP Battery: 80 kWh  The larger Seres 5 is roughly the same size as the Tesla Model Y, but its starting price is almost €4,000 ($4,400) higher than that of the American crossover. That said, the most affordable Tesla Model Y offers less range. But that’s not all The nearly three dozen EVs you just read about are just part of the story because there are at least 10 more battery-powered cars that are made in China bearing brand names that were once European. It’s also worth noting that these are just the tip of the iceberg–there are many more EVs on sale on the Chinese domestic market that haven’t made their way West yet. MG, which once made light sports cars and convertibles, is now owned by SAIC Motor and makes no less than three EVs in China. Polestar and Volvo, both of which are based in Sweden, are owned by Geely and between them manufacture five EVs in China. Lotus, which is also owned by Geely, sells two Chinese-made luxurious and sporty EVs in Europe (and other parts of the world). Furthermore, the diminutive Dacia Spring, which is one of the cheapest EVs on the Old Continent, is also made in China. Renault, which owns Dacia, has a joint venture with Nissan and Dongfeng, the latter of which has been building an electric version of the Indian- and Brazilian-spec Renault Kwid in China since 2019.             2025 Volvo EX30 Twin Motor Performance              Polestar 3              Dacia Spring (2024)              2024 Lotus Eletre S              2024 MG MG4 XPower   Some of these names will come and go and people will forget them in a couple of years. But others are sure to become more and more powerful in Europe and everywhere else thanks to their immense manufacturing capacity, technological prowess, and ability to price their models so competitively that prompted heavy-weight domestic companies to scramble and make something, anything that can compete with the barrage of cheap Chinese EVs.  Some people want luxury and the luxury experience that’s engulfed in a brand like Porsche, but other people can’t afford a Porsche and only need something that’s cheap to buy, cheap to run, and only offers a sense of luxury. Updated on March 18, 2024: Added models from Seres and tweaked the text to reflect the instability at Aiways and HiPhi. "
    },
    "https://insideevs.com/news/712459/plugin-car-sales-germany-february2024/": {
        "pubdate": "Fri, 15 Mar 2024 15:30:39 +0000",
        "title": "Plug-In Car Sales In Germany Weakened Again In February 2024",
        "domain": "insideevs.com",
        "image_url": "https://cdn.motor1.com/images/mgl/VzneQl/s3/tesla-model-y-midnight-cherry-red-europe.jpg",
        "content": " In February, new passenger car registrations in Germany amounted to 217,388, up 5.4% year-over-year. During the first two months of the year, the number of registrations exceeded 430,000 (up almost 12%). Unfortunately, the progress on the plug-in electric car front is mixed, as all-electric car sales were down slightly and only plug-in hybrids noted some growth.  Get Fully Charged  German plug-in car market  Germany is Europe's largest car market and plug-in electric cars are no exception. In 2023, almost 700,000 new plug-in cars were registered in Germany, including over 524,000 all-electric.    In February, the total new plug-in electric car registrations amounted to 42,054, down 5% year-over-year. The market share decreased to 19.3%, compared to 21.5% a year ago. Nonetheless, the situation is not that bad, considering that in previous periods, the segment was supported by generous incentives. Battery-electric car registrations decreased by 15% year-over-year to 27,479, taking 12.6% of the market (compared to 15.7% a year ago and 14.1% two years ago). Plug-in hybrid car sales continued to rebound for the second consecutive month. The number of new registrations amounted to 14,575 (up 22% year-over-year). Plug-in car registrations last month (YOY change):  BEVs: 27,479 (down 15%) and 12.6% market share PHEVs: 14,575 (up 22%) and 6.7% market share Total: 42,054 (down 5%) and 19.3% market share  Plug-in electric car registrations in Germany – February 2024      So far this year, new passenger plug-in electric car registrations amounted to roughly 79,000 (up 11%), which is about 18% of the total volume. Plug-in car registrations year-to-date (YOY change):  BEVs: 49,953 (down 1%) and 11.6% market share PHEVs: 28,969 (up 39%) and 6.7% market share Total: 78,922 (up 11%) and 18.3% market share  For reference, in 2023, 699,943 new passenger plug-in electric cars were registered in Germany, which was close to 25% of the total volume.      Top brands One of the most spectacular findings is that Tesla achieved the highest number of plug-in car registrations in Germany last month, despite selling only all-electric cars. The company noted 6,038 units (down 22% year-over-year). Mercedes-Benz was second best with 5,654 new plug-in registrations, but only 2,238 all-electric cars. BMW was third with 3,994 units (2,478 all-electric). Meanwhile, Volkswagen was third with 2,916 units (2,553 all-electric). Plug-in car registrations by brands (at least 1,000) last month:  Tesla: 6,038 BEVs Mercedes-Benz: 5,654 - 2,239 BEVs and 3,415 PHEVs BMW: 3,994 - 2,478 BEVs and 1,516 PHEVs Volkswagen: 2,916 - 2,553 BEVs and 363 PHEVs Volvo: 2,914 - 1,247 BEVs and 1,667 PHEVs Audi: 2,640 - 1,570 BEVs and 1,070 PHEVs Seat: 2,232 - 973 BEVs and 1,259 PHEVs MG Roewe: 1,782 - 1,781 BEVs and 1 PHEV Hyundai: 1,544 - 1,260 BEVs and 284 PHEVs Porsche: 1,538 - 212 BEVs and 1,326 PHEVs Kia: 1,401 - 1,006 BEVs and 395 PHEVs Skoda: 1,390 - 1,260 BEVs and 130 PHEVs Ford: 1,246 - 179 BEVs and 1,067 PHEVs smart: 1,205 BEVs Opel: 1,023 - 448 BEVs and 575 PHEVs  After the first two months of the year, Mercedes-Benz remains at the top for plug-ins, but there is no match for Tesla in the all-electric car segment. Tesla is the number one with 9,190 units sold, even though its volume decreased 23% year-over-year. Plug-in car registrations by brands year-to-date (at least 2,000):  Mercedes-Benz: 11,712 - 4,597 BEVs and 7,115 PHEVs Tesla: 9,190 BEVs BMW: 7,918 - 4,721 BEVs and 3,197 PHEVs Audi: 6,158 - 3,877 BEVs and 2,281 PHEVs Volkswagen: 5,092 - 4,288 BEVs and 804 PHEVs Volvo: 4,800 - 2,108 BEVs and 2,692 PHEVs Seat: 3,469 - 1,171 BEVs and 2,298 PHEVs Skoda: 2,998 - 2,717 BEVs and 281 PHEVs Hyundai: 2,797 - 2,158 BEVs and 639 PHEVs Porsche: 2,637 - 560 BEVs and 2,077 PHEVs Kia: 2,576 - 1,753 BEVs and 823 PHEVs Ford: 2,457 - 284 BEVs and 2,173 PHEVs Opel: 2,409 - 1,002 BEVs and 1407 PHEVs smart: 2,385 BEVs MG Roewe: 2,299 - 2,297 BEVs and 2 PHEVs  Top BEV models The Tesla Model Y remains the best-selling all-electric car model in Germany, with 7,801 new registrations year-to-date, far exceeding other EVs.  Next, we can see two MEB-based models from the Volkswagen Group: Skoda Enyaq iV (2,717 units) and the Audi Q4 e-tron (2,313). The Volkswagen ID.4/ID.5 (1,978) is noticeably behind, and its volume is almost 45% lower than a year ago at this point. Top all-electric models year-to-date in 2024 (YOY change):  Tesla Model Y - 7,801 (down 23%) Skoda Enyaq iV - 2,717 (up 78%) Audi Q4 e-tron - 2,313 (up 18%)    Get the InsideEvs Newsletter Sign Up Today    See also           Ford U.S. EV Sales Surged 81% In February 2024           BYD Global Plug-In Car Sales Dropped 36% In February 2024    "
    }
}