[
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/18/worlds-largest-solar-panel-maker-to-slash-thousands-of-jobs/",
        "date": " Mar 18 2024 - 12:19 pm PT\t\t\t\t\t\t\t\t\t\t",
        "title": "World’s largest solar panel maker to slash thousands of jobs",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2022/05/pexels-photo-8853502.jpeg?quality=82&strip=all&w=1497",
        "content": "\n\n \n\t\t\t\tPhoto by Los Muertos Crew on Pexels.com \n\nChina’s LONGi Group is laying off up to 30% of its workers to accelerate cost-cutting, according to Bloomberg.\n\nStaff reduction at LONGi Group started in November 2023, and this is an acceleration of layoffs, according to sources who had been briefed by senior management but asked not to be identified by Bloomberg.\nLONGi’s staff numbers peaked at around 80,000 in 2023.\nHowever, the Xi’an-based solar panel maker disputed the 30% figure and said job reductions would amount to around 5% of its workforce. (That’s still thousands of jobs.) \nThe company released a statement that said, due to fierce competition, “In order to adapt to market changes and improve organizational efficiency, Longi is optimizing our workforce.”\nChina leads global solar manufacturing by far, and a glut of solar panels has meant that solar panel prices plummeted last year, so solar panel makers have had to sell at or below production costs. Cheap Chinese solar panels are also making it hard for European and US solar panel makers to compete.\nIn response, solar companies are consolidating, and bankruptcies may be on the horizon. However, Bloomberg writes:\n\nDespite the recent challenges, China’s solar industry could start to see a rebound byyear-end, with margins rising in 2025 based on a “quickening pace of consolidation” anda better balance between supply and demand, according to an analysis by BloombergIntelligence.\n\nMeanwhile, cheap solar panels are driving demand, and new installations are booming globally. The US added a record-setting 32.4 gigawatts (GW) of solar capacity in 2023.\nRead more: US smashes solar records in 2023 – but 2024 will bring road bumps\n\nTo limit power outages and make your home more resilient, consider going solar with a battery storage system. In order to find a trusted, reliable solar installer near you that offers competitive pricing, check out EnergySage, a free service that makes it easy for you to go solar. They have hundreds of pre-vetted solar installers competing for your business, ensuring you get high quality solutions and save 20-30% compared to going it alone. Plus, it’s free to use and you won’t get sales calls until you select an installer and you share your phone number with them.\nYour personalized solar quotes are easy to compare online and you’ll get access to unbiased Energy Advisers to help you every step of the way. Get started here. – ad*\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/18/audi-unveils-q6-e-tron-a-new-standard-for-next-gen-premium-evs/",
        "date": " Mar 18 2024 - 11:00 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Audi unveils Q6 e-tron: a new standard for next-gen premium EVs",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/Audi-Q6-e-tron-quattro-hero-e1710776288200.png?w=1600",
        "content": "\n\n\nToday, Audi is unveiling the Q6 e-tron, a next-gen electric vehicle based on the new PPE platform co-developed by Audi and Porsche.\nIt is going to compete in the highly popular midsize SUV segment, and when it comes to specs and design, I think the German brand has a winner. But pricing is not available yet.\n\nDisclosure: Audi paid for my flights to and from Munich, and my hotel stay so that I could get a “sneak preview” of the Q6 e-tron. The company had no say in our reporting, nor did it ask to. \nLast week, Audi brought a bunch of auto journalists and myself to Munich to get briefed on the PPE platform, a new EV platform co-developed by Audi in Porsche, and get a first look at the German brand’s first vehicle built on it: the Q6 etron.\nElectrek already checked out the Porsche Macan EV, the other PPE-based vehicle coming to market this year, but we are excited to see Audi’s own take on it.\nWhile several legacy automakers are pulling back on their electrification plans, I made sure to poke around last week and gauge the German company’s own level of commitment to its electrification effort. I was pleased to hear that Audi is still committed to stopping launching new internal combustion engine vehicles by 2027 and going all-electric by 2033.\nThe launch of the Q6 e-tron makes this much more realistic as it not only comes based on a next-gen EV platform bringing a lot of improvements compared to Audi’s other EV platforms, but it also completes its SUV EV lineup with the Q4 e-tron and Q8 e-tron.\n\n\n\nAudi Q6 e-tron’s new PPE platform tech\nMy main complaint about Audi’s electric vehicles was their efficiency. There were a few reasons for that. The automaker was, and still is to a lesser degree, fairly conservative with a big buffer on its battery packs.\nOf course, Audi also makes premium SUVs packed with features, which makes it quite a challenge to achieve a high level of efficiency.\nBut with the PPE, Audi is benefiting from a much more efficient electric powertrain that helps make the Q6 e-tron much more efficient than previous generations.\nAt the battery level, PPE includes improvements at every stage, from the cells to the pack:\n\nAudi is now using much more energy-dense CATL NMC cells in a prismatic form factor. It also increased the size of its modules with 15 cells per module and 12 modules per pack.\nAt the pack level, Audi’s PPE pack is more efficient in design with a new thermal management system.\nFor the Q6, the battery pack has a total capacity of 100 kWh and a useful capacity of 94.9 kWh:\n\nThe European market will get a version with the two middle modules removed for a total capacity of 83 kWh, but like with its other electric SUVs, Audi doesn’t believe that it’s worth bringing vehicles with shorter ranges to market in the US.\nAt the drive unit level, Audi has also made some major improvements with the PPE platform both on the power and torque density and with efficiency:\n\nThis was achieved through a bunch of improvements to advanced cooling and lubrification systems, amongst other things.\nWith the Q6, Audi is using an asynchronous motor on the front axel and a permanent magnet motor on the rear.\nAudi has also improved battery preconditioning,w which now has an even greater impact on charge time: \n\nThe automaker already had a great charging curve, but it now says that the new battery pre-conditioning can shave off 18 minutes of charging in cold temperatures.\nSpeaking of cold temperatures, the Q6 is equipped with a new heat pump integrated with the powertrain thermal management system:\n\nHeat pumps are a great way to minimize the impact of climate control on range. They are generally seen as particularly useful in colder climates, but Audi has shared some interesting data about their impact.\nThe automaker claims that the new heat pump in the Q6 e-tron can increase the range by 30 km (~19 miles) between -10°C to 20°C (14°F to 68°F):\n\nBeyond all these efficiency and performance improvements, the PPE also brings scalability and cost improvements.\nAudi Q6 e-tron Design\nThe Q6 is a midsize SUV coming to complete the electrification of Audi’s SUV lineup. It sits between the smaller Q4 and bigger Q8, while being the electric counterpart to the popular Q5. \nThe brand is doing something where the even numbers are electric and odd numbers ICE.\nThe Audi Q6 e‑tron has a length of 4,771 millimeters (15.6 ft), a width of 1,993 millimeters (6.5 ft) and a height of 1,648 millimeters (5.4 ft) – making it just a smidge bigger than the popular Tesla Model Y.\n\nThe vehicle has an extremely long wheelbase with short overhands and a high front-end – giving it an aggressive-looking stance despite some mostly soft lines on the sides.\nIt has a well-executed fake grille.\nFrom the back, you can see the more classic Audi look:\n\nYou have 10 different wheel design options for the Q6 from 19″ to 21″.\nThe back also features the new second-generation digital Audi OLED lights. There are some really cool things Audi can do with those, but unfortunately, some of the functionalities, specifically everything with motion, won’t be available in the US due to regulations.\nYou will still be able to configure some static ‘light signatures’, which is pretty cool.\n\n \n\nThe front trunk or frunk is nothing huge, but it’s big enough to hold a small piece of luggage or your mobile charger. \nIt holds 64 liters (2.2 cu ft) of storage space.\nThe trunk is much more spacious at 526 liters (18.5 cu ft) of storage space with the backseat up. If you fold them down, the storage space increases to up to 1,529 liters (53.9 cu ft).\n\nMoving to the interior, you will find a variety of interesting materials. I was particularly impressed by the version that I saw at the sneak preview, which had some cool cloth and mesh materials, but we were unfortunately told that some wouldn’t make it to the North American version of the car.\nNonetheless, the interior is solid with a large back seat that can comfortably seat people much taller than 6 ft.\n\nYou have a center console that folds in the middle and two USB C plugs underneath the rear climate controls.\nBut the cockpit is where the fun is at. The star of the show is a new curve display that actually consists of two screens: an instrument cluster in front of the driver and a touchscreen at the center of the dash:\n\nThere’s also an optional passenger display that has a privacy mode limiting the field of view so that the content is not visible to the driver. It enables the passenger to safely play videos on the screen while the car is moving.\nAs if that’s not enough, there’s also an optional heads-up display for the driver. It’s one of the best I’ve seen so far. It’s bright and covers a very large area that interacts with its environment, like integrating navigation.\nNow, all of these screens are powered by new software built on the Android Automotive operating system. It’s smoother, allows easier and more in-depth software updates, and allows better and faster integration of third-party apps.\nThis should be a big step up in user experience inside the vehicle.\nAudi Q6 e-tron Specs\nDuring the sneak preview, we mainly saw the European versions of the Q6 and their specs, but Audi  America has released some official specs and estimates.\nFor example, the North American market is actually getting more powerful motors on the Q6 e-tron.\nHere’s what Audi is releasing so far in terms of specs for the US market:\nQ6 e-tron quattroSQ6 e-tronHorsepower315 kW (422 hp) nominal- 340 kW (456 hp) launch control360 kW (483 hp) nominal – 380 kW (510 hp) launch control0-60 mph AccelerationEst. 5.0 secs. with launch controlEst. 4.2 secs. with launch controlTop Speed210 km/h (130 mph)230 km/h (143 mph)RangeThe standard Q6 60 e-tron quattro achieves over 300 miles of range on the EPA test cycle based on preliminary manufacturer estimates.To be announced later this year.ChargingDC Fast Charging: 270 kW HPC @ 800 volts, capable of 10-80% SOC in 21 mins.AC Charging: 9.6kW (240V/40A)DC Fast Charging: 270 kW HPC @ 800 volts, capable of 10-80% SOC in 21 mins.AC Charging: 9.6kW (240V/40A)LightingDue to U.S. regulations, certain lighting functionalities are not available. More information will follow later this year.Due to U.S. regulations, certain lighting functionalities are not available. More information will follow later this year.\nWhen it comes to the range, Audi is only confirming “over 300 miles) on the EPA test cycle, but I wouldn’t be surprised if it gets much more than that as it is getting 625 km (388 miles) on the WLTP standard.\nAudi has always had a strong charging curve in its electric vehicles, and the Q6 e-tron with the PPE platform is no exception.\nIt’s capable of charging at 270 kW on a 800-volt system and 135 kW on bank charging on 400-volt.\nBut the really impressive thing is how the powertrain is able to keep the high charge rate at a high state of charge. Here’s the full charge curve:\n\nThe Q6 e-tron also has a strong 220 kW regenerative braking, and to our enjoyment, Audi is bringing a true one-pedal driving experience to the Q6 e-tron. You can choose between 4 different levels of regen braking with the top one allowing for one-pedal driving and a complete stop. \nThe electric SUV also comes with adaptive cruise control powered by a front camera, radar, and ultrasonic radars.\nExact pricing and availability have not been released just yet, but it is coming to Europe in the next few months and in North America toward the end of the year.\nAs for pricing, Audi has limited its communication to “between the Q4 and Q8,” which starts at $50,995 and $73,700, respectively.\nNo NACS for the Audi Q6 e-tron\nThis is a real bummer, but it’s not too bad, considering it might be the only real objective downside to this new entry from the German brand. Everything else is either great or subjective.\nYou also can’t really blame Audi, as it is more of a timing issue than anything. The automaker has announced plans to adopt NACS in North America, but the Q6 is coming a bit too soon for integration, which will come to new vehicles coming in 2025.\nOwners are going to have to use an adapter to access the Supercharger network.\nOn the bright side, the Q6 e-tron has a great charging curve and also two charge ports. The DC-capable driver-side charge port is well located for the Supercharger network, and the passenger charge port is great for street charging.\nElectrek’s Take\nIf you can’t tell yet, I really like this SUV. I only drove it for a few minutes, and it was a nice fully-loaded SQ6 with air suspension, so my driving impressions aren’t worth that much, but I enjoyed it quite a bit.\nAudi is selling about 75,000 Q5 SUVs a year in the US now, and it expects the Q6 to take over that market as it transitions entirely to EVs over the next 10 years.\nThat’s a big and scary transition for a legacy automaker, but I think the Q6 e-tron should give them confidence going into it. Based on everything I’ve seen so far, it is highly competitive on the higher end of this segment. Emphasis on higher end. This is very much a premium and highly customizable vehicle.\nThe PPE platform looks like a solid base on which Audi built an interesting design packed with high-tech features, from the lighting to the HUD to the Android-based OS.\nObviously, Model Y comparisons are going to come since it’s now the world’s best-selling vehicle, and it also competes in the midsize SUV segment. During its own sneak preview in Germany last week, Audi itself identified the Model Y as a competitor.\nThat said, I don’t expect it to compete price-wise, especially in the US, since Audi doesn’t have access to the tax credit as it doesn’t have a US factory. If it does compete with the Model Y, it will mainly shave some demand off the top from customers looking for a more premium experience.\nThe Q6 e-tron will likely start at closer to ~$60,000, and you will be able to add options probably close to $80,000.\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/18/velotric-t1-st-e-bike-wallbox-level-2-ev-charger-and-more/",
        "date": " Mar 18 2024 - 10:52 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Save $400 on Velotric T1 ST e-bike at $1,099, level 2 Tesla/EV charger starts from $449, more",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/Velotric-T1-ST-e-bike.webp?w=1200",
        "content": "\n\n\nKicking off this week’s green deals is the addition of the Velotric T1 ST e-bike to the company’s spring sale at a return $1,099 low. It is joined by the Wallbox Pulsar Plus Level 2 EV Charger that starts from its $449 low, as well as a one-day discount on the Greenworks 80V 16-inch String Trimmer and Axial Blower Combo for $270, the lowest price we’ve seen since 2022. Plus, all of the other best new Green Deals landing this week.\nHead below for other New Green Deals we’ve found today and, of course, Electrek’s best EV buying and leasing deals. Also, check out the new Electrek Tesla Shop for the best deals on Tesla accessories.\n\nVelotric adds T1 ST e-bike to spring sale at $1,099 low\nVelotric’s spring into March sale is in full swing, taking up to $500 off of a selection of its e-bikes, with bundle options available for some models as well. A new addition to the offerings is the T1 ST e-bike for $1,099 shipped. Normally going for $1,499, this e-bike sees regular discounts during sales events, with today’s price having last been seen during Black Friday sales. It comes in as a 27% markdown off the going rate and lands as a return to the all-time low.\nThe sleek T1 ST e-bike comes in two colorways (sand and lava) equipped with a 350W (600W peak) motor and a removable 36V battery that propels the e-bike up to 20 MPH (25 MPH when unlocked) for up to 52 miles on a single four to six-hour charge. It offers a variety of features like the 5-level pedal assist with a torque sensor, a SHIMANO 8-speed drivetrain, an integrated LED auto-headlight, double hydraulic disc brakes, puncture-resistant tires, an IPX6 waterproof rating, a 3.5-inch LCD display with USB charging for your personal device, and it even has a walk mode to assist you when walking up a steep hill alongside Apple Find My capabilities.\nWallbox Pulsar Plus Level 2 EV Charger starts from $449 low\nBest Buy is offering the Wallbox Pulsar Plus Level 2 EV Charger with NEMA 14-50 plug for $599 shipped. Down from its usual $649, we’ve seen this model go for far lower during 2023, with the biggest discount dropping costs to a $500 low – some third-party retailers have offered it for less during occasional short-lived sales events. Where this deal gets even better, though, is with a My Best Buy Plus membership that takes off another $150 from the price tag, dropping it to a new all-time low. The membership only costs you $50 a year, and not only does that give you $100 more in savings on this charger, but it extends the extra savings across a wide array of appliances, devices, and more.\nThis EV charger provides up to 40A of power that automatically adjusts its output to not only the connected EV’s accepted levels, but also balances it along with your households’ energy consumption for “up to 7x faster charging.” You can monitor, schedule, and adjust the power levels between 16A and 40A through the companion app, which also provides your energy usage and spending statistics as well, making this device a flexible solution for installations on electrical circuits of 50A. You can also go hands-free by connecting it to your Alexa or Google Assistant. Its NEMA 14-50 plug ensures compatibility with most EVs on the market, including Teslas, just be sure to confirm if it will work with your make and model before purchasing. You’ll also have the option of connecting this charger to your home’s solar energy systems to further save on electricity costs. Head below to learn more.\nGreenworks 80V 16-inch String Trimmer and Axial Blower Combo now $270 for one-day discount\nBest Buy is offering the Greenworks 80V 16-inch String Trimmer and Axial Blower Combo for $269.99 shipped through the rest of the day. Down from $370, this particular combo package saw several discounts over 2023, with June through August seeing the biggest discounts to $269 and $266. While today’s deal is not the overall lowest we’ve seen, it does come in as a 27% markdown off the going rate and lands at the third-lowest price of the last year – ultimately $47 above the all-time low from 2020. It even beats out Greenworks’ website, where a similar combo is listed for a higher $400 MSRP.\nThe string trimmer is equipped with a brushless motor and a 2.5Ah battery that gives it a 45-minute lifespan on a single 30-minute charge – ideal for 1/2-acre to 3/4-acre yards. It has a 16-inch cutting swath with variable speed control for easier handling and a Load N’ Go trimmer head for easier spool rewinds. The axial blower covers yards up to 1 acre without concern, reaching a max airflow speed of 170 MPH and 730 CFM, and also sports a variable speed control with a turbo setting for max output. The included battery gives this blower a 70-minute runtime when on its lowest setting. Head below to read more.\nSpring e-bike deals!\n\nSuper73 RX Electric Motorbike: $2,999 (Reg. $3695)\nLynx All-Terrain e-bike: $2,999 (Reg. $3,999)\nJuiced’s HyperScrambler 2: $1,999 (Reg. $3,499)\nAventon Aventure.2 All-Terrain e-bike with free extra battery: $1,799 ($2,499 value)\nAventon Abound Cargo e-bike with $372 in free accessories: $1,799 (Reg. $2,199)\nLectric XPedition Cargo Dual-battery e-bike with $405 in free accessories: $1,789 (Reg. $2,104\nLectric XPedition Cargo e-bike with $405 in free accessories: $1,475 (Reg. $1,804)\nHeybike Brawn Fat-Tire e-bike: $1,449 (Reg. $1,800)\nHover-1 Altai Pro R500 e-bike: $1,221 (Reg. $2,300)\nElectric Bike Co. Model J e-bike: $1,299 (Reg. $1,499)\nVelotric Go 1 Utility e-bike: $1,299 (Reg. $1,799)\nTrek Electra Cruiser Go! Step-Over e-bike: $1,200 (Reg. $1,600)\nVelotric Discover 1 e-bike: $1,099 (Reg. $1,599)\nAventon Pace 500.2 e-bike: $999 (Reg. $1,599)\nOKAI Stride Electric Bike: $930 (Reg. $1,600)\nHeybike Mars Foldable e-bike: $799 (Reg. $1,200)\n\n\nOther new Green Deals landing this week\nThe savings this week are also continuing to a collection of other markdowns. To the same tune as the offers above, these all help you take a more energy-conscious approach to your routine. Winter means you can lock in even better off-season price cuts on electric tools for the lawn while saving on EVs and tons of other gear.\n\nEcoSmart’s ECO 36 240V electric tankless water heater keeps temps high at new $399 low\nSave $1,000 on Greenworks 80V 42-inch CrossoverZ electric riding lawn mower for $4,500\nAventon adds Sinch.2 e-bike to flash sale with free extra battery for $1,499 ($1,999 value)\nLectric’s new ONE e-bike sees $220 launch discount with $220 in added free gear\nALLPOWERS power stations, bundles, and accessories up to 45% off starting from $89\nJackery’s spring sale takes up to $1,500 off power stations and bundles starting from $100\nAnker’s new SOLIX C800 Plus 768Wh power station sees launch discount to $499 (Reg. $649)\nPanasonic eneloop pro power pack includes 10 rechargeable batteries for $53\nSave up to $2,399 on EcoFlow power stations, solar panels, more during 13-day spring sale\nGreenworks’ 1900 PSI electric pressure washer covers spring cleaning from $110 (Reg. $220)\nBundle Juiced’s new 52V G2 battery with a discounted e-bike starting at $1,649 ($2,199+ value)\nGet up to $892 in savings on Blix e-bikes with free accessory bundles starting from $1,499\nElectric Bike Co.’s Model A e-bike offers 60-mile range with free anti-theft alarm at $1,499 (Save $329)\n\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/18/canoo-goev-stock-soars-okc-ev-facility-key-approval/",
        "date": " Mar 18 2024 - 10:48 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Canoo (GOEV) stock surges after OKC EV facility gets key approval",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/Canoo-GOEV-EV-facility.jpg?quality=82&strip=all&w=1600",
        "content": "\n\n\nShares of American EV startup Canoo (GOEV) are surging after its Oklahoma City facility received approval as a Foreign Trade Zone (FTZ). The approval will help improve Canoo improve profitability as it scales production.\n \n\n\nCanoo (GOEV) gets FTZ status for its OKC EV facility\nAfter throwing a lifeline to keep its shares listed on the NASDAQ with a reverse stock split earlier this month, Canoo’s (GOEV) stock is surging following the approval at its OKC EV facility. \nCanoo announced on Monday that the US Department of Commerce approved the plant as an FTZ, sparking the rally. The approval will help accelerate Canoo’s Made in America EV strategy, improve unit profitability, and “enable a faster path to breakeven.” \nThe plant currently employs around 100 workers but is expected to support up to 1,100 at full capacity.\nBy securing an FTZ designation, Canoo eliminates all customs duties on vehicles sold overseas and defers of customs duties on imported parts for EVs sold in the US.\nCanoo sources over 90% of its parts in the US and free trade partners, with about 70% from North America.\nFirst Canoo EVs delivered to NASA (Source: Canoo)\nImproving profitability\nAccording to Canoo, the FTZ will “significantly enhance profitability” by lowering vehicle costs by up to 5% on parts imported from other parts of the globe. The cost reductions will be on EVs made in the US and exported overseas, which Canoo intends to announce “in the near future.” \nFor vehicles sold in the US, FTZ improves working capital “by millions” by derring customs, duties, and tariffs on imports.\nCanoo electric LDV 190 (Source: Canoo)\nCanoo expects additional cost savings through a simplified customs process and streamlined supply chain. \nThe EV maker is waiting for approval at its other manufacturing plans. If approved, Canoo FTZs will be one of the largest in Oklahoma.\nCanoo (GOEV) stock chart over the past year (Source: TradingView)\nFollowing the news, Canoo’s (GOEV) stock is up over 50% (+1.06 per share). After hitting an all-time low earlier this month, Canoo shares are bouncing. However, they are still down nearly 80% over the past year. \nElectrek’s Take\nLike other EV startups (or any growth company), a higher stock price makes it easier to raise funds (via debt) and attract new investors. \nDespite the win, Canoo’s finances are still a concern. At the end of September, Canoo had only $8.3 million in cash and equivalents.\nThe EV maker lost $273.6 million through the first nine months of 2023. Although losses slimmed in Q3, Canoo still lost $112 million.\nCanoo CEO Tony Aquila explained that although “we still have things left to prove,” Canoo is now manufacturing and generating revenue. The EV maker posted $519,000 in revenue on its first EV sales.\nThe EV maker is moving toward hitting 20,000 annual vehicle capacity. Canoo is making progress with the first official customer deliveries of its commercial electric van last month. It also announced that USPS is purchasing six LDV 190 delivery vans as a transition to electric.\nSeveral EV startups like Canoo are struggling amid rising interest rates and more competition entering the market. \nFisker (FSR) announced earlier today that it is pausing production after failing to make an interest payment. The company is halting production for six weeks as it looks to get its finances in order.\nMeanwhile, Canoo is serving a different market in commercial vehicles that could prove to be a lifeline to continue operations. With its “Made in America” approach, Canoo expects to benefit from the IRA’s Commercial Clean Vehicle Credit. With that, Canoo customers are eligible for a tax credit of up to $7,500. \nAs of Q3, Canoo had a +$3 billion order book and $750 million in commited orders (18,000 units).\nWe’ll learn more about Canoo’s financial situation and oulook for the year when it releases Q4 and full year 2023 earnings later this month.\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/18/sodium-ion-batteries-put-to-the-test-in-komatsu-pilot-program/",
        "date": " Mar 18 2024 - 10:23 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Sodium-ion batteries put to the test in Komatsu pilot program",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/komatsu_sodium.jpg?quality=82&strip=all&w=1200",
        "content": "\n\n\nThis electric forklift concept by Japanese equipment giant Komatsu is powered by sodium-ion batteries and promises safer, cheaper operation than the competition.\n\nSodium-ion batteries have been hailed as a possible alternative to more expensive lithium-ion batteries for a while, and have shown enough promise that EV leaders like BYD and Volkswagen-backed JAC have already spent big money developing the technology. Not to be outdone by the on-road guys, Komatsu recently unveiled this concept electric forklift powered by sodium-ion batteries as part of a pilot program to validate the use of sodium batteries with an eye toward series production in the near future.\nFor the uninitiated, sodium batteries are believed to offer a significant cost savings compared to “conventional” li-ion batteries, thanks to the abundance and affordability of sodium-based materials (among other things). Additionally, sodium-ion batteries are believed to be safer than li-ion because their natural properties present a reduced risk of thermal runaway (again, compared to li-ion), potentially making them a better choice for applications that prioritize safety over overall performance or energy density. School buses are one example of an application where safety might trump performance. Material handling is another, and material handling is all about forklifts.\nSodium is perfect for forklifts\nIt’s important to understand that Komatsu isn’t comparing its new sodium concept against lithium ion tech, the way a car manufacturer focused on maximum energy density might. Instead, it’s comparing the idea of a single battery technology instead of its current two. Those being li-ion for extended, heavy-load operations, and old-school lead-acid batteries for the majority of their customers.\nIf Komatsu’s new sodium-ion battery-equipped electric forklift can do almost as much work as the li-ion machines, at a small enough premium to the lead-acid units, then it might make sense to go all-sodium, all-the time, and leverage the economies of scale therein to offer one machine to customers that can do it all.\nThe concept is equipped with a sodium-ion battery pack developed by Shanghai Hirano Environment Technology Co., Ltd., using sodium-ion battery cells manufactured by Jiangsu Highstar Battery Manufacturing Co., Ltd. and is designed to fit Komatsu’s existing 1.5-ton class electric forklifts. The concept machine has already begin jobsite testing.\nElectrek’s Take\nElectric forklifts are the gateway drug of commercial electrification. They’re proven, capable, cost less to own and operate than their internal combustion cousins, and get the job done. Once fleet managers make that connection, the decision to electrify the rest of their equipment assets is already made. If Komatsu can make that decision cheaper while addressing the fleet’s safety concerns (however misguided those concerns may be), they’ll have a winner.\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    }
]