[
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713502/cybertruck-wholesale-pricing-bubble-burst/",
        "image_path": "https://cdn.motor1.com/images/mgl/BXeXgm/s3/cybertruck-31.jpg",
        "date": "Sun, 24 Mar 2024 16:00:08 +0000",
        "new_content": " Love it or loathe it, it’s impossible not to admit that the Cybertruck is an expensive beast that the most trendsetting individuals will go to great lengths to get. Celebrities like Kim Kardashian and Lady Gaga have been seen in them. One football superstar was famously advised not to spend double the MSRP on a used one. Turns out that was likely a wise idea, as multiple reports show that Cybertruck wholesale prices are dropping.  Get Fully Charged  Used Tesla Cybertruck prices are very high  Despite a no-sales clause in early Cybertruck owner contracts, used examples have regularly appeared for sale for sometimes more than double the MSRP. Yet, that doesn't seem to be holding. Values are steadily marching downward.     According to several sources, including Teslarati, Cybertruck prices are falling somewhat fast. As recently as February 29th, Cybertruck auction results made headlines, as one went for as high as $244,000, to an Atlanta-area Porsche dealer that reportedly put it on its lot for $300,000. John Clay Wolfe owner of Give Me The Vin, a vehicle wholesaler, has noticed the drop. Last week, one Cybertruck unit went for $175,000. This week, another Cybertruck unit went for $171,000, a sizable drop from the week before. Some have asserted that Cybertruck prices will eventually collapse, but that’s probably too strong of a term here. These Cybertrucks are still inflated well over MSRP, a top-of-the-line Cybertruck Cyberbeast is in the ballpark of $122,000. It’s silly to say that a vehicle in which its owners are actively circumventing a no-sale or flipping clause and where they’re still getting more than 50% over its true value is a “collapse.” But, it does show that Cybertruck pricing is falling to sane levels fairly quickly. Hopefully, for Cybertruck owners’ sake, this truck won’t be vulnerable to the same abysmal resale values as the rest of Tesla’s lineup.  From this small sample size between late February to mid-March, Cybertruck wholesale prices have dropped from $244,000 to $171,000, a 70% loss. If this trend continues to move downward, Cybertruck wholesale numbers could be at or below MSRP before the summer. Regardless, as Tesla ramps up Cybertruck production and more trucks find their way to roads resale will naturally return to reasonable levels. Just this week, a dual-motor Foundation Series Cybertruck listed on Cars & Bids ended bidding at $158,000 and did not meet its reserve price. Ouch.  If you’re a Cybertruck owner looking to flip for a profit, it might be a wise idea to sell sooner rather than later.  Contact the author: kevin.williams@insideevs.com  More EV News               This Guy Drove His Brand New Tesla Cybertruck 4,500 Miles In One Week           Why The Tesla Cybertruck Isn't The Best EV Truck For Towing           Tesla Slows Down Production At Its Largest EV Factory In China: Report               I Tested A Polestar 3 On A Frozen Lake. It Handles Ice Like A Pro Dancer      "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713571/chevy-bolt-discount-california/",
        "image_path": "https://cdn.motor1.com/images/mgl/vL6GY/s3/2022-nissan-bolt-ev-review-exterior.jpg",
        "date": "Sun, 24 Mar 2024 13:29:52 +0000",
        "new_content": " If you’re in the market for a new electric vehicle in 2024, you finally have a wealth of options across most vehicle categories. Yet more than a decade into this period of rapid EV growth, there are still only a handful of entry-level options available in North America. Not everyone is in the market for the greatest high-tech gadget money can buy. The majority of buyers just want the best overall value for getting from point A to point B. For years, the Chevy Bolt EV and EUV were the standard-bearers for many price-conscious buyers. With pricing that started at $26,500 and $27,800 respectively, very few electric models came anywhere close to matching the Bolt twins’ value propositions.  Get Fully Charged  The Chevy Bolt was a value winner  The affordable Chevy Bolt models were GM's top electric sellers in 2023. But they are based on older technology and were money-losers for the automaker. With its relaunch in 2025, the Bolt will get numerous new EV and safety features.     Notice I said all that in the past tense, as the Bolt models were discontinued in 2023. They are due to be resurrected (in EUV form only) on the updated General Motors Ultium platform in 2025. Until then, a few thousand new Bolts are still for sale nationwide. And their value proposition gets even better for certain residents of the Golden State. As EVLife recently reported, Californians who meet specific income, residency, and vehicle ownership requirements can take advantage of a mix of state and federal incentives to nab a new Bolt EV for as low as $8,000 or an EUV for as low as $9,300.  Following the Inflation Reduction Act of 2022, Chevrolet vehicles once again became eligible for the federal EV tax credit of $7,500. Thanks to the rollout of point-of-sale discounts, this can make the process even easier for buyers since they no longer wait until the next tax season to receive their rebates.   Gallery: 2023 Chevrolet Bolt EV              6 Photos                                                                                   Combining this with California’s Clean Cars 4 All program will earn the greatest benefit. If you have a functioning internal combustion engine vehicle (2005 or older), you can upgrade to a new EV or PHEV and earn up to $9,500. The highest benefit is contingent upon income and residency requirements, so buyers must confirm that they qualify for the program first. California residents can learn more about the program and participating districts via the California Air Resources Board website.  Finally, the Consumer Assistance Program offers vehicle retirement assistance of up to $1,500 for buyers who have an older operational vehicle that qualifies for retirement. Once again, eligibility for the max benefit is dependent on income levels so be sure to research the program to make sure you qualify by visiting the Consumer Assistance Program website. The combined power of these three programs allows some prospective buyers to drive home in a new Bolt EV at one-third of MSRP. Of course, with production having already ended on the current generation of the Bolt, finding the car will become more difficult in the coming months. While a new Ultium-based Bolt is on the way, no timeline has been provided for its release as of yet. The incredibly specific nature of these programs also means that only a select few will qualify for all three.  So if you have been considering a Bolt EV purchase and can take advantage of the combined savings outlined here, now is the best time to pull the trigger. Check out EVLife for more details and buying tips.   More GM EV News           Here’s Your Chance To Own The First GMC Hummer EV Pickup EarthCruiser Camper           Honda Might Team Up With Nissan For Cheap EV After Ditching Plans With GM           How GM Got The Chevy Blazer EV Back On The Road After 16,000 Miles Of Daily Testing           The Chevy Blazer EV Is On Sale Again—With A Big Price Cut           How GM's Ultium Electric Car Revolution Went Off The Rails           A Salute To The Chevrolet Bolt, 2023's Underdog EV Champion    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713549/tesla-model-3-new-old/",
        "image_path": "No image found",
        "date": "Sat, 23 Mar 2024 20:05:57 +0000",
        "new_content": " It’s been nearly seven years since initial deliveries of the Tesla Model 3 began, and the EV industry has matured significantly in the intervening years. Not only has the number of electric options drastically increased, but technological improvements have made most early plug-in models practically obsolete.  This is not the case with the Model 3, however. The 2017 launch of Tesla’s mass-market sedan—and that of the Chevy Bolt EV—ushered in the modern era of affordable long-range EVs. Because of this, anyone in the market for an electric sedan can genuinely cross-shop any early-build Model 3 with the 2024 refresh.   Get Fully Charged  Tesla's Model 3 gets a needed upgrade. Is it enough?  The Model 3 remains an outstanding choice in the EV market, but like much of Tesla's lineup, it's getting old. New improvements may not be enough to stave off competitors from Hyundai, BYD and others.     Often referred to as the “Highland” model, the newest entry boasts a number of refinements to the vehicle styling and ride quality. But are the differences enough to justify the price tag when thousands of earlier Model 3s are now available for under $20,000?  That’s what Thomas and James dive into with their latest Throttle House vehicle comparison. They rented a 2018 Model 3 to see just how it holds up against Tesla’s latest iteration.  The first thing to stand out is the excellent front end facelift. More than just a minor refinement, the newest Model 3 has sharper lines, slimmer headlights, and an overall more appealing design.              The reduction of the vehicle’s often criticized snout might be the most welcome change. This brings the Model 3 more in line with the current Tesla Model S, along with a few design cues reminiscent of the upcoming Tesla Roadster. James describes the overall exterior design improvements as “the frog has become the snake.” When sitting behind the wheel, the most noticeable difference is in the sound dampening. Improved tires and insulation result in far less road noise. The ride itself is also described as being more refined and up-market thanks to the new front suspension geometry. The sound system, adjustable mood lighting, heated and cooled seats, and the rear passenger display are all given very high marks as well. Most importantly, the fingerprint magnet piano black plastic has been removed from frequently touched surfaces.  Not every change is for the better, however. While the ride quality has been improved, performance has not changed in any noticeable way. Straight-line acceleration is as enjoyable as ever, and the car performs very well on the highway. When taken into winding mountain roads, the steering feels numb and the vehicle’s weight becomes noticeable in the curves. Both reviewers also noted that despite the road noise reduction, the steering wheel is surprisingly noisy. It creaks with every turn, disrupting an otherwise pleasant driving experience.             The removal of the steering wheel stalks are cited as the most glaring new design issue. For extended highway driving the new haptic buttons on the steering wheel should suffice. But the lack of true tactile feedback and odd placement make them unpleasant to use. Similarly, the removal of a traditional gear shifter in favor of touchscreen controls is a major issue for Thomas. Both reviewers give the nod to the 2018 model when it comes to ergonomic design. The current long-range model starts at $47,000 and does not qualify for the current federal tax credit. Upgrading the paint and wheels alone brings the MSRP above $51,000. This makes it more difficult for the hosts to justify the newest model when compared with a lightly used older model.  While the 2018 model may not be quite as refined and luxurious, the overall driving experience is essentially the same. With used prices currently in the low $20,000’s or less, a used 2018 could save the buyer $30,000 with very few sacrifices and a few distinct advantages. Still, even with only 50,000 miles on the odometer, their loaner was not in the best physical condition, pointing to possible build quality issues.             Both Thomas and James note the uncomfortable seats where padding is packed down and no longer adequate. Some exterior chrome detailing has come loose while the interior lining near the driver’s door is hanging on by a thread. Yet the excellent driving experience manages to shine through. For many, it would be difficult to justify the latest model when you can get the same driving experience from a lightly used example.  Are you in the market for a Model 3 this year? If so, are you thinking of pulling the trigger on the refresh or saving some money and picking up a used model? Let us know in the comments below.  More Model 3 News           Tesla Slows Down Production At Its Largest EV Factory In China: Report               The New Tesla Model 3 Is 'Mind-Numbingly Boring,' Doug DeMuro Says In Review           Updated Tesla Model 3 Performance May Get A Big Power Bump: Leaked Docs           Jay Leno Thinks The New Tesla Model 3 Is A Great Deal For Under $40,000           Tesla China-Made EV Wholesale Sales Decreased 19% In February 2024               Tesla Model 3 Owner Says New 2024 Highland Model 3 Isn't Worth The Upgrade    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713486/cybertruck-inductive-charging-equipped-manual/",
        "image_path": "https://cdn.motor1.com/images/mgl/8Avvne/s3/tesla-cybertruck-inductive-charger-connector-hero.jpg",
        "date": "Sat, 23 Mar 2024 16:00:09 +0000",
        "new_content": " Tesla could be preparing to add wireless charging to the Tesla Cybertruck. Members of Cybertruck Owners Club discovered a page in the pickup's service manual that reveals a connector on the truck's traction battery which could be used for a wireless charger. This, combined with Tesla's recent interest in cable-free charging tech, signals that the automaker has something up its sleeve to revamp how owners charge at home.  Get Fully Charged  Tesla's Hidden Quest for Wireless Charging  Tesla has not only been teasing the possibility of a wireless charger, but its chief designer has confirmed that the company is actively working on it. The Cybertruck could be the first Tesla vehicle to add on wireless charging capabilities.    Hidden deep within the service manual's instructions to remove the high-voltage battery pack is a single connector that attaches a harness for what Tesla describes as an \"Inductive Charger.\" While Tesla doesn't explicitly state what this is used for, it's theorized that the name indicates a future add-on that would allow owners to wirelessly charge the Cybertruck. Likely, this will be with some add-on, as no Cybertruck teardown has indicated the presence of this hardware in the truck as of yet.   Get the InsideEvs Newsletter Sign Up Today   Previously, Tesla used the term \"inductive charger\" to describe the wireless charger present inside the cabin of the vehicle to charge cell phones. In the Cybertruck service manual, Tesla refers to the phone charger as the \"wireless charger\" and the port located on the traction battery as an inductive charger. No other vehicle service manuals mention an inductive charger port on the battery pack.             Tesla has shown public interest in wireless charging since it acquired Wiferion, a German wireless charging startup in 2023 and sold it just months later. It also teased a wireless charger that year, and chief designer Franz von Holzhausen confirmed that the automaker was working on a wireless charger on Jay Leno's Garage in December during a Cybertruck review.  Oh, we're working on inductive charging. So you don't even need to plug something in at that point. You just pull in your garage, drive over the pad, and you're charging.  Fans have theorized that Tesla may install the hardware at the rear of the Cybertruck in a hollow area near the tow hitch. This would line up with the rear placement of the wireless charger teased by Tesla last year. As of now, Tesla is remaining silent on its plans. But all signs point to the Tesla Cybertruck being the first vehicle from the automaker to feature wireless charging. That being said, does it really solve a problem? Plugging in an EV when you get home isn't really that cumbersome—it's become a daily habit for me. Wireless charging adds convenience at the likely expense of charging speed, so whether or not that is worth it to the owner will eventually be seen.  More Cybertruck News           Tesla Launches Cybertruck-Inspired CyberHammer               World's First Tesla Cybertruck Teardown Shows Botched Door Hinge Install               Four Electric Pickup Trucks Were Driven Until They Died. Only One Met Its Advertised Range           Tesla Giga Texas 4680 Battery Cell Production Reached A New Record    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713475/evpoint-tesla-v4-superchargers-deployed/",
        "image_path": "https://cdn.motor1.com/images/mgl/XBYYol/s3/ev-point-charging-station-with-tesla-chargers-source-ev-point-evpoint_uk-x.jpg",
        "date": "Fri, 22 Mar 2024 21:00:19 +0000",
        "new_content": " The first Tesla DC fast chargers started to appear on third-party charging networks, as Tesla expanded its business to become a hardware provider. This month, EG Group's EV Point network shared a few images of its charging station in Asda Express, Uttoxeter, UK. The site is equipped with EV Point branded chargers, which are essentially Tesla V4 Superchargers that the company ordered in 2023.  Get Fully Charged  Tesla EV charging business expands  Tesla produces in-house AC and DC charging equipment and operates its fast charging network. In recent years, the company started to open the network to non-Tesla EVs and even sell charging hardware to third-party networks.    According to the previous report, EG Group intends to deploy more than 20,000 chargers across about 3,600 sites in the United Kingdom and continental Europe. If the partnership with Tesla continues, it might become a noticeable revenue stream for Tesla.                        In Europe, all new DC fast chargers are currently compatible with the CCS Combo 2 (CCS2) standard, so the sites can be used by all modern EVs.   Soon, we might see more third-party charging networks using Tesla chargers around the world, simply because Tesla might be very cost-competitive. The company already achieved a relatively high scale of DC charger production. In the U.S., Tesla chargers will be used in the BP Pulse charging network. The initial order, placed in October 2023, was for $100 million worth of equipment. We don't know the technical details, but we can assume that the company might deploy V4 Superchargers, with the SAE J3400 NACS plug and Tesla’s Magic Dock, which is an integrated CCS1-adapter for non-Tesla EVs. Tesla still needs to accelerate its V4 deployment in the U.S. The new V4 models, which began rolling out last fall, are designed to work with a much wider range of EVs as Tesla increasingly gets into the charging business for the rest of the industry as more cars switch to its plug standard from the factory.    Get the InsideEvs Newsletter Sign Up Today    See also           This Is How Much EV Charging The U.S. Will Need By 2030           Tesla Is Working On A NACS-To-NACS Extension Cable    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713480/interview-shailen-bhatt-ev-charging/",
        "image_path": "https://cdn.motor1.com/images/mgl/P300G8/s3/fhwa-top.jpg",
        "date": "Fri, 22 Mar 2024 20:30:05 +0000",
        "new_content": " As the United States ambles toward a very contentious and consequential election season, the two leading presidential candidates could not be further apart on the eventual transition to electric vehicles. But even if the White House gets a new (or returning) occupant after November, the Biden Administration's highway transportation chief has this to say about EVs: that ship has already sailed.  Shailen Bhatt, the Administrator of the U.S. Department of Transportation's Federal Highway Administration, said he believes a global shift toward EVs is underway, and that the country and the automakers who operate here can't afford to be left out.   Get Fully Charged  Policy decisions drive EV growth  China's rise to electric vehicle dominance was heavily driven by government subsidies, incentives and funding to various homegrown automakers. Policy experts say similar approaches are needed to transition away from fossil fuels in the U.S., Europe and beyond.     \"My sense is even if the election goes differently, and President Biden isn't reelected, that the country will still continue on this pace,\" Bhatt told InsideEVs in an interview. \"Automobile manufacturers were making these investments before President Biden became the president, and they're making them because they're looking at global trends, not politics in the United States.\"    Those are strong words from a Biden Administration appointee. But ahead of his keynote speech today at the EV Charging Summit and Expo in Las Vegas, Bhatt said both global business trends—and the fact that former President Donald Trump once lobbied to build electric trucks at a former General Motors plant, before he was so against EVs—proves this technology is on a growth curve agnostic of politics.  In recent months especially, the idea of EVs and whether Americans are being \"forced\" into them has become a hot-button campaign issue.             Biden's policies overwhelmingly support EV adoption over time with federal funding for EV fast chargers, which Bhatt's FHWA is partly responsible for doling out, as well as stricter fuel economy and emissions rules that will lead to a majority-electric market someday. Trump, Biden's likely opponent, has vehemently opposed those plans and said an EV push will be a \"bloodbath\" for the car industry. Meanwhile, research shows a very clear partisan divide about EVs, even as people on all sides express lingering concerns about cost, range and charging. And even as the rate of EV adoption is slowing somewhat, Bhatt said he's encouraged by the number of more affordable models coming to market.  \"I just want to try to separate the politics from the facts,\" Bhatt told InsideEVs in an interview. \"While there's a lot of debate out there, what is unquestionable is that 10% of American car sales were [plug-in cars] last year, but 30% in China, and the EU is developing stronger and stronger requirements for clean air.\"    Bhatt has led the FHWA, which provides financial and technical assistance to state and local governments for America's highways, since 2022. A longtime veteran of the transportation policy space, Bhatt's agency has overseen grants to states for EV charging under the Inflation Reduction Act and Bipartisan Infrastructure Law.  Under the latter, states can apply for funding for EV chargers and then take bids from contractors to actually build them. The program came under some fire in December when Politico reported that none had been opened yet, calling the program \"sluggish\" and a potential black eye for Biden's reelection bid.  A few months later, Bhatt said, and the program has seen dramatic improvements. Since then, National Electric Vehicle Infrastructure (NEVI)-funded chargers have gone up in New York, Ohio and other places, the \"majority of states\" have proposals to build them out there as well, he added. \"I wish they had waited like a month or two,\" Bhatt said of that report. \"New York, Maine, Vermont, Kentucky, Hawaii... I think about a dozen now that either have cut the ribbon or are about to cut the ribbon. Can you unspool $7.5 billion of funding, working with states and working with the private sector much faster? I don't think so.\"             Still, the U.S. government has its work cut out for it on the charging front. A recent report from the National Renewable Energy Laboratory indicates the U.S. will need about 28 million EV chargers of various types—private and public, AC and DC—by 2030, about a tenfold increase from where the country is currently. Still, there is progress; Biden Administration officials claim fast-charging ports increased by more than 70 percent in 2023 alone.  Bhatt said that he sees applications coming in regularly from states even where Biden and his agenda may not be overwhelmingly popular.  \"You know who isn't political about EVs? Governors,\" he said, including ones like Georgia and Alabama, where EVs are built. \"No governor is out there saying, well, when these EVs are driving through our state, we don't want them to have a place to stop.\"  Bhatt said he already sees many car companies meeting at the moment, and he believes it's in America's best interest to do the same.  \"I think the part that we're missing a little bit in all of these kinds of squabbles is that America was really successful as a nation, in no small part because of our success in the automotive industry, in the 20th century,\" Bhatt said. \"If we want to be successful in the 21st century, we have to build the cars that are being bought out there,\" he added. \"It's less about the last quarter or the last year and more about the decades-long trends.\"  Contact the author: patrick.george@insideevs.com  More EV News               This Guy Drove His Brand New Tesla Cybertruck 4,500 Miles In One Week           Why The Tesla Cybertruck Isn't The Best EV Truck For Towing           Tesla Slows Down Production At Its Largest EV Factory In China: Report               I Tested A Polestar 3 On A Frozen Lake. It Handles Ice Like A Pro Dancer           Polestar EVs Can Recharge At Tesla Superchargers In China Ahead Of U.S. Access           Rivian Screens Now Display Live Charging Costs At Tesla Superchargers          "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713452/land-rover-series-iia-ev-conversion-everrati/",
        "image_path": "https://cdn.motor1.com/images/mgl/bgBEen/s3/1971-land-rover-series-iia-ev-conversion-by-everrati---the-polo-commission.jpg",
        "date": "Fri, 22 Mar 2024 20:00:57 +0000",
        "new_content": " Land Rovers, especially older models, have a certain kind of charm about them. They can pretty much go anywhere and they’re easy to fix on the side of the road–and you’ll be doing quite a bit of that, trust me. However, they’ve never been exactly environmentally friendly–that was never their purpose–but in this day and age, one can experience the charm of an old Landy without taking in the fumes, thanks to EV conversion specialists like UK-based Everrati.  Get Fully Charged  Classic Land Rover keeps the looks but ditches the old gas engine  This rather handsome classic Land Rover Series IIa is hiding a secret underneath its limestone-colored aluminum body: an all-electric powertrain fitted by UK-based EV conversion specialist Everrati.    Everrati made a name for itself by carefully restoring and then swapping the original gas or diesel engine of old vehicles for modern, OEM-grade electric powertrains. Among its creations, we can mention the rather stunning Ford GT40 EV, Porsche 911 964, Mercedes-Benz SL “Pagoda,” and classic Range Rover.   Gallery: 1971 Land Rover Series IIa EV conversion by Everrati              5 Photos                                                                      And now, the British firm has another model under its belt: a 1971 Land Rover Series IIa that was commissioned for a client in the United States. Known as the Polo Commission, the limestone-colored classic 4x4 has up to 150 miles of range on a full charge thanks to a 60-kilowatt-hour battery pack. That battery can be recharged either via AC or DC, while the electric motors can produce up to 150 horsepower and 221 pound-feet (330 Newton-meters) of torque. The restored and converted British classic offers both two-wheel drive and four-wheel drive, and features a classic seating arrangement with side-mounted benches in the back, a wooden steering wheel, teak flooring, and a canvas roof.  More EV Conversion Stories           Everyone Loves A Classic Volkswagen Beetle. Especially One With Tesla Power           Custom Land Rover Defender EV Fits Inside A Superyacht           1929 Rolls-Royce Phantom II EV Conversion By Electrogenic Revealed With 201 HP               See A 1987 Toyota Land Cruiser Converted To Electric Drive 4 Miles Underwater      Get the InsideEvs Newsletter Sign Up Today   "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/712721/tesla-cybertruck-owner-drive-4500-miles-1-week/",
        "image_path": "No image found",
        "date": "Fri, 22 Mar 2024 19:00:41 +0000",
        "new_content": " A Tesla Cybertruck owner shares his thoughts about the truck after owning it for a week and driving it 4,500 miles across the country. You are probably thinking that's an insane amount of miles in just one week and we agree. If he maintained that weekly mileage over the course of the first year, then the Cybertruck would have 234,000 miles on it by this time next year. However, that's unlikely to happen.  Get Fully Charged  A cross-country trip in a Cybertruck. What was it like?  After taking ownership of a brand new Tesla Cybertruck, Kyle Conner from Out of Spec drove it across the country. The truck has 4,500 miles on its odometer after just one week.    The Cybertruck featured here is owned by Kyle Conner from YouTube's Out of Spec channel. He took delivery of the vehicle and almost immediately set out on a race across the country against some other electric pickup trucks (more details on this will be available soon). Ahead of the big cross-country electric pickup truck race news comes this one-week ownership review of the Cybertruck Cyberbeast. Typically, one week behind the wheel might provide you with a few hundred miles of new truck experience, but here we are talking about 4,500 miles, so what does Kyle think of his new Cybertruck? He took delivery of the truck in Jacksonville, Florida and drove it to San Diego, California and then back to Colorado. Here are some of the key takeaways in bullet point form:  Eye-catching and unique but draws way too much attention Not a good-looking vehicle Very quick. Faster than Kyle's own quad-motor Rivian R1T Tesla's estimated 300 or so miles of range is way over-exaggerated The real-world highway range is just over 200 miles 250-260 miles estimated combined range Claimed to be the world's toughest truck, but Tesla says don't leave bugs on it. What!?!? The stainless steel's finish looks very uneven. It gets both hot and cold, depending on outdoor conditions. Looks better dirty than clean. The rear camera gets dirty easily and basically doesn't function after accumulating too much grime. Lacks a washer. The power tonneau and vault (truck bed) are some of the truck's best features. Power tonneau operates much better than the one on the Rivian R1T. The tonneau cover can only be operated a certain amount of times (3 to 4) within a given time period or it might overheat and stop working. The vehicle warns you of this. Can't CCS charge unless you remove the rear cladding around the wheel well Love that you can charge other electric cars right from the truck bed with the proper NEMA 14-50 connector No spare tire, while most other electric trucks do have a spare tire The single wiper blade works well but it's ugly and there isn't enough windshield washer fluid dispensed Headlights are not bright enough and snow can completely cover the lights Frunk is small but its low-access height is convenient Access into and out of the trunk is great Really amazing software with zero glitches/faults Steer-by-wire is incredible in normal driving but it's not good for sporty driving. The phone charger is a terrible design that doesn't charge the phone well The ride is too firm Stability control can't be turned off or down The sound system is amazing Interior quality is great There's that tonneau cover/rearview mirror issue Averaging under 2 miles per kW Fast charging speeds should be improved (not as strong of a charging curve as other electric vehicles out there)  We can't say that Kyle is overly impressed by the Cybertruck but he doesn't seem to view it very negatively either. Aside from its range falling quite short of what's advertised and fast charging not where it needs to be, the Cybertruck seems to be about average.  More Tesla Cybertruck Reviews               Four Electric Pickup Trucks Were Driven Until They Died. Only One Met Its Advertised Range           The 2024 Tesla Cybertruck Isn't The Revolution We Expected    It needs some improvements, which it will probably get over time (the charging has already been improved since the truck launched), to be as good as the other Teslas out there, but even then some issues will remain. For example, the hard-to-clean exterior that's often either very hot or very cold can't be fixed with a software update. And the small frunk likely won't get bigger. What are your thoughts on Kyle's takeaways after driving the Cybertruck across the country?  More Cybertruck News           Tesla Cybertruck Gets Creamed By Rivian R1T, Every ICE Off-Road Truck In This Test               Bring On The Big Guns: Tesla Cybertruck Versus .50 Caliber Sniper Rifle      Get the InsideEvs Newsletter Sign Up Today   "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713488/best-electric-truck-for-towing/",
        "image_path": "https://cdn.motor1.com/images/mgl/QemKY9/s3/tesla-cybertruck-towing-spacex-rocket-engine-source-starship-gazer-youtube.jpg",
        "date": "Fri, 22 Mar 2024 18:02:51 +0000",
        "new_content": " In many ways, Tesla is ahead when it comes to building EVs. The company dominates the U.S. EV market, offers an incredible charging network, has best-in-class software, extremely good battery management tech and a new 800-volt architecture for the Cybertruck. But none of its tech prowess can help with long-range towing. As Engineering Explained's Jason Fenske lays out in his newest video, long-haul towing is about one thing above all else: Battery size. All of the existing electric trucks are well-suited to towing over short distances. Electric motors have gobs of low-end torque and no fussy transmissions, with plenty of power for on-ramp acceleration. The Ford F-150 Lightning, GMC Hummer EV, Rivian R1T, Tesla Cybertruck and Chevy Silverado EV can all tow between 10,000 and 12,000 lbs. But put a 6,100-lb trailer on the back of the Rivian or Ford and it'll cover only about 1/3rd of its advertised range before running out of juice. The GMC Hummer, despite its higher weight and bulkier tires, has a comparatively smaller reduction in range. It goes from 329 miles of unladen endurance to 140 miles of range with a trailer.         Get Fully Charged  The EV Towing Problem  Towing is terrible for efficiency. That's just as true for gas and diesel trucks as it is for EVs, but EVs take longer to refuel and depend on less mature infrastructure. Efficiency tweaks can help extend their endurance, but in the end, it's really about one thing: How big of a battery can you squeeze into your truck while keeping the price within reach?    That's right, the heavier, blocker truck with the worse drag coefficient does the best. That's because regardless of how slippery your truck is, there's still a trailer behind it. Fenske lays out how a sleeker car or truck actually produces more drag against a trailer, negating any benefit. You could design a truck for maximum range with a trailer, but it'd suffer without one. So in terms of towing, the Cybertruck's trapezoidal design and power tonneau cover don't pay off. Fenske calculates that its range should fall right in line with the Rivian and the Ford, another area where the Cybertruck is roughly in line with its competitors.               The number one thing that does matter is battery size. Towing consumes a ton of energy regardless of how well you've designed the vehicle. If you want a long range while towing, you need to make an even bigger battery. \"Even bigger\" is sort of the guiding principle behind legacy OEM truck design, so it's no surprise that Chevy takes the lead here. The Silverado EV has over 200 kWh of usable battery capacity. That makes it far less efficient in everyday driving than the Rivian, Ford or Tesla, which all have packs between 120 and 135 kWhs, but much better for long-range towing. That's why the Silverado EV was able to tow a 6,500-lb trailer for 232 miles on one charge in a Fast Lane Truck test.             With solid fast-charging infrastructure that includes pull-through spots for trucks with trailers, that is a workable number. It doesn't make long-distance camper-hauling as easy as a gas truck, yet, but it's at least feasible in the fast-charging, long-endurance Silverado EV. If you need to go even further, though, you'll just have to wait for the upcoming Ramcharger.  More EV Pickup Truck Stories               The 2025 Ram 1500 Ramcharger May Be The Best Electric Truck For Towing, Hauling               Four Electric Pickup Trucks Were Driven Until They Died. Only One Met Its Advertised Range           2022 Ford F-150 Lightning Owner Drove Almost 100,000 Miles. Battery Health Is 97%           The 2024 Tesla Cybertruck Isn't The Revolution We Expected    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713399/report-tesla-slows-production-china/",
        "image_path": "https://cdn.motor1.com/images/mgl/bgBmj3/s3/tesla-model-3.jpg",
        "date": "Fri, 22 Mar 2024 17:00:45 +0000",
        "new_content": " Market turmoil and fierce competition affect everyone, either directly or indirectly. It seems that Tesla is now experiencing some challenges in China, too. According to Bloomberg (and CnEVPost), Tesla reduced production output at its Giga Shanghai factory in China amid sluggish growth and an ongoing price war. The unofficial report is based on input from \"people familiar with the matter.\"  Get Fully Charged  Tesla is slowing down production in China  Tesla's biggest factory, in terms of output, is slowing down production due to sluggish growth.    The article says that in mid-March, Tesla instructed employees to reduce production of the Model 3 and the Model Y from the usual 6.5 days to 5 days per week, although the lines will continue to operate on two daily 11.5-hour shifts. Let's recall that the Tesla Giga Shanghai is the world's largest all-electric car factory. In the past, it was responsible for roughly half of Tesla's global sales volume. According to the company's Q4 2023 report, the Shanghai plant can produce more than 950,000 EVs annually, out of 2.35 million in total.   Get the InsideEvs Newsletter Sign Up Today   The report also indicates that parts supply is affected. Reportedly, Tesla limited production at some of its workshops and told some of its suppliers to prepare for extended production limits through April. April is expected to be a slower month for consumption due to the Tomb Sweeping Day in China. In February, Tesla's Made-in-China (MIC) EV wholesales decreased by 19% year-over-year to 60,365. If the demand is weakening, we will probably see another decline in March. Interestingly, according to reports from China, Tesla is expected to increase Model Y prices by 5,000 CNY (almost $700) on April 1 (like in the U.S. and some other global markets). At the same time, the insurance subsidy (8,000 CNY or $1,100) and paint color cost reduction (10,000 CNY or almost $1,400) will expire. For broader context, it's worth noting that BYD—the largest EV maker in China—also noted a sales decline in February, and is actively refreshing its lineup and applying lower prices.  See also           Tesla Giga Texas 4680 Battery Cell Production Reached A New Record           Volkswagen ID.3 Production Won't Expand Due To 'Low Demand': Report    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/reviews/713356/polestar-3-ice-driving-review/",
        "image_path": "No image found",
        "date": "Fri, 22 Mar 2024 16:00:00 +0000",
        "new_content": " As I settled behind the wheel of a Polestar 3 prototype, my co-pilot, Joakim Rydholm, Polestar's head of chassis development, asked me if I’d ever driven on a frozen lake before. No, I told him. And with that, he began to grin ear to ear and simply said, “Excellent.\"  Few driving experiences rival the thrill of pushing a cutting-edge vehicle to its limits on a sheet of ice. Enter the Polestar 3, a Nordic beast designed to dance effortlessly on frozen terrain, blending innovation with exhilaration in a symphony of torque, traction, and tenacity. What better way to see what a car is made of than this?      Quick Specs Polestar 3   Output:  Dual Motor - Performance 489 HP / 620 lb-ft  -  517 HP / 671 lb-ft   Motor: Dual Permanent Magnet-Synchronous    Battery: 111-Kilowatt-Hour Lithium-Ion (107 kWH Usable)   EPA Range:   Dual Motor - Performance 315 Miles (Est)  -  279 Miles (Est)   DC Fast Charging: 10% - 80% in 30 Minutes / 250 kW Max Speed   Base Price:   Dual Motor  -  Performance $73,400  - $79,400     (Full Disclosure: Polestar provided flights and lodging for this Arctic Circle winter driving event.)             Two Polestar 3 sitting on a frozen lake in Jokkomm, Sweden   Ice, Ice, Baby While this was technically a “first drive” event for me, simply because I've never driven a Polestar 3, it wasn’t really one. I was driving a pre-production Polestar 3 and some of the systems, like the advanced driver assistance systems, were not operational yet. However, the suspension and traction control systems were fully baked, as I was about to learn. The purpose of this event was purely focused on demonstrating how well the 3 can handle snow-covered, icy roads. Polestar set up a track on a frozen lake just inside the Arctic Circle, in Jokkmokk, Sweden. It’s located in the Lappland region of Northern Sweden, where both Volvo and Polestar conduct cold weather testing and temperatures get as low as -50° Fahrenheit. And no, it wasn’t nearly that cold when I was there. After a few practice laps, Rydholm encouraged me to push the vehicle beyond what I believed it could safely handle and, unsurprisingly, I was happy to oblige.              Polestar 3 ice test track in Jokkmokk, Sweden   With each lap, I was driving progressively faster, and I quickly realized the 3 was just as home driving on a frozen lake with uneven surfaces as many vehicles I’ve driven are on pavement. Of course, the vehicle was fitted with studded Michelin tires, but they were not special tires, they were the standard original equipment studded tires offered by Polestar.   Related News           Drivers Who Are 'Scared Of Change' Are Part Of EV Adoption Problem: Polestar CEO           The Polestar 3 Can't Come Soon Enough    After about a half an hour into the drive, I would have best summarized the 3’s performance as akin to stepping onto a dance floor with a seasoned partner. The Polestar 3's all-wheel-drive system, coupled with its unique torque vectoring technology, transformed the ice into its playground—and suddenly I felt like I was driving like a pro—which admittedly, on the ice I am not. The 3 did all the work, I nearly needed to control the accelerator and simply steer.              Torque Vectoring: The Maestro's Baton If torque vectoring were a symphony conductor, the Polestar 3 would undoubtedly be its virtuoso. This innovative dual-clutch system needs milliseconds to adjust and send the proper amount of the rear motor's 361 lb-ft of torque to each rear wheel accordingly while monitoring and reducing or eliminating slippage. The system orchestrates the distribution of power to each wheel, seamlessly adjusting in real-time to the nuances of whatever surface the vehicle is on. As I navigated tight corners of the course, I could feel the 3's stability control system working, subtly shifting power to the outer wheels to propel me through the icy labyrinth. It was an exceptional display of balance and finesse, much to the credit of Rydholm's team and the thousands of hours they spent (as he explained to me) tuning the system.  If it works in -30 degrees, it works everywhere. If we have a problem with squeaks or rattles, we easily find it at -30 degrees. - Joakim Rydholm, Polestar's Head of Chassis Development In addition to fine-tuning the electronic stability control and dual-chamber active air suspension, Rydholm explained that extreme cold weather is also perfect for finding squeaks and rattles before going to production.    Gallery: Polestar 3 on a frozen lake in the Arctic Circle              28 Photos                                                                                                Suspension System: Riding on a Cloud But what good is a virtuoso without a sturdy stage? Enter the 3's dual-chamber Active Air suspension, the unsung hero of my icy escapade. The system replaces conventional dampers, improving handling and comfort by reacting to the vehicle’s movements 500 times per second. The system also provides different settings, such as off-road and loading modes, and automatically lowers the ride height at high speed to optimize aerodynamics. Even as I pushed the 3 to its limits at the urging of Rydholm, testing the boundaries of the studded tires and gravity, the suspension system remained steadfast, providing a plush and controlled ride that belied the harshness of our wintry environment.  Charging the Polestar 3 While charging wasn't on the agenda for this trip, I asked the Polestar team to allow me to visit an Ionity charging station and charge the 3 for a while. I think they expected that request from me since I always ask for some time to charge the vehicle on every press invite, and they obliged.  The 3 will come equipped with an 11 kW onboard charger for AC charging and should charge from 0 to 100% in 10 to 11 hours. However, the standard supplied charging equipment is a 40-amp dual voltage portable charger, and when using that, you'll need about 12 hours to completely replenish a fully depleted battery. Since you can access a high percentage of the battery pack, 107 kWh out of the 111 kWh total capacity, Polestar recommends charging to 90% for daily use and to only charge to 100% when you need the extra range for a road trip.             As for DC fast charging, the 3 has a peak charging rate of 250 kW and can charge from 10% to 80% in 30 minutes. While not class-leading, it's certainly fast enough to make the 3 a good choice for long road trips, provided you have high-speed chargers along the route.  And speaking of DC fast chargers, Polestar is expected to gain access to more than 15,000 Superchargers in North America on the Tesla Supercharger network sometime in the next few weeks. Polestar 3 owners will however, need to use a NACS to CCS1 adapter because when the vehicle launches this summer, it will not have a native NACS charging inlet, as Polestar was too far along in development when it agreed to switch charging standards to incorporate the new inlet on the 3.              Anxiously Awaiting Pavement Time Polestar is known as a performance brand, and the 3 will do nothing but solidify that reputation if it performs as well on pavement as it does on ice—and I have no reason to believe it won't. But I still need to experience that before I'm convinced. I also know that most drivers don't need a vehicle, much less a family-hauling SUV, to perform like it's on rails while driving on a frozen lake.  However, what they do want is a vehicle that does all the work for them automatically and instantly when they encounter black ice on a turn at 40 mph. After spending an afternoon in the 3, I'm confident many drivers won't even realize they hit ice, because of how well this system works. I had to turn off the electronic stability control (which still doesn't turn it off completely) in order to have any kind of fun. The system works that well. I was buzzing around the track, taking turns at 45-50 mph that I wouldn't take on the pavement in most vehicles and the 3 wasn't even breaking a sweat.              Polestar is building the 3 at Volvo's Ridgeville, South Carolina plant which will make it qualify for $3,750 of the Federal tax credit if you purchase it. However, due to the \"leasing loophole\", if you lease one, you can take advantage of the full $7,500 tax credit and apply it to the lease as a capital cost reduction.  Polestar recently announced it was lowering the starting MSRP of all Polestar 3 models by up to $10,500. The Long Range Dual Motor trim which was expected to start at $83,900 will now have a base price of $73,400 (plus $1,400 DST) and the Long Range Dual Motor Performance Pack 3 was dropped from $89,900 to $83,900, plus DST. The lower pricing will definitely help, but it's still going to be an expensive option that's out of reach for most Americans. That's too bad because the 3 is probably the most sports car-like SUV I've driven yet. However, I still haven't driven the electric Porsche Macan, so... Contact the author: tom.moloughney@insideevs.com   Get the InsideEvs Newsletter Sign Up Today     "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713379/polestar-tesla-supercharger-china/",
        "image_path": "https://cdn.motor1.com/images/mgl/RqY6z3/s3/polestar-4-charging-at-a-tesla-supercharger-dc-fast-charger-in-china.jpg",
        "date": "Fri, 22 Mar 2024 15:00:58 +0000",
        "new_content": " Polestar, the Chinese-owned, Swedish-based electric car maker is among the companies that have a deal with Tesla to gain access to the Supercharger network of DC fast chargers in North America. However, that hasn’t happened yet–it will sometime this spring, according to Tesla–but if you’re a Polestar EV owner who lives in China, you can brag to your American friends that you can recharge your zero-emissions ride at Superchargers now. Well, at some of them, at least.  Get Fully Charged  Polestar gets Tesla Supercharger access in China  Polestar EVs, which are made in China, can now recharge at select Tesla Superchargers in their home country after the two companies put into effect a deal that was announced last year. A similar thing will happen in North America this spring.    Earlier this week, Polestar announced on its Weibo page that owners of its EVs in China will get access to a part of the Tesla Supercharger network. In total, Tesla said it operates around 1,900 Supercharger stations consisting of over 11,000 stalls in China, but out of these, only 450 or so stations are open to EVs made by other companies, including Polestar.  More Polestar Stories           Polestar 3 Price Reduced By $10,500, Range Increased By Up to 15 Miles           The Polestar 3 Can't Come Soon Enough           Volvo Stops Funding Polestar As Geely Prepares Bailout           Polestar 4 Goes On Sale In Europe And Australia, U.S. Launch Set For Mid-2024    This is a similar but not identical solution to that adopted in the United States. Here, Tesla vehicles are fitted with the NACS plug and the vast majority of Superchargers have cables that only cater to this requirement. Meanwhile, EVs sold in North America that are made by Ford, Rivian, and just about every other carmaker have a CCS1 inlet, which is why an adapter is needed. In China, all EVs, including Teslas, have a pair of GB/T inlets–one for AC and one for DC charging. As a result, Tesla Supercharging stalls also have GB/T connectors at the end of the charging cables, so there’s no need for an adapter. But just like in the U.S. and Canada, Tesla has to first enable access to a particular model before it can top up its batteries at a Supercharger.   Get the InsideEvs Newsletter Sign Up Today   What’s interesting, though, is that Polestar’s integration with Tesla’s DC fast-charging network seems to go a bit deeper than a simple smartphone app. From the video posted on Weibo, we could see that the owner of a Polestar 4 could navigate to a compatible Tesla Supercharger by using the car’s infotainment system as well as unlocking the parking barrier from inside the car. In China, Polestar EVs can draw up to 120 kilowatts of power from a Tesla Supercharger, Polestar said in its social media post. "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713456/rivian-screens-display-live-charging-costs-tesla-superchargers/",
        "image_path": "https://cdn.motor1.com/images/mgl/ojmxR4/s3/rivian-real-time-charging-cost-tesla-supercharger.jpg",
        "date": "Fri, 22 Mar 2024 14:21:03 +0000",
        "new_content": " The charging experience for Rivian owners (and pretty much all non-Tesla EV owners) is on track to improve after the roll-out of the Tesla North American Charging Standard adapter. This gives Rivian owners access to over 15,000 Tesla Supercharger stalls across the U.S. But Tesla and Rivian aren’t stopping at that in their quest to make the EV charging experience incrementally better over time. On X, the platform formally known as Twitter, a popular Rivian-focused handle called RivianTrackr posted a small new addition to Rivian screens when the EVs are plugged into a Tesla Supercharger. The real-time charging costs are now displayed on the gauge cluster and the central infotainment display of Rivian EVs. It might not sound like a big deal, but it's certainly an intuitive add-on—and a more useful feature than most EVs have.  Get Fully Charged  The charging experience is improving slowly in the U.S.  Record EV sales mean the charging infrastructure needs to expand at a record pace as well. That's certainly happening, and at the same time, brands are working hard to make the charging experience worry-free and intuitive.      All the important charging information is now in sight, deleting an additional layer of complexity where you have to navigate through your charging or payments app to find out exactly how much the charging session costs you. So now you have your real-time range, the charging rate, the number of kilowatt-hours being added, and the exact cost and time remaining. EV fast charging rates can often be all over the place. They're likely determined by the cost of local electricity, and also what the station or company is choosing to charge. This feature offers more immediate transparency into how kilowatt-hours translate into dollars. Rivian CEO RJ Scaringe quickly retweeted RivianTrackr’s post, saying that Rivian collaborated with Tesla to bring this tiny detail onto the screen. It might appear like an insignificant addition on the screen, but it likely was a complex task of advanced system integration between the two brands. It's unclear how fast this quirk will be rolled out across the country.   According to RivianTrackr, this feature is exclusive to Tesla Superchargers and the Rivian Adventure Network at the moment, so it’s unlikely that you would see real-time charging costs on the gauge cluster after plugging into Electrify America, or any other network. Several Rivian owners who got their hands on the NACS to CCS1 adapter early on have said that charging at Tesla Superchargers is trouble-free. Rivian’s in-car charging map now displays the nearby Superchargers compatible with adapters—not all are compatible at the moment. All drivers need to do is plug the adapter into the NACS cable and then connect that to the vehicle’s charging port. You should also have an established payment method in the Rivian app for plug and charge to work.             Nearly all U.S. carmakers joined Ford and General Motors in adapting Tesla’s NACS connector for their electric cars last year. That is slowly coming to life in 2024 as Tesla-made and other aftermarket adapters become available for non-Tesla EV owners. Inadequate charging infrastructure and worry-free charging experience are major barriers to wider EV adoption—but significant work is underway to change that nationally. With that, we wonder what other collaborations are underway between Tesla and its fellow rivals in making the EV experience incrementally better for owners. Correction: The live cost feature is displayed when using the Rivian Adventure Network as well. A previous version of this article said that it was exclusive to the Supercharger. Contact the author: suvrat.kothari@insideevs.com  More Rivian News           Why The Rivian R3 Sparks So Much Joy, According To Car Designers               Four Electric Pickup Trucks Were Driven Until They Died. Only One Met Its Advertised Range           Subaru Can Do This Or Rivian Can Do It For Them           Watch How Easy It Is To Charge A Rivian R1T At A Tesla Supercharger    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713433/fiat-500e-gasoline-conversion-report/",
        "image_path": "https://cdn.motor1.com/images/mgl/lE26QE/s3/fiat-500e-edited-image-with-tailpipe-emissions.jpg",
        "date": "Fri, 22 Mar 2024 14:00:56 +0000",
        "new_content": " The latest generation of the cute Fiat 500 urban hatchback is only available as an electric vehicle–and it’s coming to the United States, too. However, the previous generation that came to life way back in 2007 is still going strong on the Old Continent powered by combustion engines. But that might change soon, as the European Union’s updated cybersecurity law will reportedly prevent Fiat from selling the almost 20-year-old ICE urban runabout. One possible solution? Convert the new 500e to run on gasoline.  Get Fully Charged  Conversion but the other way around  Usually, when we hear about an EV conversion, it's about an old gasoline-powered car that was modified to run on electricity. But a new cybersecurity law that goes into effect in the European Union this spring might make Fiat go the other way around with the latest generation of the 500 urban hatchback.    While that might seem counterintuitive, seeing how Fiat had its sights set on only offering the new 500 as a battery-powered vehicle, the market reality is that the old, combustion-powered model is still a strong competitor in Europe. According to Jato Dynamics, a little over 170,000 units of the Fiat and Abarth 500 were sold last year in Europe, of which almost 109,000 were gasoline models.  More Fiat Stories           New Fiat 500e Versions Add Style, Luxury And Equipment           Fiat's Retro EV Future Includes Panda City Car, Truck, SUV, Camper           2024 Fiat 500e For U.S. Now In Production           The Fiat 500e Feels Way More Comfy This Time    As a result, Fiat sent a letter to its suppliers asking if they could help with an annual production increase of almost 100,000 units at the Mirafiori plant in Italy, according to Il Corriere Della Sera. At the same time, Automotive News Europe, citing some of Fiat’s suppliers, wrote that nearly the entire production increase will be represented by gas cars. The same cybersecurity law that might affect the previous-gen Fiat 500 prompted Porsche to pull the plug on the gas-powered Macan and 718 in the EU. Those models will still live on in countries where the cybersecurity requirements are more lenient, including the United States, while customers in the EU will get all-electric new generations for both models.   Gallery: 2024 Fiat 500e North American Launch              24 Photos                                                                                                Another option would be to update the old model to comply with the new law, but that might prove to be less cost-effective than converting the EV to run on gasoline. That's because most, if not all of the electric architecture would need to be changed or updated. Currently, the gasoline Fiat 500 is made in Poland, while the new 500e is made at the company’s iconic Mirafiori plant, on the same assembly line that was used to build the ICE Alfa Romeo MiTo.   Get the InsideEvs Newsletter Sign Up Today   "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713336/hyundai-ioniq-5n-vs-competition/",
        "image_path": "https://cdn.motor1.com/images/mgl/0eKNnW/s3/2025-hyundai-ioniq-5-n.jpg",
        "date": "Fri, 22 Mar 2024 13:00:29 +0000",
        "new_content": " The 2025 Hyundai Ioniq 5 N is the performance-oriented version of the Hyundai Ioniq 5 and the first N brand electric car. It's reworked substantially for more performance. It has an enhanced body-in-white (BIW) structure, including 42 additional weld points and 6.9 feet of additional structural adhesive, as well as many reinforcements (motor and battery mounts, steering, etc.) to ensure it's ready for serious driving. The South Korean manufacturer also added more power, a bigger battery and a set of special features for enthusiasts. In today's post, we'll take a look at the Hyundai Ioniq 5 N's pricing and specs, compared to the regular Ioniq 5 as well as some of its main competitors, like the Tesla Model Y Performance and the Ford Mustang Mach-E GT Performance.  Get Fully Charged  60,000 Hyundai Ioniq 5 in the U.S.  Hyundai has sold over 60,000 Ioniq 5s in the U.S. since its debut in 2021. It's one of the best EVs on sale, but it's a relaxed everyday SUV. The Ioniq 5 N gets more power, more aggressive styling, a simulated gearbox and a bunch of other tweaks to make it faster and more interesting to drive.    The 5 N will enter the U.S. market this year, starting at an MSRP of $66,100 (plus a $1,375 destination charge for a total of $67,475). That's a substantial jump of $8,700, compared to the top-of-the-line Ioniq 5 Limited AWD. Because the Hyundai Ioniq 5 family is imported to the U.S. from South Korea, it's not eligible for the $7,500 federal tax credit if you buy it, but the incentive is available to qualifying lessees.  Prices     Model Base Price Dest. Charge Tax Credit Effective Price   2024 Hyundai Ioniq 5 SE SR RWD 19-in $41,800 +$1,375 N/A $43,175   2024 Hyundai Ioniq 5 SE RWD 19-in $45,850 +$1,375 N/A $47,225   2024 Hyundai Ioniq 5 SE AWD 19-in $49,350 +$1,375 N/A $50,725   2024 Hyundai Ioniq 5 SEL RWD 19-in $47,400 +$1,375 N/A $48,775   2024 Hyundai Ioniq 5 SEL AWD 19-in $50,900 +$1,375 N/A $52,275   2024 Hyundai Ioniq 5 Limited RWD 19-in $53,500 +$1,375 N/A $54,875   2024 Hyundai Ioniq 5 Limited AWD 20-in $57,400 +$1,375 N/A $58,775   2025 Hyundai Ioniq 5 N AWD 21-in $66,100 +$1,375 N/A $67,475     The N model has a new 84-kilowatt-hour battery pack (6.6% higher capacity than the existing 77.4-kWh battery in the Ioniq 5). All Ioniq 5s get the same, bigger battery for 2025 (together with a set of smaller upgrades). The dual-motor powertrain has a peak power output of up to 478 kilowatts (641 HP) in N Grin Boost mode. That extra power is only available for 10 seconds, though. The peak sustained output is 600 hp. That's almost twice as much power as the Hyundai Ioniq 5 AWD'. 0 to 60 mph takes about 3.25 seconds (w/N Launch Control and Grin Boost function), compared to 5.0 seconds in the regular Ioniq 5. For reference, the Kia EV6 GT does 0-60 mph in 3.4 seconds. EPA driving range figures haven't been released. We guess that the enlarged battery capacity will at least partially offset the negative impact of the bigger, 21-inch wheels (Pirelli P Zero 275/35R21). Figure somewhere around 250 miles of range. Basic specs     Model Drive Battery(kWh) EPARange 0-60mph(sec) TopSpeed(mph)   2024 Hyundai Ioniq 5 SE SR RWD 19-in RWD 58.2 220 mi       2024 Hyundai Ioniq 5 SE RWD 19-in RWD 77.4 303 mi   115   2024 Hyundai Ioniq 5 SE AWD 19-in AWD 77.4 260 mi 5.0 115   2024 Hyundai Ioniq 5 SEL RWD 19-in RWD 77.4 303 mi   115   2024 Hyundai Ioniq 5 SEL AWD 19-in AWD 77.4 260 mi 5.0 115   2024 Hyundai Ioniq 5 Limited RWD 19-in RWD 77.4 303 mi   115   2024 Hyundai Ioniq 5 Limited AWD 20-in AWD 77.4 260 mi 5.0 115   2025 Hyundai Ioniq 5 N AWD 21-in AWD 84   3.25* 162     One strong point of the entire Hyundai Ioniq 5 family (and other E-GMP-based EVs) is DC fast charging capability. The new Hyundai Ioniq 5 N can recharge from 10 to 80% state-of-charge (SOC) in just 18 minutes, like the regular Ioniq 5. Peak charging power is 238 kW, but it requires a high-voltage charger. The top speed of the Ioniq 5 N is 162 mph, compared to 115 mph in the regular versions. Hyundai says that the electric motors in the Ioniq 5 N spin up to 21,000 RPM, which you only really see on high-performance models.             Hyundai Ioniq 5 N              Tesla Model Y   Hyundai Ioniq 5 N Vs. Tesla Model Y Performance One of the main points of reference is the Tesla Model Y Performance. According to the specs, the Hyundai Ioniq 5 N will be slightly quicker and slightly faster than the top-of-the-line Tesla (3.25 seconds vs. 3.5 seconds), although a proper race would be needed to verify the numbers. The Hyundai Ioniq 5 N should also be able to recharge noticeably faster than Tesla, as long as a high-voltage charger is available. However, Tesla has some strong points on its side too. It's over $13,000 cheaper and qualifies for the $7,500 federal tax credit when purchasing. Additionally, the Model Y's EPA range will probably be slightly higher than the Ioniq 5 N's range. Early reports indicate the Hyundai is more fun to drive, but we recommend test driving both.      EV Comparison Side-by-Side by InsideEVs   Model 2025 Hyundai Ioniq 5 N AWD 21-in[A] Difference[A] / [B] 2024 Tesla Model Y Perf. LR AWD 21-in[B]   Drive AWD   AWD   Battery 84 kWh       EPA Range   Combined     279 mi*   Specs   0-60 mph 3.25 s* -7.1% 3.5 s*   Top speed 162 mph 4.5% 155 mph   Peak power 478 kW       Charging   DC Info: 10-80% SOC in 18 minutes at up to about 238 kW   Peak charging power: 250 kW   Weight   Curb weight (est.)     4398 lbs (1995 kg)   Prices   MSRP $66,100 25.9% $52,490   Dest. Charge +$1,375   +$1,640   Tax Credit N/A   $7,500   Effective Price $67,475 44.7% $46,630     *Estimated/rough values; range according to the manufacturer; acceleration with 1 ft rollout subtracted or estimated; Tesla destination charge, includes additional fees             Hyundai Ioniq 5 N              Ford Mustang Mach-E GT Performance   Hyundai Ioniq 5 N Vs. Ford Mustang Mach-E GT Performance Another key competitor is the Ford Mustang Mach-E GT Performance. We expect the final range of the Ioniq 5 N to be similar to the GT Performance's.  The South Korean model has more power and it should be slightly quicker. In terms of DC fast charging, there's no contest. The Ioniq 5 N trounces the Mustang. On the other hand, Ford's customers recently gained access to Tesla Supercharging network, which matters too. Hyundai owners should get access to it later this year. Price-wise, the Ioniq 5 N is effectively $8,280 more expensive. Ford also often offers rebates.     EV Comparison Side-by-Side by InsideEVs   Model 2025 Hyundai Ioniq 5 N AWD 21-in[A] Difference[A] / [B] 2023 Ford Must. Mach-E GT Perf. ER AWD 20-in[B]   Drive AWD   AWD   Battery 84 kWh -7.7% 91 kWh*   EPA Range   Combined     260 mi   City     277.6 mi   Highway     238.5 mi   Specs   0-60 mph 3.25 s* -7.1% 3.5 s   Top speed 162 mph       Peak power 478 kW 33.5% 358 kW   EPA Energy Consumption (including charging losses)   Combined     82 MPGe: 411 Wh/mi   City     90 MPGe: 374 Wh/mi   Highway     77 MPGe: 438 Wh/mi   Charging   DC Info: 10-80% SOC in 18 minutes at up to about 238 kW   Peak charging power: 150 kWInfo: 10-80% SOC in 45 min   Weight   Curb weight (est.)     5018 lbs (2276 kg)   Prices   MSRP $66,100 15.2% $57,395   Dest. Charge +$1,375   +$1,800   Tax Credit N/A   N/A   Effective Price $67,475 14% $59,195     *Estimated/rough values; net battery capacity; acceleration with 1 ft rollout subtracted or estimated   Get the InsideEvs Newsletter Sign Up Today    See also           2024 U.S. Electric Cars Listed By 0-60 MPH Acceleration: Quickest To Slowest           Hyundai Confirms Its Georgia 'Metaplant' EV Factory Is Opening Early    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713353/bmw-profit-neue-klasse-x/",
        "image_path": "https://cdn.motor1.com/images/mgl/y2GpOq/s3/bmw-neue-klasse.jpg",
        "date": "Thu, 21 Mar 2024 23:18:18 +0000",
        "new_content": " In every way possible, from design to performance to financial stability, the original Neue Klasse (\"New Class\") cars of the 1960s and '70s defined what we understand BMW to be today. That BMW's next generation of electric vehicles bears the same name underscores how important they are to the German automaker's future as well. And in time, the hope is that these EVs will reach the same level of profitability as BMW's internal combustion engine cars—which, by the way, are not getting cheaper to build. Very much the opposite, said Frank Weber, BMW's management board member in charge of development on a media roundtable this week after the debut of the new Vision Neue Klasse X. That car, its sedan counterpart and the new ground-up EV platform both use are very big deals for BMW, Weber said. And the company certainly does not plan on losing money on them.  Get Fully Charged  BMW is doing surprisingly well in the EV race  The maker of the Ultimate Driving Machine is still offering combustion vehicles and hybrids, but its EVs tend to overperform on range. Moreover, they made up 15% of BMW's total global sales last year, which is much higher than most rivals. Its next-generation \"New Class\" EVs aim to do even better.    \"Once this is in high-volume—which means it's very difficult to have this from the first day on—when everything is in full swing and running at the capacity it was designed for, then you will see margin parity [or] the same profitability level with the combustion engines,\" Weber said.  BMW's Neue Klasse platform and its next-generation technology are designed for that purpose, Weber said. He explained that these projections are expected in the next four years or so, with Neue Klasse production running at \"full volume\" around 2027.  Reaching cost parity and profitability levels on par with gas engines is a major priority of the auto industry as it struggles to transition to a mostly electric future. By some estimates, automakers are, on average, losing around $6,000 on each EV sold at $50,000. Luxury automakers like BMW, Porsche and Audi have fared better thanks to their higher price tags. Meanwhile, even luxury startups have their own challenges of achieving the scale needed to survive long-term.              Weber added BMW's EV profitability goals account for an anticipated cost increase in making combustion engines as well. That's because of ever-stricter environmental rules in the U.S., Europe and China, all of which mean gas and diesel engines have to run more cleanly, a cost increase BMW will have to deal with over time.   \"Future emission regulations also will add significant cost to the combustion engine,\" he said. For now, BMW finds itself in a surprisingly good position to undertake that transition. Its current lineup of EVs, like the BMW i5, i4 and iX, are profitable, a company spokesperson told InsideEVs.  And while it has not committed to an end date for its combustion engines as other automakers have, it has ended production of them at its historic headquarters in Munich and had an extremely successful 2023 on the EV sales front. Last year, BMW pulled off a record 376,183 global electric sales, a relatively high 15% of its total volume.  Meanwhile, Weber said, BMW offers a range of powertrains—combustion, hybrid and EV—in its lineup, and right now that variety approach seems to be working.  \"There is a type of uncertainty in the market that we are observing,\" Weber said. \"For us, it is really key that you find the right solution\" for your individual needs, he added.              Even so, the Neue Klasse platform is a quantum leap over BMW's successful current EV offerings. The platform has been developed from the ground up with all-electric vehicles in mind, unlike some current models, and it integrates batteries in the structure of the car instead of placing them on a plate that sits on the floor. It will pack new batteries rated at 75-, 90-, and 105-kWh capacities, as well as an 800-volt electric architecture capable of charging speeds of up to 270 kilowatts—which should make these cars among the quickest-charging ones on the road.  The Vision Neue Klasse X is expected to go on sale in the second half of next year, possibly named the next-generation iX3. BMW officials said it will eventually be built in Hungary, China and Mexico, which should allow it to qualify for EV tax incentives.    Gallery: BMW Vision Neue Klasse X Concept              28 Photos                                                                                                The Neue Klasse EVs will use new cylindrical battery cells capable of more energy density, higher range and reduced charging times compared to BMW's current EVs. Moreover, Weber said that the Neue Klasse previews whole new families of technologies that will be seen throughout the BMW product portfolio, including hybrid and gas-powered cars. \"Everything you see on that car ends up in series production,\" he said, which could include more powerful onboard computing, more advanced automated driving functions and potentially other functions.  \"The Neue Klasse will renew all the technologies that will be available throughout the BMW product portfolio,\" Weber said. \"It is part of our strategy to make this latest technology available to most of our products in a very, very short period of time.\" Contact the author: patrick.george@insideevs.com  More BMW News           BMW Vision Neue Klasse X: Seriously Upgraded Battery And Tech, Controversial Looks           EVs With The Highest Claimed Charging Power: Hummer, Silverado And Lucid Air           2024 BMW iX xDrive50 Long-Term Intro: Powering Through Winter With Superb Range           BMW Will Pay EV Buyers $1,000 To Dump Their Tesla           Tesla-Rivaling 'Ionna' Charging Network From Seven Automakers Starts Taking Shape           The BMW i5 Touring Is The Electric Wagon You Want But Can't Have    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713357/tesla-cyberhammer-referral-cybertruck-reward/",
        "image_path": "https://cdn.motor1.com/images/mgl/qk6ME1/s3/tesla-cyberhammer.jpg",
        "date": "Thu, 21 Mar 2024 23:05:24 +0000",
        "new_content": " It should come as no surprise to longtime followers of Tesla that the automaker has, once again, done something extraordinarily goofy. But then again, we're here talking about it, so maybe the joke's on us.  Behold, the CyberHammer. The electric automaker on Thursday said it will make 800 Cybertruck-inspired sledgehammers available through its referral program. Tesla said it would release the hammers in small batches, apparently so that customers with tons of credits don't snatch them all up in a day.   Get Fully Charged  Tesla's latest knick knack  Tesla routinely launches goofy new products aimed at its most hardcore fans. Following up on CyberBeer and Tesla Tequila is the CyberHammer, a Cybertruck-inspired sledgehammer.     Some background for if you're new around here: This is all a reference to the reveal event for Tesla's angular, apocalyptic pickup truck, which happened in November 2019. To demonstrate the strength of the Cybertruck's stainless-steel body, Tesla chief designer Franz von Holzhausen bashed its door with a sledgehammer.    It bounced right off, leaving no discernible dent. Famously, von Holzhausen then tossed a metal ball at the truck's windows. That didn't go so well. This is why the CyberHammer bears the word \"FRANZ\" on it. Whether that's an actual autograph or a decal is unclear. The matte-black hammer matches the wrap on Holzhausen's Cybertruck.  Tesla's referral program provides owners codes they can give to friends. When someone buys a Tesla with an owner's code, the owner gets credits that are redeemable for various awards. Currently, the program includes things like free Supercharging and Tesla merch.   While Tesla famously doesn't do much traditional marketing or advertising, it is very adept at getting owners and fans excited about the brand. One way it does that is through limited-edition knick knacks like the CyberHammer.  In the past, Elon Musk's company has sold short shorts (a dig at those betting against Tesla's stock), a Tesla-branded tequila and a slew of Cybertruck-related paraphernalia. That includes a $50 stainless-steel bottle opener (named the CyberOpener, naturally), bottles of CyberBeer and CyberSteins from which to drink it.  Since the Cybertruck went on sale in November, owners have put Tesla's claims about the truck's resilience to the test. They've shot their pickups with machine guns and bashed them with bats, often for social media clout.  So stay tuned for videos of people bonking their Cybertrucks with CyberHammers while CyberTrashed on CyberBeer.  Contact the author: tim.levin@insideevs.com  More Tesla News               World's First Tesla Cybertruck Teardown Shows Botched Door Hinge Install           Tesla Giga Texas 4680 Battery Cell Production Reached A New Record           EVs With The Highest Claimed Charging Power: Hummer, Silverado And Lucid Air           Tesla Cybertruck Has The 'Worst Panel Gap' MKBHD Has Ever Seen    "
    },
    {
        "domain": "insideevs.com",
        "url_parts": "https://insideevs.com/news/713354/chevrolet-blazer-ev-reimbursement/",
        "image_path": "https://cdn.motor1.com/images/mgl/8ANymq/s3/blazer-ev-trip-8.jpg",
        "date": "Thu, 21 Mar 2024 22:02:21 +0000",
        "new_content": " General Motors is handing out checks to customers who bought its Chevrolet Blazer EV before a price cut earlier this month. That's according to Edmunds, which has the electric SUV in its long-term test fleet and got a letter in the mail from Chevrolet regarding the refunds.  Edmunds said it qualifies for $5,620 back, since the Blazer EV RS AWD it purchased got its base price chopped from $60,215 to $54,595. Customers who bought a Blazer LT AWD are eligible for up to $6,520 to make up for the discrepancy between old and new pricing.   Get Fully Charged  The Chevrolet Blazer EV's rocky start  Chevy pulled the Blazer EV from the market late last year due to software issues that were first reported by InsideEVs. General Motors restarted sales earlier this month, cutting the Blazer's price by thousands across trims.      Customers who bought a 2024 Blazer EV before March 7 of this year qualify for reimbursements, the letter said. A GM spokesperson confirmed that the reimbursements reflect the difference in old versus new MSRPs. Chevrolet had said earlier this month that early customers would get reimbursed. Shortly after launching the Blazer EV last year, GM pulled it from the market due to software issues that were first reported by InsideEVs. GM spent months working on a fix before ultimately restarting sales in early March with reduced pricing.  The reimbursement strikes us as an easy, relatively low-cost way for GM to make good with Blazer EV owners and show its early adopters that it won't leave them behind. Similarly, Ford issued refunds to Mustang Mach-E buyers after it cut prices last year. But not all automakers are so kind.   Get the InsideEvs Newsletter Sign Up Today   Tesla has issued numerous drastic price cuts over the last year or so without compensating customers. Lower prices are great for buyers. But they're not so great when the Tesla Model Y Long Range you bought for close to $70,000 is worth $20,000 less basically overnight.  Contact the author: tim.levin@insideevs.com  More GM News               Four Electric Pickup Trucks Were Driven Until They Died. Only One Met Its Advertised Range           How GM Got The Chevy Blazer EV Back On The Road After 16,000 Miles Of Daily Testing           Rivian R2 Vs. The Competition: How It Compares To Tesla Model Y, Ioniq 5 And More               We Tried Charging A Rivian And Chevy Bolt With Ford's Tesla Adapter    "
    }
]