[
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/22/hyundai-ioniq-6-kona-ev-cheapest-cars-to-lease/",
        "date": " Mar 22 2024 - 2:14 pm PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Hyundai IONIQ 6, Kona EV are two of the cheapest cars (EV or gas) to lease at just $169/mo",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/Hyundai-cheapest-cars-to-lease.jpeg?quality=82&strip=all&w=1400",
        "content": "\n\n\nWho said EVs are not affordable? Hyundai is offering two of the cheapest cars to lease (EV or gas-powered), the IONIQ 6 and Kona EV, in the US, with prices as low as $169 per month.\n \n\n\nHyundai EVs are some of the cheapest cars to lease\nAfter selling a record number of vehicles in the US, Hyundai looks to keep the momentum rolling in 2024.\nAccording to S&P Global registration data, Hyundai was the fourth best-selling EV maker in 2024, with 51,411 electric cars delivered, or 4.5% of the US EV market. Including Kia and Genesis, Hyundai Motor was second, behind only Tesla.\nThe pace continued in January, with Hyundai’s EV registrations up 79% YOY. Hyundai’s IONIQ 5 led with 2,436 registrations, followed by the IONIQ 6 with 1,063. \nEarlier this month, Hyundai introduced its “Getaway Sales Event,” offering savings on popular models, including its all-electric vehicles. \nHyundai sweetened the deal mid-month with new deals on some of its most popular EVs. After introducing new deals, the IONIQ 6 and Kona EV are some of the cheapest cars, gas or electric, to lease in the US. \nHyundai IONIQ 6 Limited (Source: Hyundai)\nEarlier this month, we reported Hyundai was offering a rare 0% APR rate on the IONIQ 5. Now, the deals are even better.\nLease rates as low as $169 per month\nHyundai cut lease rates as low as $239 per month on the 2024 IONIQ 6 SE. That’s with only $239 due at signing (including a $7,500 EV lease bonus). Unlike most leases, Hyundai is only requiring the first month as a down payment.\nAccording to online auto research firm CarsDirect, Hyundai’s IONIQ 6 is the cheapest car to lease in the US, gas or electric, at an effective cost of just $249 per month.\n2024 Hyundai IONIQ 6 SE (Source: Hyundai)\nThe IONIQ 6 SE AWD is on sale for $319 per month, with $319 at signing. Hyundai’s IONIQ 6 is even cheaper to lease than a 2024 Toyota Corolla LE ($382/mo). \nHyundai’s IONIQ 6 deals include $10,000 in lease cash. According to Hyundai spokesperson Miles Johnson, this is “not a typo.”\n(Source: Boston Consulting Group)\n\nTop comment by Grant\n\nLiked by 15 people\t\t\n\nThat Ioniq 6 is begging to be leased at that price. Why buy a used car for your kid when you can give them one of these on a lease? I don’t want to hear people complaining of new car prices after seeing this deal. \nView all comments\n\nA recent report from Boston Consulting Group found the Hyundai IONIQ 6 was the only EV that met potential buyers’ median price, range, and charging targets. With up to 350 miles range, fast charging in under 20 minutes, and an affordable price, the IONIQ 6 offers it all.\n2024 Hyundai IONIQ 6 trimBattery(kWh)Estimated Range(miles)Starting PriceSE Standard Range RWD53240$38,615SE RWD77.4361$43,656SEL RWD77.4305$46,365Limited RWD77.4305$51,265SE Dual Motor AWD77.4316$47,065SEL Dual Motor AWD77.4270$49,865Limited Dual Motor AWD77.4270$54,7652024 Hyundai IONIQ 6 starting price and range\nThe Kona EV is among the cheapest leases with rates as low as $169 per month with $1,999 due at signing. That equals out to around $252 per month, nearly $80 less than the previous deal. \n2024 Hyundai Kona EV (Source: Hyundai)\nFor just $10 more per month, you can upgrade to the Kona Electric SEL, which has 60 more miles of range and added features.\nReady to take advantage of some of the lowest lease rates available? You can use our links below to find great deals on Hyundai’s EVs at a dealer near you.\n\nHyundai IONIQ 6\nHyundai IONIQ 5\nHyundai Kona Electric\n\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/22/virginia-first-18-nevi-ev-chargers/",
        "date": " Mar 22 2024 - 12:39 pm PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Here’s where Virginia is installing its first 18 NEVI EV chargers",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2022/02/BMw-i4-charging-Electrify-America.jpg?quality=82&strip=all&w=1600",
        "content": "\n\n \n\t\t\t\tPhoto: Electrify America\t\t\t\n\nVirginia is handing out $11.295 million in federal grants to install 18 NEVI-compliant EV chargers – here’s where they’re going.\n\nThis week, the Virginia Department of Transportation (DOT) announced the first round of National Electric Vehicle Infrastructure (NEVI) federal grant winners. The EV charging stations will be sited along designated Alternative Fuel Corridors of interstates and major highways. \nThe federal NEVI program allocates $5 billion over five years to help US states create a network of EV charging stations. The funding comes from the Bipartisan Infrastructure Law.\nThe NEVI program requires EV charging stations to be available every 50 miles and within one travel mile of the Alternative Fuel Corridor. EV charging stations must include at least four ports with connectors capable of simultaneously charging four EVs at 150 kilowatts (kW) each, with a total station power capacity of 600 kW or more.\nThe charging stations must have 24-hour public accessibility and provide amenities like restrooms, food and beverage, and shelter.\nOut of the 18 federal grant recipients, eight are in the Richmond area; four are in the Staunton area, three are in Bristol; and Salem, Hampton Roads, and Fredericksburg are each getting an NEVI-compliant EV charging station. VDOT does not state when the chargers are expected to be installed, but notices to proceed appear to be issued around three months after the grant announcements.\n\nRetailers such as Circle K, BP, Love’s Travel Stops, Amoco, Pilot Travel Center, and Valero are on the list. Some motels that are near 24-hour amenities are also on the list. \nCharge Ahead Partnership executive director Jay Smith said, “We applaud VDOT for awarding several of the grants in this first round to businesses that have been serving drivers for decades and will be serving drivers for years to come. These grants will eventually dry up, so every dollar that goes to a business positioned to grow this investment into a sustainable operation that is not dependent on federal funds is a win for the Commonwealth.”\nVirginia will receive $106 million of NEVI grants from 2022 to 2027 to help businesses to build, own and operate DC fast charging stations. \nRead more: This map shows where North Carolina’s first NEVI EV charging stations will be\n\nIf you live in an area that has frequent natural disaster events, and are interested in making your home more resilient to power outages, consider going solar and adding a battery storage system. To make sure you find a trusted, reliable solar installer near you that offers competitive pricing, check out EnergySage, a free service that makes it easy for you to go solar. They have hundreds of pre-vetted solar installers competing for your business, ensuring you get high quality solutions and save 20-30% compared to going it alone. Plus, it’s free to use and you won’t get sales calls until you select an installer and share your phone number with them.\nYour personalized solar quotes are easy to compare online and you’ll get access to unbiased Energy Advisers to help you every step of the way. Get started here. –ad*\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/22/podcast-tesla-slows-production-audi-q6-e-tron-gm-ultium/",
        "date": " Mar 22 2024 - 12:19 pm PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Podcast: Tesla slows production, Audi Q6 e-tron, GM Ultium turns a corner, and more",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2017/12/business_card-1.jpg?quality=82&strip=all&w=1600",
        "content": "\n\n\nOn the Electrek Podcast, we discuss the most popular news in the world of sustainable transport and energy. In this week’s episode, we discuss Tesla slowing down production, Audi Q6 e-tron unveiling, GM Ultium turning a corner, and more.\n\n\nThe show is live every Friday at 4 p.m. ET on Electrek’s YouTube channel.\nAs a reminder, we’ll have an accompanying post, like this one, on the site with an embedded link to the live stream. Head to the YouTube channel to get your questions and comments in.\nAfter the show ends at around 5 p.m. ET, the video will be archived on YouTube and the audio on all your favorite podcast apps:\n\nApple Podcasts\nSpotify\nOvercast\nPocket Casts\nCastro\nRSS\n\nWe now have a Patreon if you want to help us avoid more ads and invest more in our content. We have some awesome gifts for our Patreons and more coming.\nHere are a few of the articles that we will discuss during the podcast:\n\nTesla (TSLA) stock drops on report it is reducing EV output at Giga Shanghai\nTesla produces enough battery cells for 1,000 Cybertrucks a week\nTesla Cybertruck resale market loses all momentum\nTesla Cybertruck is wireless inductive charging-ready\nTesla Roadster won’t really be a car, says Elon Musk\nFirst non-Tesla branded V4 Superchargers are being deployed\nRivian gains access to Tesla’s Supercharger network, free adapter coming\nAudi unveils Q6 e-tron: a new standard for next-gen premium EVs\nFord plans affordable small electric pickup and SUV, starting around $25,000\nGM believes ‘production hell’ is behind it with plans to build 20X more Ultium EVs in 2024\nFisker (FSR) stock falls after failing to make an interest payment, pauses EV production\nAptera CEOs discuss IPO plans, solar EV production, 3-wheel variants, and a possible 4-wheel model\n\nHere’s the live stream for today’s episode starting at 4:00 p.m. ET (or the video after 5 p.m. ET):\n\n\n\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/22/ford-build-affordable-ev-platform-overseas-revamp-sales/",
        "date": " Mar 22 2024 - 11:33 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Ford may build its affordable EV platform in this key overseas market to revamp sales",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/Ford-affordable-EV-platform.jpeg?quality=82&strip=all&w=1400",
        "content": "\n\n\nAmid its shift to more affordable electric vehicles, Ford could build its new EV platform overseas as it looks to revamp sales.\n \n\n\nFord mulls affordable EV platform production in India\nAccording to a new report from Autocar India, Ford is looking to re-enter India. India topped Japan again to maintain the third-largest auto market globally in 2023.\nSources say that although Ford is looking at relaunching the Everest or Endeavour, EVs could play a bigger role. \nFord’s international markets group (IMG) president, Kay Hart, visited the country as the automaker mulls its next steps. The American automaker put off plans to sell its factory on the outskirts of Chennai earlier this year.\nFor Ford to “justify reopening the factory, it needs to get local production,” one of the sources said. Although Ford could import the Mustang Mach-E, the company may have bigger plans.\nAccording to the sources, Ford is looking to build an EV platform in India. The platform would be used for the country and other overseas markets. \nFord Mustang Mach-E (Source: Ford)\nCEO Jim Farley revealed plans for a more affordable EV platform last month. Ford put together a “skunk works” team led by Alan Clarke, who led the engineering of Tesla’s Model Y, to develop it. \nFord will use the platform to power a smaller electric pickup and SUV. According to sources, the first model is due out in 2026, with starting prices around $25,000. These smaller, lower-cost EVs could resonate with buyers in India.\nA Ford India spokesperson acknowledged the visit but didn’t provide details on the models. The spokesperson added, “We plan to create 2,500-3,000 additional jobs over the next three years.”\nAll-electric Ford Explorer (Source: Ford)\nFord halted production in India in September 2021. Despite significant investments, Ford “accumulated operating losses of more than $2 billion over the past 10 years,” the automaker said in a statement.\nThe company said it would begin importing models like the fully electric Mustang Mach-E but didn’t give a timeline.\nFord isn’t the only American automaker looking to build EVS in India. Tesla has been negotiating with the country for years, looking for ways to avoid its high import duties.\nNew Tesla Model 3 (Courtesy of Tesla, Inc.)\nIndia introduced a new scheme to promote EV manufacturing in the country. The scheme gives automakers access to 15% lower import duties on EVs valued “$35,000 USD or above for a total period of 5 years.” However, there are several stipulations.\nAs it looks to expand overseas, Ford officially delivered the first F-150 Lightning in Norway last month, its first market outside North America.\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/22/niu-kqi3-max-e-scooter-z-grills-wood-pellet-grill-more/",
        "date": " Mar 22 2024 - 10:47 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Save $240 on NIU KQi3 Max e-scooter at $760, wood pellet grill hits $319, electric tools, more",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/NIU-KQI3-MAX-electric-scooter.jpg?quality=82&strip=all&w=1200",
        "content": "\n\n\nHeadlining today’s green deals is a one-day sale on the NIU KQi3 Max Foldable Electric KickScooter for $760. It is joined by the updated Z Grills 550B2 Wood Pellet Grill and Smoker at $319, as well as another one-day sale on the Greenworks 80V 18-inch Cordless Electric Chainsaw with a 4.0Ah battery at a new $280 low. Plus, all of the other best new Green Deals landing this week.\nHead below for other New Green Deals we’ve found today and, of course, Electrek’s best EV buying and leasing deals. Also, check out the new Electrek Tesla Shop for the best deals on Tesla accessories.\n\nNIU KQi3 Max Foldable Electric KickScooter now $760\nAfter yesterday’s 24-hour sale on the NIU KQi2, Best Buy is back for today only to offer the NIU KQi3 Max Foldable Electric KickScooter for $759.99 shipped. Normally fetching $1,000, this model saw few discounts over 2023, dropping to $559 with the biggest of them. Today’s deal comes in as a 24% markdown off the going rate, beating our previous mention by $39 and lands at the fourth-lowest price we have tracked. Equipped with a 450W rear-wheel drive motor and a 48V battery, this scooter can reach top speeds of 23.6 MPH with a range of up to 40 miles and can handle up to a 25% incline. It features a triple braking system alongside self-healing tires that are able to seal themselves if and when punctured, giving you a more worry-free ride. It also features a halo headlight, brake lights, a foldable frame, and an array of smart capabilities through the NIU app or the LED display, such as allowing you to lock your scooter, check your riding statistics, and even customize your speed and cruise control functions.\nWhile the KQi2 Pro Foldable Electric Kick Scooter is no longer sitting at $380, it is still discounted to $400 on Best Buy, down from $599. You’ll also find this price matching the current Amazon listing as well. It comes equipped with a 300W rear-wheel drive and a 48V battery that pushes the scooter up to 17.4 MPH speeds for a 25-mile range on a single 7-hour charge. It features four riding modes, an IP54 water-resistance rating, 10-inch wheels, an LED headlight and taillight, a front drum brake as well as a rear regenerative brake, an LED dashboard display, and a foldable body for easy transport and storage. Like the model above, you’ll also get smart controls through the companion app to adjust settings to fit your needs.\nZ Grills wood pellet grill and smoker hits $319\nAmazon is offering the Z Grills 550B2 Wood Pellet Grill and Smoker for $319.20 shipped. Regularly $399, it saw its fair share of discounts over 2023 and into the new year, however, most of them have been much smaller, with the biggest dropping costs down to $349 during Labor Day sales. Today’s deal comes in as a solid $80 off the going rate and lands at the second-lowest price we have tracked – just $14 above the all-time low. This updated grill and smoker utilizes wood pellets as a fuel source for maximum flavor and reduced emissions lower than that of charcoal, providing 8-in-1 versatility (bake, grill, smoke, BBQ, roast, braise, barbeque, char-grill). Featuring a PID auto-temperature controller, with a real-time temperature display and pre-settable temperatures, this grill and smoker will do all the work for you by auto-tuning the fuel feed and airflow rate making it ideal for beginners.\nSave on this electric Greenworks chainsaw\nWe’re getting two Best Buy one-day green deals this morning, having already covered the short-timed discount for the KQi3 Max e-scooter. Now you can also find the Greenworks 80V 18-inch Cordless Electric Chainsaw with 4.0Ah battery for $279.99 shipped. Down from a $400 price tag, this particular combo of tool and battery saw very few discounts over 2023, with today’s deal being the first of the new year. It comes in as a 30% markdown off the going rate and marks a new all-time low.\nEquipped with a 18-inch bar and chain, as well as a 4.0Ah battery and rapid-charger, this chainsaw allows up to 270 cuts on 4×4 lumber on a single charge. The brushless motor also has “twice the torque of its brushed counterparts,” and its automatic oiler will ensure an evenly lubricated chain and increased productivity. There is no need to struggle with starter ropes as its been replaced with a simple and easy push button start. Also includes charger and scabbard.\nSpring e-bike deals!\n\nSuper73 RX Electric Motorbike: $2,999 (Reg. $3695)\nLynx All-Terrain e-bike: $2,999 (Reg. $3,999)\nJuiced’s HyperScrambler 2: $1,999 (Reg. $3,499)\nAventon Aventure.2 All-Terrain e-bike with free extra battery: $1,799 ($2,499 value)\nAventon Abound Cargo e-bike with $372 in free accessories: $1,799 (Reg. $2,199)\nLectric XPedition Cargo Dual-battery e-bike with $405 in free accessories: $1,789 (Reg. $2,104\nLectric XPedition Cargo e-bike with $405 in free accessories: $1,475 (Reg. $1,804)\nHeybike Brawn Fat-Tire e-bike: $1,449 (Reg. $1,800)\nHover-1 Altai Pro R500 e-bike: $1,221 (Reg. $2,300)\nElectric Bike Co. Model J e-bike: $1,299 (Reg. $1,499)\nVelotric Go 1 Utility e-bike: $1,299 (Reg. $1,799)\nTrek Electra Cruiser Go! Step-Over e-bike: $1,200 (Reg. $1,600)\nVelotric Discover 1 e-bike: $1,099 (Reg. $1,599)\nAventon Pace 500.2 e-bike: $999 (Reg. $1,599)\nOKAI Stride Electric Bike: $930 (Reg. $1,600)\nHeybike Mars Foldable e-bike: $799 (Reg. $1,200)\n\n\nOther new Green Deals landing this week\nThe savings this week are also continuing to a collection of other markdowns. To the same tune as the offers above, these all help you take a more energy-conscious approach to your routine. Winter means you can lock in even better off-season price cuts on electric tools for the lawn while saving on EVs and tons of other gear.\n\nBaseus’ regularly $170 6-port 48,000mAh portable USB-C power station now $66\nRad Power flash sale gives you $100 off e-bike and free accessory starting from $1,299\nGoal Zero’s Yeti 200X 187Wh portable power station now $176 (Save $124), more from $309\nAmazon’s Big Spring Sale takes up to 45% off Schwinn e-bikes starting from $590\nDEWALT’s 20V MAX 1/2-inch drill/driver kit hits new $99 low ($80 off), more starting from $129\nKingChii Pro 02 8-in-1 wood pellet smoker and grill falls to new $239 low (Reg. $500)\nSave $780 on Hiboy’s EX6 step-thru fat-tire e-bike at new $800 low during Big Spring Sale\nAmazon’s Spring Sale takes up to 41% off Jackery power stations starting from $100\nSave up to 45% on Greenworks’ electric mowers, blowers, trimmers, and more starting from $80\nEcoFlow power stations, solar panels, bundles receive up to 45% discounts for Big Spring Sale\nWORX 20V PowerShare 10-inch cordless chainsaw falls to $99 ($51 off), more from $76\n‘World’s first’ smart indoor smoker from GE receives second discount to $850 ($149 off)\nWallbox Pulsar Plus lvl 2 EV charger with NEMA 14-50 plug starts from $449 low (Reg. $649)\nVelotric adds T1 ST e-bike with Apple Find My to spring sale for return $1,099 low (Reg. $1,499)\nGreenworks 24V 600 PSI cordless power cleaner falls to $124 (Save $76), more from $174\nEcoSmart’s ECO 36 240V electric tankless water heater keeps temps high at new $399 low\nSave $1,000 on Greenworks 80V 42-inch CrossoverZ electric riding lawn mower for $4,500\nAventon adds Sinch.2 e-bike to flash sale with free extra battery for $1,499 ($1,999 value)\nLectric’s new ONE e-bike sees $220 launch discount with $220 in added free gear\nALLPOWERS power stations, bundles, and accessories up to 45% off starting from $89\nAnker’s new SOLIX C800 Plus 768Wh power station sees launch discount to $499 (Reg. $649)\nGreenworks’ 1900 PSI electric pressure washer covers spring cleaning from $110 (Reg. $220)\nBundle Juiced’s new 52V G2 battery with a discounted e-bike starting at $1,649 ($2,199+ value)\nGet up to $892 in savings on Blix e-bikes with free accessory bundles starting from $1,499\nElectric Bike Co.’s Model A e-bike offers 60-mile range with free anti-theft alarm at $1,499 (Save $329)\n\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/24/non-bike-bike-gear-reviewed-linka-lasso-smartphone-controlled-chain-lock/",
        "date": " Mar 24 2024 - 7:13 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Non-bike bike gear reviewed: Linka Lasso smartphone-controlled chain lock",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/linka-lasso-header.jpg?quality=82&strip=all&w=1600",
        "content": "\n\n\nI’d like to think that the only thing I need to live a car-free life is my bike and my enthusiasm. But it’s the extra gear that helps me stay as two-wheeled as possible. In this regular column, I take a deep dive into some of the coolest and most interesting gadgets and pieces of kit that make it possible to swap a car for an e-bike on a daily basis. This time, we’re checking out a fascinating smartphone-controlled keyless e-bike lock called the Linka Lasso.\n\nThat’s right, there’s no physical key shipped along with the Lasso, at least not of the metal variety. There is an optional SmartMotion key that works like a fob in a keyless ignition car, but for the most part, the lock is operated completely by your phone.\nI tested two versions, the Linka Lasso 8 and Linka Lasso 10 Moto. They have the same locking mechanism, but 8 and 10 mm hardened steel links, respectively. The Lasso 8 is also shorter with 100 cm (39 inch) chain length, while the Lasso 10 Moto has a larger 140 cm (55 inch) locking circumference. Theoretically, the smaller chain would be fine for e-bikes, while the larger one is meant more for motorcycles, but I’d opt for the larger one on my e-bikes just to give me more room and freedom to lock more of the frame and/or wheels to secure objects.\nThey both have the same Sold Secure Silver rating, though the thicker hardened steel chain links on the Lasso 10 surely stand up to attacks for longer.\n\nThe general idea of the lock is that you use the accompanying smartphone app to unlock Lasso, meaning you don’t need to put yet another key on your crowded keyring. And if you’re the kind of person that only bikes occasionally and thus don’t walk around with your bike lock’s key on you all the time, you don’t need to remember to grab the key on the way out since your phone IS the key.\nAnd to answer the question many of you already thinking, there’s a solution for when your phone’s battery runs out. During the lock setup routine, you have to create a secret code that you enter through the single push button on the lock, which unlocks it. \nGranted, that solution is a bit cumbersome to use since there’s only a single button, and so it takes a lot longer to punch in a code than with a typical wheeled combo lock. But it’s not something you’d ever do unless your phone actually died while your bike was locked up, which I imagine is a pretty rare occurrence. If you’re like me, you starting sweating when your phone battery is under 50%. If you’re a psychopath like my wife that can giggle as your phone battery dips down to 2%, you may want to remember that secret lock code.\n\nUsing the lock for the first time is kind of mind-blowing. The first time you push a software button on your phone and hear your bike chain make a whirring noise then release itself, it kind of blows your mind. It’s a real “welcome to the future” moment. \nThat lock mechanism feels super solid, which it better, since it’s also housing the lock’s battery and electronics. A special little magnetic charging cable is included to charge up the lock, and you better not lose that little cable because of course it’s not the same cable as the one you use to charge your phone.\nAs cool as unlocking your bike lock from your phone is, the device also works with smartwatches. I don’t have a smartwatch, but the Lasso is compatible with many leading smartwatches which means I wouldn’t even actually have to pull out my phone to unlock it, if I had a smartwatch.\n\nObviously, unlocking via a smartphone is the main trick here. But the Linka Lasso is a lot more than just a smartphone lock. The same technology that allows the smartphone-based unlocking also opens the door to a number of other cool features.\nFirst of all, the lock has an optional SmartMotion key, which is basically a proximity tag that you can put on your keyring. But it’s not a direct replacement for a physical key – meaning it’s not just a fancy electronic version of a cut steel pin that you still have to fetch from your keychain. You don’t swipe it or hold it up to the lock like an NFC card. It can stay in your pocket while allowing the Linka Lasso to unlock from the push button on the lock simply by recognizing that the tag is less than one meter (3 feet) away from the lock. That means when you have the SmartMotion key on you, you don’t even have to pull out your phone to unlock your bike. You simply walk up to the lock and push a button. It’s basically the same idea as keyless ignition cars that recognize the key fob is sitting in your pocket.\nThat makes the lock super fast to use. Instead of fumbling in your pocket for keys, unlocking the lock, and then fumbling to put your keys away, you simply walk up to the lock and push a button. It unlocks instantly since it reads the SmartMotion key in your pocket. The process takes literally two seconds. Most of us aren’t so stressed that an extra 20 seconds of key fumbling is going to ruin our day, but it does feel pretty nice to skip that step and just ride away from the bike stand in seconds.\nNext, the connected nature of the lock allows you to actually share unlocking credentials with other people. For example, if my wife and I share a bike, we can also share the “key” to the lock by both being able to unlock it from our phones. Or if you leave your bike at a buddy’s place, you can give him access to unlock it. You can even pair multiple Linka locks, like their Dutch-style wheel lock, to your phone to unlock them all together.\nI should also mention that it’s nice to see that the lock comes with a 5-year warranty. I sometimes worry about how well electronics will hold up when they’re built into things that get knocked around every day.\n\nWhat’s the downside?\nThe first bummer of chain locks is simply that they’re heavy. The Lasso 8 weighs 1.8 kg (3.9 lb), and the Lasso 10 Moto weighs a hefty 3 kg or 6.6 lb. My current favorite lock weighs half of that and has a higher security rating, meaning the Linka Lasso doesn’t win on a per-pound basis. But then again, it does what other locks can’t on the technology side, so the trade-off is there for each person to weigh on their own.\nNext, there’s the issue of battery life. They say that the Linka Lasso’s battery will last for two months if you’re using it with the app, or up to 5 months if you only use the proximity key. That’s pretty good, in my opinion, until you forget that you need to be charging it. As long as you set a reminder to charge it once a month or so, I think it won’t be an issue. But if you ever forget, you’ll be SOL until you bring a little portable battery charger out to your bike, at which point the lock will fire right back up.\nThe lock will also give you notifications that its battery is running low via the smartphone app, so in all fairness, it does its best to not let you forget about it.\n\nThey’re also not cheap, not by a long shot. The Lasso 8 is currently on sale for $149, and the Lasso 10 Moto is on sale for $179. Oh, and if you want that SmartMotion key, that’s an extra $25. You’re really paying for the features here, since while Sold Secure Silver is quite good, there are higher-rated locks for lower cost. So again, it’s not a dollar per dollar basis here, but rather paying for fancier features. \nOh, and it’s got that special little magnetic charging port, meaning if you ever lose that weird little charger, you’ll also be up a creek unless you head back to the Linka to get a replacement. That’s not a charger you’ll find at the corner store.\nSo while there are definitely some downsides, the Lasso has some major upsides that I haven’t seen in any other lock on the market. If it was Sold Secure Gold instead of Silver, I’d be over the moon. But as it stands, I think it’s a great second lock to add your security regiment. Because you’re definitely not locking your nice e-bike up with only one lock, right?!\n\nRead more: The strongest and most secure folding bike lock in the world\nRead more: Adding a headlight to any helmet\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/23/daily-ev-recap-wireless-ev-charging/",
        "date": " Mar 23 2024 - 6:34 pm PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Daily EV Recap: Wireless EV charging",
        "image_path": "No image found",
        "content": "\n\n\n\n\nListen to a recap of the top stories of the day from Electrek. Quick Charge is now available on Apple Podcasts, Spotify, TuneIn and our RSS feed for Overcast and other podcast players.\n\n\nNew episodes of Quick Charge are recorded Monday through Thursday and again on Saturday. Subscribe to our podcast in Apple Podcast or your favorite podcast player to guarantee new episodes are delivered as soon as they’re available.\nStories we discuss in this episode (with links):\nTesla Cybertruck is wireless inductive charging-ready\nBig Auto is begging governments to let them go bankrupt as Chinese EVs loom\nBYD’s new EV, starting at less than $10,000, is stoking fear across the industry\nTesla (TSLA) stock drops on report it is reducing EV output at Giga Shanghai\nSay it ain’t so: BMW, Volkswagen, and Renault take aim at Europe’s ICE ban phase-out\nListen & Subscribe:\n\nApple Podcasts\nSpotify\nTuneIn\n\nShare your thoughts!\nDrop us a line at tips@electrek.co. You can also rate us in Apple Podcasts or recommend us in Overcast to help more people discover the show!\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/23/big-auto-is-begging-governments-to-let-them-go-bankrupt-as-chinese-evs-loom/",
        "date": " Mar 23 2024 - 9:57 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Big Auto is begging governments to let them go bankrupt as Chinese EVs loom",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/02/BYD-first-cargo-ship-1.jpeg?quality=82&strip=all&w=1400",
        "content": "\n\n\nAutomakers are fiercely lobbying governments to water down already-compromised emissions rules, but doing so will only lead to their doom as market entrants that are serious about EVs will continue ramping them anyway.\n\nThe auto industry is electrifying, and all new cars will be electric in the relatively near future. This is not in dispute by any serious person – and any alternative scenario, where humans continue to pollute as much as we do today, will result in worse and worse results for humanity the longer we pollute as climate change becomes progressively worse.\nIt is necessary that we stop burning fossil fuels, and fast. This is not a matter of opinion, it’s a matter of physics, and physics does not care about your arguments to the contrary.\nAnd yet, the auto industry – which is responsible for more pollution than any other sector, at least in rich countries – still lobbies to worsen emissions reduction targets, even when those targets were already pushed back to begin with.\nAutomakers beg governments to let them emit more poison\nWe saw it this week in both Europe and the US. BMW, VW and Renault asked European regulators to push back the 2035 gas car phase-out, despite that this timeline has already been loosened. And in the US, the EPA finalized rules, but softened them due to auto industry lobbying – and the president of the main auto industry lobbyist characterized the final rules as a “stretch goal,” suggesting that he thinks there should be further softening of the already-softened rule.\nEven these softened EPA rules will upend the industry, as current automaker commitments are not enough to meet the targets. Either automakers need to up their game, or someone is going to have to fill the millions-vehicle gap between commitments and requirements. And if traditional automakers don’t fill that gap, then new entrants will.\nThe lobbying is reminiscent of what the industry did from 2017-2021, when it lobbied an ignorant reality TV host to torpedo well-reasoned regulations which would have resulted in significantly more regulatory certainty for the industry. It eventually recognized its error, but Pandora’s box was already opened.\nToday, the exact same automaker lobby which originally lobbied to fracture US and CA regulations – the Alliance for Automotive Innovation, previously known as Global Automakers, led by John Bozzella both then and now – still routinely complains about the two regulatory regimes being different, despite being personally responsible for the current state of affairs.\nThe compulsion against regulation is pathological. Even in situations where it doesn’t make sense to lobby against regulation, businesses will often still do so.\nBut wait, maybe it’s not a compulsion against all regulation. Because at the same time that automakers are begging for the ability to continue the global-scale mass murder that they continually enable (via pollution that kills millions worldwide per year), they’re also begging governments to slow down other parts of the industry that are taking the EV transition seriously.\nNamely: China.\nChinese EVs will grow, whether you like it or not\nChina is actually a little late to the EV party. Until a few years ago, EV market share in China lagged other leading regions, but uptake in recent years has been quite rapid. NEV (EV+PHEV) market share should crest 50% in China next quarter, ahead of basically everywhere except the Nordic countries.\nBut as often happens, China may not always be the first entrant into a market, but once it truly commits its effort to something, those efforts tend to bear fruit rapidly.\nChinese EV sales have started taking off overseas, particularly in Europe. While they still make up a relatively small percentage of the market – around 10% – that share has risen rapidly from less than 1% in 2019 (and it might be higher if Chinese automakers could find more ships, but they’re working on that).\nIn response to this rise in Chinese EV sales, instead of recognizing that they need to pick up their game, European automakers are… begging the EU to investigate the “flood” of Chinese EVs, even to the point of proposing retroactive tariffs. They contend that the Chinese government unfairly subsidizes its auto sector, making prices uncompetitively low. Nevermind that European governments also subsidize their auto sector (not to mention the massive worldwide subsidies for pollution), and that low prices are good for consumers (in fact, if EU consumers are benefitting from Chinese subsidies, that represents a transfer of wealth from China to the EU).\nSure, begging governments for help isn’t the only thing they’re doing, they’re also finally picking their pants up off the floor and considering building cheaper EVs, but both of these actions are in direct conflict to lobbying efforts to loosen emissions regulations. If you’re worried about competition undercutting you and taking control of the EV transition, the answer is not to cut production and pretend that EV sales are going down when they aren’t, it’s to move faster.\nIn the US, the anti-China lobbying has been more pre-emptive. There aren’t significant amounts of Chinese-built EVs in the US, and the country already has a number of protectionist tariffs against China.\nThe recent Inflation Reduction Act, which created hundreds of billions of dollars of incentives for EVs and green energy, does include provisions intended to advantage automakers who avoid using China as any part of their supply chain. And scaremongering about China is abundant throughout US political and economic discussions.\nSo it’s clear that Western automakers aren’t looking to compete on price or volume, they’re looking to change the rules of the game instead – in a way that ensures more pollution and more expensive vehicles for consumers. They don’t want to win the game, they want the ref to hand it to them. It’s gamesmanship – which the industry is well acquainted with.\nRising EV penetration isn’t due to regulatory minimums, it’s due to demand\nBut do we really think that will work? EV penetration has broadly exceeded the minimums set by emissions rules. The driver so far has not been regulatory minimums or targets set by government, it has been consumer demand – and consumer recognition that gas vehicles will soon become an albatross around the neck of anyone who makes the silly decision to buy a new one. We’ve seen it happen in Norway with well above 90% plug-in car sales in advance of its world’s-most-aggressive 2025 target, with China’s rapid rise in EV penetration which caught foreign automakers by surprise, and with California hitting ZEV goals years ahead of schedule.\nSo loosening the rules doesn’t seem likely to slow down consumer demand – and the public wants stronger rules anyway. Instead, it will just annoy customers who are frustrated that there aren’t enough options available (as has been the case for years – look at the excitement over the R3 and EX30 when so few other small EVs exist), and mollify laggard manufacturers into thinking they can take longer to join the party.\nBut if automakers (and countries with prominent auto industries, like Japan) want to survive the transition, they cannot be the last to the party. The longer they wait, the more trouble they’ll be in, and the more advantage they cede to their competition. Doing nothing didn’t work for Kodak in the shift to digital, and it won’t work for automakers during the shift to electric.\nHow do we know this? Because it’s already happened, in this very industry, just over the course of the trailing decade.\nBig Auto let Tesla win\nOver the course of the last ten years, we’ve seen plenty of efforts to regulate away Tesla’s sales model for example, and few for automakers to actually effectively compete against Tesla’s vehicle programs. We’ve also seen industry push, state by state, for abusive EV fees and other silly regulations in a desperate attempt to punish EVs for daring to be a superior choice.\nAll of this happened while Tesla gradually entered more segments, and gradually took over those segments. The first indication was around 2014-2015, when sales of large luxury vehicles fell for every manufacturer except Tesla. This happened again with the Model 3. And the Model Y is now the best-selling vehicle in the world. (As for trucks, well, maybe that’ll be a different story)\nAnd yet, despite a decade of warning, it’s only recently that we’ve started seeing serious EV programs from other automakers start to spin up. But most automakers still only have a few EVs, and many of them still share platforms with gas cars. And due to Tesla’s head start, they’re the one company that has gotten scale and costs to the level that they can arbitrarily cut prices, starting an EV price war that they’re best positioned to deal with.\nIn refusing to act faster to accept the future that’s already here, automakers have already ceded ground. On top of the aforementioned points of market share ceded to Tesla, the industry also gave Tesla the whole concept of fueling stations.\nOver the last decade, every automaker said that charging wasn’t their problem and that someone else would come along to solve it, while simultaneously saying that they can’t ramp EVs because there isn’t enough charging out there.\nTesla also said that there wasn’t enough charging out there… so it built chargers (without having to be forced into doing so). And now, as a result of automakers’ intransigence – and also thanks to President Biden’s infrastructure law, which influenced Tesla to finally open up its Supercharger network – every vehicle manufacturer is now using Tesla’s NACS plug, which means all of them will use its Supercharger network, and Tesla will be able to extract profits on fueling from basically every car on the road. “Tesla, you’re welcome”; signed – the auto industry.\nThe path forward is action, not whining\n\nTop comment by Pitounet\n\nLiked by 18 people\t\t\n\nRising EV penetration isn’t due to regulation, it’s due to demandThis should be comfronted to facts. Countries where the EV adoption is high is countries where ICEs are regulated the most and where EVs are subsidised the most. In countries where Subsidies on EVs have been reduced, EV adoptions significantly slowed down or even went down, even when ICE taxes remain.Over the course of the last ten years, we’ve seen plenty of efforts to regulate away Tesla’s salesWhat Tesla has to do with that. This is about Chinese companies that by the way might also hurt Tesla sales once they put foot on the western ground.EVs are the future, but considering the latest evolution, they might be Chinese EVs (not even Tesla seem to keep up with the Chinese) \nView all comments\n\nDescribing this recent history is not an attempt to brag by those of us who loudly said time and time again that this was coming, it’s intended as a very recent object lesson in how the automakers’ decisions were the wrong ones, and how they could learn from those decisions and make better ones going forward. Refusing to learn from these decisions is an existential threat in a rapidly changing industry.\nIt is clear that business as usual was not the right choice over the last decade, and it’s not going to be the right choice in the next decade either. Relying on the age-old gamesmanship of trying to block new entrants to the market, delay change, and refuse to respond to consumer demand is not going to work for the automakers, especially in a globalized auto market where if you don’t make it, someone else will.\nThis isn’t to say that everyone in the auto industry is bad. There are plenty of people and even companies who “get it.” While BMW, VW and Renault just complained about EU regulations, the EU automakers’ association ACEA said “we are not contesting 2035… now we must get down to it.” And several automakers have stepped up to defend California’s regulations (including, oddly, both BMW and VW, two who are complaining about EU regulations now).\nFrankly, I’ve long said that I don’t care who makes EVs, and that whoever makes them deserves the win. I’d prefer if my country got it together and did something that would benefit its competitiveness long term, but as a living creature on this Earth, my primary interest (and yours as well) is in solving the climate crisis. If we refuse to offer more efficient choices and China does, then China will have demonstrated that it deserves the win. If you don’t like that, then don’t hand it to them.\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/23/this-40000-alibaba-drone-can-carry-a-passenger-but-would-you-risk-it/",
        "date": " Mar 23 2024 - 5:00 am PT\t\t\t\t\t\t\t\t\t\t",
        "title": "This $40,000 Alibaba drone can carry a passenger, but would you risk it?",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/drone-alibaba.jpg?quality=82&strip=all&w=1600",
        "content": "\n\n\nWhen I first got into flying quadcopters (back when they were still called quadcopters), I would sometimes imagine what it would be like to shrink myself down Rick Moranis-style and hop aboard. But now thanks to some enterprising Chinese engineers – or perhaps garage tinkerers – I don’t have to imagine it anymore. Instead of shrinking the passengers down, they’ve scaled up the entire drone and added a pilot’s chair.\nNow the only question is, how brave are you?\n\nMost of the fun electric vehicles I find for the Awesomely Weird Alibaba Electric Vehicle of the Week column seem largely harmless. Most are lumbering and underpowered, with the biggest danger likely being getting cut on an unfinished corner somewhere.\nBut this is one of the few times where I might not actually volunteer to hop on one of these vehicles myself, mostly out of a healthy sense of self-preservation.\nThere’s just something about getting into a mail-order aircraft that has “nope” written all over it for me. But if you’re willing to give it a try and you weigh under 100 kg or 220 lb (including your apparently massive coin purse, and I’m not talking about your wallet), then for a mere $39,000 you could have one of these on the way from China. \nOr at least, you could have one out the door of the factory. However much extra it costs to ship, insure, receive in the port, clear customs – if that’s even possible, plus brokers fees and local trucking, well that’s all on you as well.\n\nThis isn’t the first man-carrying drone we’ve seen in this column. We’ve even gotten a bit creative to get a person up in the air under a drone. But the way the model is hanging onto this drone’s frame for dear life before it’s even left the ground, well that has me an extra bit worried.\nThe pilotable drone (is it a drone if there’s a pilot in it?) claims an operating ceiling of 120 meters or around 400 feet. I’m not sure why it couldn’t go higher, as it seems like once you’re counting your altitude with triple digits, you’ve basically maxed out the risk already.\nClimbing speed is decently quick too, at around 1-2 m/s, meaning you could hit that max altitude in just a minute or two.\nThe operating speed is a bit faster, clocking in at 10 m/s, or around 22 mph. \nSomewhat comically, the only control method is via remote control. That means either you could carry the controller with you and fly like you’re in a video game, or you could let a friend on the ground zip you around. For the latter, I’m not sure what the maximum range of the remote control is, but I suggest you treat that figure with the utmost respect.\nI’m also not sure how you’d go about reconnecting that signal on the way down, though I guess you’d have the rest of your life to figure it out.\n\nI wish we had a bit more info on the technical specs. We know it runs on 24s (roughly 88V) lipo batteries, which are the standard chemistry in the RC industry, though are also the most likely to end in a blaze of glory. But we don’t have any info on the motors or controllers.\nThe limited spec sheet does inform us that the entire thing weighs 220 kg (485 lb), which is frankly more than I was expecting. \n\nTop comment by Anti\n\nLiked by 2 people\t\t\n\nIt’s the Flintstones version of an eVTOL. All that other eVTOLs add to this are higher levels of safety and performance.  \nView all comments\n\nOther than a max flight time of 30 minutes, which is around 29 and a half minutes more than I’d care to spend in the thing, the rest of the device is largely a mystery.\n\nSo, while it’s kind of awesome that something like this exists, let me end with my typical disclaimer to please don’t buy this. I’m not even sure it’s legal in most areas, let alone all the questions about safety. \nThere are better ways to blow $40k, like with 40 awesome Chinese electric boats.\nLet’s leave these kinds of gravity-defying contraptions where they belong, which is the magical place known as Alibaba’s catalog of weird and awesome EVs.\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    },
    {
        "domain": "https://electrek.co",
        "url_parts": "https://electrek.co/2024/03/22/texas-installs-another-big-solar-battery-storage-project/",
        "date": " Mar 22 2024 - 2:36 pm PT\t\t\t\t\t\t\t\t\t\t",
        "title": "Texas installs another big solar + battery storage project",
        "image_path": "https://electrek.co/wp-content/uploads/sites/3/2024/03/Lily-solar-plus-storage-plant-in-texas-MOD.jpg?quality=82&strip=all&w=1600",
        "content": "\n\n \n\t\t\t\tPhoto: Enel North America\t\t\t\n\nPower-hungry Texas needs solar and battery storage to help meet demand and balance the grid, so its largest utility-scale storage operator is delivering.\n\nEnel North America has started constructing the Ables Springs Solar + Storage Project in Kaufman County, near Dallas. The project pairs a 186-megawatt (MW) solar farm with 115 MW/169 MWh battery storage.\nAbles Springs is Enel’s 17th renewables project in the state, where it has installed 3.8 GW of wind and solar plus over 1 GW of grid-scale storage. \nTexas consumes more energy than any other state, and demand is growing. Already the US leader in solar and wind, it’s turning to battery storage to maintain the ERCOT grid’s reliability in the face of extreme weather and rising power needs. It’s expected to add more new grid battery capacity in 2024 – 6.4 gigawatts (GW) – than any other state, according to the US Energy Information Administration. (Let’s not forget that Texas is also the top crude oil- and natural gas-producing state as well – we did say power hungry.) \n“When ERCOT conditions tightened this winter, Enel’s solar and storage plants provided crucial generation and quick-response batteries that helped keep the lights and heat on,” said Stephen Pike, head of Enel Green Power North America.\nAbles Springs is expected to generate 320 GWh of clean energy each year, enough to supply clean power to over 30,000 households. Over its lifetime, the project is expected to generate around $60 million in tax revenue for schools and public services. It’s expected to come online in late 2024.\n\nTop comment by Grant\n\nLiked by 11 people\t\t\n\nI think battery storage may be the key to alleviating the difficulties upgrading the grid to handle electrification. Plus it really can help stabilize the grid itself which I’m sure Texans would appreciate. \nView all comments\n\nJust over a week ago, Enel surpassed 10 GW of installed wind and solar capacity across the US and Canada and over 1 GW of installed utility-scale battery storage. \nRead more: Here’s how solar and wind kept the Texas grid online in 2023’s brutal summer heat\n\nIf you live in an area that has frequent natural disaster events, and are interested in making your home more resilient to power outages, consider going solar and adding a battery storage system. To make sure you find a trusted, reliable solar installer near you that offers competitive pricing, check out EnergySage, a free service that makes it easy for you to go solar. They have hundreds of pre-vetted solar installers competing for your business, ensuring you get high quality solutions and save 20-30% compared to going it alone. Plus, it’s free to use and you won’t get sales calls until you select an installer and share your phone number with them.\nYour personalized solar quotes are easy to compare online and you’ll get access to unbiased Energy Advisers to help you every step of the way. Get started here. –ad*\n\n\nAdd Electrek to your Google News feed. \n\t\t\t \n\nFTC: We use income earning auto affiliate links. More.Stay up to date with the latest content by subscribing to Electrek on Google News.\r\n\r\nYou’re reading Electrek— experts who break news about Tesla, electric vehicles, and green energy, day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews. "
    }
]